{"jobs":[{"Job Location":"Hyderabad\n","Salary":"Rs. 1,00,000 – 1,25,000\/- per annum\n","Navigation":"transdyne-recruitment-linux-support-engineer-0-1-year-hyderabad","Eligibility Criteria":"Should be willing to work in both day and night-shifts.\nCandidates who are willing to commit to the company for at-least two and half years only need to apply.\n","About TransDyne IT Services Pvt Ltd":"TransDyne is based in Hyderabad, India. Using our proprietary software and the latest Internet technologies, we have developed a system for transcription that effectively cuts cost and turnaround time while maintaining the highest level of quality and customer service. We add value to our clients through our customized solutions such as electronic letterhead templates and network compatibility.\nSmartTransfer, our custom web based file transfer system with embedded 128 bit encryption programming, allows sending voice files (from a digital recorder) securely over the Internet, 24 hours a day, 7 days a week. Our toll-free telephone system has the same capabilities. Sending dictations and receiving completed transcripts can be done from your home, office or hospital. Our associate company in the United States, TransDyne Inc., markets our products and services and provides customer support in the United States & Canada. Company Website: www.transdyne.in.\n","Job Category":"IT | Software\n","Job Description":"Should have strong knowledge of Linux OS, Installing applications and hardware, and networking protocols.\nWill be responsible for implementing and configure OS and applications remotely and directly.\nWork Location: Hyderabad (Punjagutta).\n","Date":"18-Sep-2020","Company Name":"TransDyne\n","Experience":"0 to 1 year\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-linux-support-engineer-transdyne-it-services-pvt-ltd-hyderabad-secunderabad-0-to-1-years-250720001206?src=jobsearchDesk&sid=15957174020337997_11 - ","Job Position":"Linux Support Engineer\n","Summary":"TransDyne Recruitment in Hyderabad As Linux Support Engineer. Any Graduates are eligible to apply for this job. More details regarding TransDyne Hyderabad Job Openings is given below.","postTitle":"TransDyne Recruitment | Linux Support Engineer (0-1 year) | Hyderabad"},{"Job Location":"Statewide, Tamil Nadu\n","Navigation":"microchip-freshers-recruitment-2021-applications-engineer-tamil-nadu","Eligibility Criteria":"This position is for candidates who are graduating in the year 2021. The candidate would have majored in Electrical & Electronics Engineering \/ Electronics and Telecommunication Engineering \/ Computer Science.\n","Job Category":"IT | Software\n","Job Description":"The Corporate Applications Engineer (CAE) is a Microchip applications engineer providing technical support to customers, clients, distributors, and representatives.\nThe CAE is knowledgeable and skilled in Microchip products and solutions to guide the customer on selecting, using and troubleshooting products which best fit their requirements.\nThe CAE enables customer self-sufficiency by writing knowledge base articles, application notes, user’s guide, and developing and presenting training.\nThis person will work closely with Microchip FAE, Sales and Marketing teams to provide pre- and post-sales support and solutions to customers.\nThe CAE is passionate about making customers succeed in the marketplace.\n","Date":"18-Sep-2020","Job Responsibilities":"The CAE would:\n","Company Name":"Microchip Technology\n","Experience":"Freshers\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/careers.microchip.com\/jobsearch\/job-details\/corporate-applications-engineer-2021-new-college-graduate-11373-1\/ - ","Desired Skills":"Knowledge of Microcontroller: Knowledge of 8051, ARM, AVR or PIC Microcontrollers will be an advantage.\nKnowledge of protocols used in the industry: Exposure to protocols used in communication and control will be a an advantage.\nKnowledge of peripheral: Exposure to peripherals like ADC, CAN, I2C, PWM, SPI, USART and USB will be an advantage.\nAptitude for Debug: Problem solving and the ability to debug are highly desired.\nGood communication skills: Communication is vital to any organization. Candidates should be able to demonstrate good written and oral communication.\n","Job Position":"Corporate Applications Engineer\n","Note":"Candidates whose final year projects attest to the candidates interest in embedded systems will be valued.\nSimilarly, knowledge of the semiconductor industry and the various players in the industry would be an advantage.\n","Summary":"Microchip Technology Freshers Recruitment 2021 in Tamil Nadu As Applications Engineer. BE, BTech Freshers 2021 are eligible to apply for this job. More details regarding Microchip Technology Frehsers Job Openings 2021 is given below.","postTitle":"Microchip Freshers Recruitment 2021 | Applications Engineer | Tamil Nadu"},{"Job Location":"Bangalore\n","Navigation":"cisco-freshers-recruitment-consulting-engineer-intern-bangalore","Eligibility Criteria":"Recent graduate or on your final year of studies towards a Bachelor’s or Master’s degree in a technical field, such as Networking, Computer Science, Information Technology, Electrical\/Computer Engineering or a similar field.\nMinimum GPA of 8.5 and above.\nThe requirement is for 2021\/22 passout only.\nFluent in English (verbal and written).\nPassionate about networking, information technology or computer science.\nStrong analytical and problem-solving skills with ability to troubleshoot technical problems.\nAbility to multi-task, self-start, and work in a fast-paced team environment and the ability to work independently.\n","Job Category":"IT | Software\n","Date":"18-Sep-2020","Year of Passing":"2021, 2022\n","Job Responsibilities":"Develop complex designs, implement Cisco leading-edge technologies worldwide and provide optimization services to the largest networks and customers in the world.\nConsult to solve problems that cross a broad range of technologies and determine the best solutions for customers.\nReview network requirements and propose designs to meet business needs.\nBuild and maintain relationships with a variety of customers.\n","Company Name":"Cisco\n","Experience":"Freshers\n","Qualification":"BE, BTech, ME, MTech\n","How To Apply":"https:\/\/jobs.cisco.com\/jobs\/ProjectDetail\/Consulting-Engineer-Intern-India-UHR\/1295447 - ","About Cisco":"Cisco Systems Inc is the worldwide leader in networking for the Internet. The company was founded in 1984 by two computer scientists from Stanford University seeking an easier way to connect different types of computer systems.\nCisco Systems shipped its first product in 1986 and is now a multi-national corporation, with over 35,000 employees in more than 115 countries. Today, Cisco solutions are the networking foundations for service providers, small to medium business and enterprise customers which includes corporations, government agencies, utilities and educational institutions.\nCisco’s networking solutions connect people, computing devices and computer networks, allowing people to access or transfer information without regard to differences in time, place or type of computer system.\nIf anyone can lay claim to a ‘heritage’ in an industry as young as global networking, then it is Cisco. Not only does 85 percent of Internet traffic travel across Cisco’s systems, we also use the Internet to run our own business online, from product orders and inventory management through to staff communications and travel expenses.\nSo as you explore the possibilities for your business, start at the beginning. Cisco Systems built the Internet so we know exactly what it takes to get your business online. Take advantage of our experience and knowledge to get the Internet working effectively for your business. Company Website: www.cisco.com.\n","Job Position":"Consulting Engineer Intern\n","Summary":"Cisco Freshers Recruitment in Bangalore For Consulting Engineer Intern Position. BE, BTech, ME, MTech Freshers are eligible to apply for this job. More details regarding Cisco Bangalore Freshers Job Openings is given below.","postTitle":"Cisco Freshers Recruitment | Consulting Engineer Intern | Bangalore"},{"Job Location":"Bangalore\n","Job Requirements":"Good understanding of Security, LAN\/WAN topologies and technologies.\nIn-depth knowledge of OSI Model, TCP\/IP, Network Security basics.\nAbility to work on in a high-level stress and interrupt driven environment\nGood understanding of L2-L7 networking protocols, major Operating Systems such as UNIX \/ Linux\nDemonstrated ability to use in-depth troubleshooting to resolve or workaround customer issues using troubleshooting tools i.e. Wire Shark, Netmon etc.\nRouting and Switching knowledge will be added advantage.\nWilling to work in 24×7 environment in night shifts.\n","Navigation":"sonicwall-freshers-recruitment-graduate-trainee-engineer-intern-bangalore","Eligibility Criteria":"Bachelor’s degree in Computer Science\/Information Sciences\/ Electronic & Communications Engineering\n0 – 1 years networking and network security support experience with solid understanding of LAN\/WAN topologies and technologies.\nIn-depth knowledge of the network protocols: TCP\/IP.\nRouting Protocols like OSPF, RIP, BGP, Firewall, IDS\/IPS will be added advantage.\n","Job Category":"IT | Software\n","Job Description":"SonicWall is looking for Graduates who are comfortable to work in fixed night shifts.\n","Date":"23-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Job Responsibilities":"Responsible for providing technical support across SonicWall product lines via Phone\/Web & Emails in 24x7x365 days environment.\nAssist customers with deployment of SonicWall network security products like Firewall\/IPS and VPN solutions.\nProvide technical solutions and workarounds for end users with their issues on respective product line.\nOwns customer issues from beginning to resolution (handles in place)\nAssists customers by diagnosing problems and providing resolutions for technical and service issues.\nUse troubleshooting techniques and tools to identify products that are defective and follows guidelines in issuing service calls\/contacts.\nAdvises\/educates customers within procedural guidelines to ensure a complete solution to their technical or service questions.\nRecreates, identifies and provides input on unique or recurring customer problems.\nFocuses on delivering a positive customer experience according to SonicWall standards.\nMonitors and tracks issues to ensure accurate resolution.\nCandidate should work closely with the Engineering and other cross functional teams to replicate the issues reported by the customers, validate the bug fixes provided through various patch releases and resolve the customer issues in a professional manner.\nProvide consistent feedback to the team on products supported.\nRemains knowledgeable of SonicWall product line and related industry products and technologies.\n","Company Name":"SonicWall\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"BE\/BTech (CS\/ECE\/IT\/IS)\n","How To Apply":"https:\/\/boards.greenhouse.io\/sonicwall\/jobs\/2347856 - ","Job Position":"Graduate Trainee Engineer (Intern)\n","Summary":"SonicWall Freshers Recruitment in Bangalore As Graduate Trainee Engineer Intern. BE, BTech Freshers 2019, 2020 are eligible to apply for this job. More details regarding SonicWall Bangalore Freshers Job Openings 2020 is given below.","postTitle":"SonicWall Freshers Recruitment | Graduate Trainee Engineer Intern | Bangalore"},{"Job Location":"Chennai\n","Navigation":"zoho-corporation-recruitment-automation-qa-engineer-0-3-years-chennai","Job Category":"IT | Software\n","Job Description":"Analysing features and create use cases\/requirements.\nAbility to create good acceptance and integration test automation scripts and integrate with Continuous integration.\nIdentify regression testing needs and create and maintain an Automated Regression Suite.\nAssist the development of the test automation strategy and focus specifically on maximizing reuse for regression purposes.\nHands on experience with TestNG (Test Run management tool), TestNG annotations, Accessing test data from property files(Data provider utils), Testng xml parallel execution and gradle build management tool.\nIntegrating TestNG with customized reports like extent report.\nAbility to learn new language and automation framework.\n","Date":"18-Sep-2020","Year of Passing":"Upto 2020 Passouts\n","Company Name":"Zoho Corporation\n","Experience":"Freshers \/ 0 to 3 years\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/careers.zohorecruit.com\/recruit\/WebFormServeServlet?rid=41dd848523578013dcdb36500690298e7a9b65b0fb65271f02c3ca4fb57f234agidf62d65585721aed69c3d0236e3a70183 - ","Job Position":"Automation QA Engineer\n","Note":"Students those are graduating in 2021 are not eligible to apply this form.\n","Summary":"Zoho Corporation Recruitment For Freshers and Experienced As Automation QA Engineer. Any Graduate, Post Graduates are eligible to apply for this job. More details regarding Zoho Corporation Chennai Job Openings is given below.","postTitle":"Zoho Corporation Recruitment | Automation QA Engineer (0-3 years) | Chennai"},{"Job Location":"Bangalore\n","Salary":"Rs. 1,74,470\/- per annum\n","Navigation":"hgs-freshers-recruitment-backend-executive-0-1-year-bangalore","Eligibility Criteria":"Any Graduate – Fresher or Experienced (NO – BE, BTech).\nWilling to work in rotational shifts.\n","Job Category":"BPO\n","Job Description":"2 Way cab facility provided.\n5 Days working, 2 Days Off.\n","Date":"18-Sep-2020","Company Name":"HGS (Hinduja Global Solutions)\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-openings-for-back-end-executive-hinduja-global-solutions-limited-bengaluru-bangalore-0-to-1-years-170920000640?src=jddesktop&sid=16004151469619419_1 - ","About HGS (Hinduja Global Solutions)":"A global leader in business process management (BPM) and optimizing the customer experience lifecycle. HGS is helping make its clients more competitive every day. HGS combines technology-powered services in automation, analytics, and digital with domain expertise focusing on back-office processing, contact centers, and HRO solutions to deliver transformational impact to clients.\nOur employees, our clients, and their customers are at the heart of everything we do. HGS operates a global network of customer experience centers across the U.S., Canada, UK, India, Jamaica, UAE, and the Philippines. Company Website: www.teamhgs.com.\n","Desired Skills":"Good communication.\nGood Analytical Skills.\nBasic computer knowledge.\n","Job Position":"Backend Executive (Back Office Executive)\n","Summary":"Hinduja Global Solutions (HGS) Recruitment For Freshers and Experienced in Bangalore For Backend Executive Position. Any Graduates are eligible to apply for this job. More details regarding HGS Bangalore Job Openings is given below.","postTitle":"HGS Freshers Recruitment | Backend Executive (0-1 year) | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,11,473\/- per annum (CTC)\n","Navigation":"virtusa-recruitment-analyst-2018-2019-2020-batch-hyderabad","Eligibility Criteria":"Should sign service agreement of 14 months.\nShould be Open to work in rotational shifts.\nBatch of 2020, if you have cleared final Semester and have mark sheets, then please apply.\n","Job Description":"Review Ads, Search Contents.\nReview Contents given by client – Comments \/ edit.\nReview search contents and classify them as per client guidelines.\n","Date":"22-Sep-2020","No.of Openings":"50\n","Year of Passing":"2018, 2019, 2020 Batch\n","Company Name":"Virtusa\n","Qualification":"BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Analyst-Ads-Curations-jobs-in-Hyderabad-Secunderabad-in-Virtusa-Consulting-Services-Pvt-Ltd-220920600018 - ","Industry Type":"IT-Software – Software Services\n","Desired Skills":"High proficiency in Verbal\/Written English.\nExpert knowledge of MS Excel (analyze and generate reports using Pivot Table, V & H look ups, apply formulaes like sum if, Index, match etc).\nGood working knowledge about Internet.\nAware about how Google search works, good searching skills through use of effective keywords.\nTech Savvy is definitely plus\nFamiliar in searching for goods \/ services \/ ads online.\n","Job Position":"Analyst – Ads Curations\n","Summary":"Virtusa Recruitment in Hyderabad For Analyst Position. BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Virtusa Hyderabad Job Openings is given below.","postTitle":"Virtusa Recruitment | Analyst | 2018, 2019, 2020 Batch | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"oracle-recruitment-applications-developer-0-2-years-bangalore","Eligibility Criteria":"BS degree or equivalent experience relevant to functional area.\n0-2 years of previous software engineering or related experience.\n","Job Category":"IT | Software\n","Job Description":"Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.\nAs a member of the software engineering division, you will develop software according to provided design specifications.\nAnalyze system specifications and existing business processes and information systems.\nBuild enhancements and resolve bugs.\nBuild and execute unit tests and unit test plans.\nWork involves some problem solving with assistance and guidance in understanding and applying company policies and processes.\nGaining competence in own area and acquiring a higher level understanding of role, processes and procedures.\n","Date":"23-Sep-2020","Company Name":"Oracle\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, BS\n","How To Apply":"https:\/\/oracle.taleo.net\/careersection\/2\/jobdetail.ftl?job=20000R8F&tz=GMT%2B05%3A30&tzname=Asia%2FKolkata - ","Job Position":"Applications Developer\n","Note":"Applicants are required to read, write, and speak the following languages: English.\n","Summary":"Oracle Recruitment in Bangalore For Applications Developer Position. BE, BTech, BS Graduates are eligible to apply for this job. More details regarding Oracle Bangalore Job Openings is given below.","postTitle":"Oracle Recruitment | Applications Developer (0-2 years) | Bangalore","Preferred Qualifications":"Software Development & DevOps.\n"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000\/- per annum\n","Contact Person":"HR\nCompany Website:\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"soft-suave-technologies-walkin-full-stack-developer-0-2-years-26th-to-27th-september-2020-bangalore","Walkin Time":"9\n","Job Category":"IT | Software\n","Job Description":"Execute full software development life cycle (SDLC)\nCode, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology.\nDevelop flowcharts, layouts and documentation to identify requirements and solutions\nMaintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes.\nWrite quality and clean code using prescribed specifications.\nEvaluate the interrelationships between programs.\nAnalyze performance of programs and take action to correct deficiencies .\nConfer with users to gain understanding of needed changes or modifications of existing programs.\nResolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"10\n","Year of Passing":"2018, 2019, 2020 batch\n","Walkin Date":"26th, 27th September 2020\n","Company Name":"Soft Suave Technologies\n","Walkin Venue":"Soft Suave Technologies Pvt Ltd, Gayatri Tech Park (4th floor), Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru – 560066.\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-walk-in-bangalore-soft-suave-technologies-private-limited-bengaluru-bangalore-0-to-2-years-190920000575?src=jobsearchDesk&sid=1600548771756218_3 - ","Desired Skills":"Good knowledge in Java, Pyton, Node JS, C++.\nStrong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL.\nLogical and analytical thinking towards the Java programming.\nShould have designed at least one project module using object oriented analysis and design techniques.\nSound knowledge of modern software architecture and development techniques.\nShould be a self initiator and interested in learning new technologies.\n","Job Position":"Full Stack Developer (Trainee Software Engineer – Java, Python, Node JS, C++)\n","Interview Process":"Level 1: Technical Aptitude Test.\nLevel 2: Written Programming Test.\nLevel 3: System Execution of Program.\nLevel 4: HR Interview.\n","Note":"Those who have taken up the interview in last 3 months are not eligible to undergo interview again.\n","Summary":"Soft Suave Technologies Walkin in Bangalore As Full Stack Developer On 26th, 27th September 2020. BE, BTech, ME, MTech, MCA Graduates 2018, 2019, 2020 are eligible for this walkin drive. More details regarding Soft Suave Technologies Bangalore Walkin Drive is given below.","postTitle":"Soft Suave Technologies Walkin | Full Stack Developer (0-2 years) | 26th to 27th September 2020 | Bangalore"},{"Job Location":"Hyderabad\n","Navigation":"globallogic-technologies-freshers-recruitment-associate-analyst-hyderabad","Eligibility Criteria":"Fresher\/Below 1 year experience.\nExcellent written, Verbal Communication, and Interpersonal skills.\nThe individual should have the ability to understand and carry out the allocated tasks and responsibilities in a timely and consistent manner and deliver results so as to exceed one’s own standards.\nStrong work ethic and ability to work with minimal supervision.\nAnalytical thinking and independent decision-making skills.\nTeam player with an exceptional interpersonal and solution-oriented attitude.\nNeed Immediate Joiners.\n","Job Description":"Interesting and challenging work in a large and dynamically developing company.\nExciting projects involving newest technologies.\nProfessional development opportunities.\nExcellent compensation and benefits package, performance bonus program.\nModern and comfortable office facilities.\n","Benefits":"Free two way cab and Food.\n","Date":"18-Sep-2020","Year of Passing":"2016-2019 Passouts\n","Job Responsibilities":"Timely deliver different project’s data at the highest possible quality standard.\nQuickly learn new project requirements.\nUpdate, Validate & Quality Assurance of the data.\nSolve complex problems in time bound and effective manner.\n","Company Name":"GlobalLogic Technologies\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-now-globallogic-hiring-freshers-globallogic-technologies-private-limited-hyderabad-secunderabad-0-to-3-years-230720000336?src=jddesktop&sid=15977028349847645_1 - ","Job Position":"Associate Analyst\n","Summary":"GlobalLogic Technologies Freshers Recruitment in Hyderabad As Associate Analyst. Any Graduate Freshers are eligible to apply for this job. More details regarding GlobalLogic Technologies Hyderabad Freshers Job Openings is given below.","postTitle":"GlobalLogic Technologies Freshers Recruitment | Associate Analyst | Hyderabad"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-data-associate-0-3-years-hyderabad","Job Summary":"About the team: The Alexa Data Services (ADS) organization provides data creation, curation, and analytics services to help develop, test, and train the Alexa AI. We work closely with Amazon Machine Learning (ML) Science and modeling teams, providing the critical data they need to improve Alexas speech recognition and language understanding capabilities.\n","Job Description":"We are hiring Data Associates (1 year contract) in our Hyderabad team to undertake labeling functions such as transcription, annotation and dialogue evaluation on speech & text data to assess and improve Alexas performance.\nAs a Data Associate, you will work on speech and text data.\nWe value your high attention to details and your ability to adapt to dynamic changes due to emerging business requirements.\nYou are recognized as a role model for your proactivity in identifying issues with efficiency and accuracy.\n","Date":"23-Sep-2020","Job Responsibilities":"Work with text, speech and other types of data and attach tags to the contents, at scale.\nDeliver high quality of labeled data, leveraging guidelines to meet specific key performance indicators, and using in-house tools and software.\nReport issues with tools and software to the development team when necessary.\nProvide feedback for improvements to existing tooling that can increase labeling throughput and quality.\nMaintain strict confidentiality and follow all applicable Amazon policies for securing confidential information.\nProficiency in English, Hindi grammar and spelling (both written and verbal).\nComfortable working with speech from various dialects and accents of Hindi.\nWillingness and flexibility to work in shifts including night shift etc.\n","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"High School, Diploma, Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-hindi-data-associate-hyderabad-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-3-years-230920001257 - ","Job Position":"Hindi Data Associate\n","Note":"Work Location: Hyderabad (Only candidates currently in Hyderabad are eligible).\nJob Type: Contractual role for 1 year.\n","Basic Qualifications":"High School or Equivalent diploma\nWork Experience: Maximum of 24 months of experience in any industry\nProficient computer skills in MS Office with good typing speed (> 40 wpm and >90% accuracy), including basic troubleshooting with the ability to utilize proprietary tools.\n","Summary":"Amazon Recruitment in Hyderabad For Data Associate Position. High School, Diploma, Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Data Associate (0-3 years) | Hyderabad"},{"Job Location":"Bangalore\n","Salary":"Rs. 2,75,000 – 4,00,000\/- per annum\n","Documents Required":"Candidates should have all the below documents and should be share the soft copy of documents during final level of interview process.\n","Navigation":"amazon-recruitment-seller-partner-support-0-10-years-bangalore","Job Category":"BPO\n","Date":"18-Sep-2020","No.of Openings":"100\n","Job Responsibilities":"This includes, but is not limited to:\n","Company Name":"Amazon\n","Experience":"0 to 10 years\n","Qualification":"Bachelor Degree\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-seller-partner-support-work-from-home-bangalore-amazon-development-centre-india-pvt-ltd-bengaluru-bangalore-0-to-4-years-070520005081?src=jobsearchDesk&sid=15942454709989181_5 - ","Additional Information":"Information Security: You should be will to sign a undertaking pertaining to do’s and don’ts in accordance to the data Security policy\nErgonomic Furniture: In Amazon we care about your health hence suggest that all employees have an ergonomic chair and desk as their workspace.\n","Job Position":"Seller Partner Support (Seller Support Associate) – Work From Home\n","Note":"Only the shortlisted candidates will receive an email for the initial online assessment from no-reply@talview.com.\nCandidates who are based in Bangalore should apply.\nAll the interviews will happen virtually over video conference and please make sure you have a laptop or desktop with Webcam and good internet connection for taking up assessments and interview.\n","Basic Qualifications":"Education: Bachelor Degree in any discipline with 0-10 years of experience.\nExcellent written and verbal communication in English.\nShifts: The job involves working in a 24\/7 environment including night shifts and the shifts are decided based on the business requirement.\nWeekly Off: Rotational two- consecutive day off (it is a 5-day working week with 2 consecutive days off.\nDuring the first four months (Training & Transition) no unplanned leaves are allowed.\nAbility to use a desktop\/Laptop and familiarity with Internet Browsers, Windows OS, Microsoft Outlook and MS Office.\nHome environment free from background noise where you can connect to the internet and work on your deliverables.\nShould have a good internet connection with a minimum speed of 20 MBPS or better and should have at least 100 GB data from a reliable provider.\nShould have access to mobile phone at all times from a reliable provider.\nShould have power back up in case of power shut down.\nShould be willing interact with Seller over calls \/ email \/ chat depending on the business need.\nImmediate Joiners Only.\n","Summary":"Amazon Recruitment in Bangalore For Seller Partner Support Position. Bachelor Degree Candidates are eligible to apply for this job. More details regarding Amazon Bangalore Job Openings is given below.","postTitle":"Amazon Recruitment | Seller Partner Support (0-10 years) | Bangalore"},{"Job Location":"Bangalore\n","Development Tool":"Eclipse.\n","Navigation":"rakuten-recruitment-java-associate-engineer-0-2-years-bangalore","Eligibility Criteria":"Fresher can apply.\n","Job Category":"IT | Software\n","Job Description":"Should have familiarity and have worked on (Project or real time) following tech stack but not limited to (version numbers could vary):\n","Servers":"JBoss EAP 8 and Wildfly 19 (including Infinispan, Hibernate, Active MQ, Elasticsearch and Keycloak).\n","Date":"18-Sep-2020","No.of Openings":"5\n","Company Name":"Rakuten India Enterprise Pvt Ltd\n","Experience":"Freshers \/ 0 to 2 years\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-associate-engineer-java-fresher-can-apply-rakuten-india-enterprise-pvt-ltd-bengaluru-bangalore-0-to-2-years-170920000404?src=jobsearchDesk&sid=16003736940421964_2 - ","Desired Skills":"Java\nHibernate\nEclipse\nJSF\nActivemq\n","Job Position":"Associate Engineer – Java\n","Summary":"Rakuten India Enterprise Recruitment For Freshers and Experienced As Java Associate Engineer. BE, BTech Graduates are eligible to apply for this job. More details regarding Rakuten Bangalore Job Openings is given below.","postTitle":"Rakuten Recruitment | Java Associate Engineer (0-2 years) | Bangalore"},{"Job Location":"Chennai\n","Navigation":"zoho-corporation-recruitment-technical-support-engineer-0-2-years-chennai","Eligibility Criteria":"Proficiency in English.\nAttention to detail and a strong desire to learn.\nAbility to work independently and deliver value to the customers and the company.\nShould be willing to work in night shifts.\nMust be interested in the accounting and finance side.\n","Job Category":"IT | Software\n","Job Description":"Answering customer queries through phone, e-mail & chat about product features and capabilities.\nHelping customers with basic troubleshooting, configuration difficulties and advanced technical issues in the product by working closely with the development team.\nPrompt communication of customer requirements to the development team.\nFacilitate with product demos, implementations and training.\n","Date":"23-Sep-2020","Year of Passing":"2018, 2019, 2020\n","Company Name":"Zoho Corporation\n","Experience":"0 t o 2 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/careers.zohorecruit.com\/recruit\/WebFormServeServlet?rid=162060bf19ef5bfd9c408621bb66328b6c49a8d3a80058b2d65120b6b5591867gidf62d65585721aed69c3d0236e3a70183 - ","Job Position":"Technical Support Engineer\n","Note":"If you have attended the written test \/ Interview with ZOHO anytime in the past 3 months, you should not attend this test.\nStudents who are graduating in 2021 are not eligible to apply this form.\n","Summary":"Zoho Corporation Recruitment in Chennai For Technical Support Engineer Position. Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Zoho Corporation Chennai Job Openings is given below.","postTitle":"Zoho Corporation Recruitment | Technical Support Engineer (0-2 years) | Chennai"},{"Job Location":"Mumbai\n","Navigation":"lionbridge-recruitment-engineer-mumbai","Eligibility Criteria":"Any Computer course certificate is an added advantage.\n","Job Category":"IT | Software\n","Job Description":"The Localization Engineer helps project managers with technical tasks such as file analysis, preparation, debugging, management, archiving, etc.\nThe Localization Engineer is able to resolve problems inherent in various localization tasks and processes, and participates in the preparation of budgets and schedules.\nHe\/she is in many ways responsible for customer satisfaction.\n","Date":"18-Sep-2020","Job Responsibilities":"File analysis & preparation.\nPreparing instructions & task kits for external teams.\nTM (Translation Memory) and Terminology Management.\nTroubleshooting and problem solving.\nIdentifying tool\/resource requirements.\nAccommodating client requirements.\nCoordinating problem identification and resolution activities between translators and PMs \/ Customers.\nProviding technical support to translation vendors.\n","Company Name":"Lionbridge\n","Soft Skills":"Good level of spoken and written English language.\nGood interpersonal and communication skills.\nAbility to problem solving, show high level of initiative and enthusiasm with attention to detail.\nAbility to judge between independent action and support-seeking.\nAbility to lead and motivate.\nPeople management (team leading, conflict handling).\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/careers.lionbridge.com\/jobs\/engineer-mumbai-maharashtra-india-b4b185e9-67ed-4b70-b360-845e102608e3 - ","Job Position":"Engineer\n","Summary":"Lionbridge Recruitment in Mumbai For Engineer Position. Any Graduates are eligible to apply for this job. More details regarding Lionbridge Mumbai Job Openings is given below.","postTitle":"Lionbridge Recruitment | Engineer | Mumbai","Hard Skills\/Technical Skills Needed":"Good knowledge of ASP, HTML, XML, parsing, validation, tag error fixing.\nGood practical experience on applications like Word, Excel, PPT.\nExhibit the ability to understand of Localization workflow.\nMeet optimum Productivity and quality standards after training.\nKeeping up with new technologies.\nAbility to propose improvements and suggestion.\n"},{"Job Location":"Bangalore\n","Salary":"3,00,000 – 4,00,000\/- per annum\n","Navigation":"amazon-recruitment-automation-analyst-0-2-years-bangalore","Eligibility Criteria":"Any BE\\BTech\\MCA\\MSc or similar course in Computer Science or Information Technology stream.\nHas problem solving skills and attention to details.\nAbility to Organize and execute.\nExperience in technical support background.\nHas the ability to Solve Operation Issues Using Technology.\nUnderstands Scripting, HTML, x-path & reg-ex.\nXML & SQL are preferred skills.\nWilling to work in shifts including work on weekends, and outside of the “standard” work day and if required only 24\/7\/365 availability.\nTo receive security clearance all candidates must undergo a background check\n","Job Category":"IT | Software\n","Job Description":"In this role associates are required to understand different operational techniques and have high level of attention to detail.\nAccuracy of processing is of utmost importance followed by speed.\nHe\/she should consistently deliver results that meet or exceed expectations & understands how the business operates and suggests changes to improve the process.\nThis role would report into the Operations Manager.\n","Date":"18-Sep-2020","NO.of Openings":"50\n","Job Responsibilities":"Meets and\/or exceeds the set productivity and accuracy targets.\nParticipate in ad-hoc operational projects\/initiatives.\nUnderstand operational goals, vision, charter and process steps.\nFollow SOPs as prescribed and provide inputs to improve the process.\n","Company Name":"Amazon\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, MCA, MSc\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-automation-analyst-bangalore-amazon-development-centre-india-pvt-ltd-bengaluru-bangalore-0-to-4-years-310720002297?xp=2 - ","Job Position":"Automation Analyst\n","Summary":"Amazon Recruitment in Bangalore As Automation Analyst. BE, BTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding Amazon Bangalore Job Openings is given below.","postTitle":"Amazon Recruitment | Automation Analyst (0-2 years) | Bangalore"},{"Job Location":"Amazon\n","Salary":"Rs. 2,75,000 – 3,75,000\/- per annum\n","Documents Required":"Updated Resume.\nCandidates should have Pan Card and Government Id Proof.\n","Navigation":"amazon-recruitment-seller-partner-support-0-10-years-hyderabad","Eligibility Criteria":"Qualification – Graduation and above.\nExcellent Written and spoken Communication Skills in English.\nFlexible to work in night shifts and staggered week offs.\nImmediate Joiners only\nCandidate should be based out of Hyderabad.\n2020 passouts are not eligible.\n","Job Category":"BPO\n","Date":"18-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"This includes, but is not limited to:\n","Company Name":"Amazon\n","Experience":"0 to 10 years\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-is-hiring-for-sps-in-associate-work-from-home-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-5-years-280420005178 - ","Additional Information":"Information Security: You should be will to sign a undertaking pertaining to do’s and don’ts in accordance to the data Security policy\nErgonomic Furniture: In Amazon we care about your health hence suggest that all employees have an ergonomic chair and desk as their workspace.\n","Job Position":"Seller Partner Support (SPS Associate) – Work From Home\n","Note":"Candidates who have been interviewed with Amazon in the last 6 months would not be eligible to apply now.\nIf interested please apply and register your details. Only eligible candidates will receive an email.\nAll the assessments \/ interviews will happen virtually over video conference, please make sure you have a laptop or desk top with web camera.\nAnd also a good internet connection to take up assessments and interviews.\n","Basic Qualifications":"Education: Bachelor Degree in any discipline with 0-10 years of experience.\nExcellent written and verbal communication in English.\nShifts: The job involves working in a 24\/7 environment including night shifts and the shifts are decided based on the business requirement.\nWeekly Off: Rotational two- consecutive day off (it is a 5-day working week with 2 consecutive days off.\nDuring the first four months (Training & Transition) no unplanned leaves are allowed.\nAbility to use a desktop\/Laptop and familiarity with Internet Browsers, Windows OS, Microsoft Outlook and MS Office.\nHome environment free from background noise where you can connect to the internet and work on your deliverables.\nShould have a good internet connection with a minimum speed of 20 MBPS or better and should have at least 100 GB data from a reliable provider.\nShould have access to mobile phone at all times from a reliable provider.\nShould have power back up in case of power shut down.\nShould be willing interact with Seller over calls \/ email \/ chat depending on the business need.\n","Summary":"Amazon Recruitment in Hyderabad As Seller Partner Support. Any Graduates, Post Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Seller Partner Support (0-10 years) | Hyderabad"},{"Job Location":"Chennai\n","About Firstsource":"Firstsource is a leading provider of customised Business Process Management (BPM) services. We specialise in helping clients stay ahead of the curve through transformational solutions in order to reimagine business processes and deliver increased efficiency, deeper insights and superior outcomes.\nWe are trusted brand custodians and long-term partners to 100+ leading brands with presence in the US, the UK, the Philippines and India.\nOur ‘rightshore’ delivery model offers solutions covering complete customer lifecycle across Healthcare, Telecommunications & Media, and Banking, Financial Services & Insurance verticals. Company Website: www.firstsource.com.\n","Salary":"Rs. 1,50,000 – 2,50,000\/- per annum\n","Navigation":"firstsource-freshers-recruitment-associate-2018-2019-2020-batch-chennai","Eligibility Criteria":"Only Freshers without arrears.\nGood communication and analytical skills required.\nShould be a quick learner.\nShould be flexible with night shifts (Cab provided).\nShould be within 30 KMS from Navalur.\nImmediate joiners preferred.\nMust be currently from Chennai only.\nOutstation candidates will not be considered.\n","Job Category":"BPO\n","Job Description":"Work Location: OMR, Navalur, Chennai.\n","Date":"18-Sep-2020","No.of Openings":"25\n","Year of Passing":"2018, 2019, 2020 Batch\n","Interview Mode":"Telephonic.\n","Company Name":"Firstsource\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-associate-firstsource-solutions-limited-chennai-0-to-2-years-040720000099?src=jobsearchDesk&sid=16003731445686098_31 - ","Job Position":"Associate (Non Voice Process)\n","Summary":"Firstsource Freshers Recruitment in Chennai For Associate (Non Voice Process) Position. Any Graduate Freshers 2018, 2019, 2020 are eligible to apply for this job. More details regarding Firstsource Chennai Freshers Job Openings is given below.","postTitle":"Firstsource Freshers Recruitment | Associate | 2018, 2019, 2020 Batch | Chennai"},{"Job Location":"Chennai\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"changepond-technologies-freshers-walkin-software-trainee-24th-to-25th-september-2020-chennai","Eligibility Criteria":"Fresher’s only.\nGraduates with an aggregate of minimum 60% in Academics.\nMandate: Java\/.Net Certification from any Training Institute\nGood communication Skills.\n","Walkin Time":"9.30 AM to 12.30 PM\n","Job Category":"IT | Software\n","Job Description":"Changepond Technologies is Hiring Engineering graduates – Freshers For Trainee Position.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"20\n","Year of Passing":"2017, 2018, 2019\n","Walkin Date":"24tth, 25th September 2020\n","Company Name":"Changepond Technologies\n","Walkin Venue":"Changepond Technologies, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai – 603 103. Land Mark: Opposite to TCS 2nd Gate\nContact Person: Kalaiselvan R (HR)\nCompany Website: www.changepond.com\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-engineering-graduates-fresher-s-for-changepond-technologies-changepond-technologies-private-limited-chennai-0-to-1-years-210920002968?src=jobsearchDesk&sid=16007227599368720_2 - ","Job Position":"Software Trainee (.NET\/Java)\n","Summary":"Changepond Technologies Freshers Walkin Drive in Chennai For Software Trainee Position. BE, BTech, MCA Graduates 2017, 2018, 2019 are eligible for this walkin. More details regarding Changepond Technologies Chennai Freshers Walkin is given below.","postTitle":"Changepond Technologies Freshers Walkin | Software Trainee | 24th to 25th September 2020 | Chennai"},{"Job Location":"Across India\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"thyrocare-technologies-freshers-recruitment-business-development-executive-across-india","Eligibility Criteria":"Freshers.\nGraduate\/Pursuing Graduation.\nGood written and verbal communication skill.\nShould know English and additional one Regional language.\nMust have system and internet connectivity at home.\n","Job Description":"Work Locations: Hyderabad, Bengaluru, Chennai, Delhi NCR, Mumbai, Bhubaneshwar, Ahmedabad, Kochi, Kolkata.\n","Benefits":"Work From Home opportunity.\nFull time payroll job.\nMonthly allowance for internet connectivity.\n","Date":"23-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"Procure network members viz; hospital, laboratory, polyclinics that associates with the company to ensure pan-India presence and service.\nEnhance B2B business for company.\nIdentify new sales opportunities within existing association by up-selling and cross-selling.\nImplementing the company strategy across all the territory.\n","Company Name":"Thyrocare Technologies\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-thyrocare-technologies-ltd-chennai-bhubaneshwar-delhi-ncr-mumbai-ahmedabad-bengaluru-bangalore-ernakulam-kochi-cochin-hyderabad-secunderabad-kolkata-0-to-1-years-220920001050?src=jobsearchDesk&sid=1600806475101972_6 - ","Job Position":"Business Development Executive\n","Summary":"Thyrocare Technologies Freshers Recruitment Across India For Business Development Executive Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Thyrocare Technologies Freshers Job Openings is given below.","postTitle":"Thyrocare Technologies Freshers Recruitment | Business Development Executive | Across India"}]}