{"jobs":[{"Job Location":"Chennai\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-content-associate-0-4-years-chennai","Job Description":"Amazon is Hiring For Content Associate with Hindi and HTML Expertise.\n","Date":"24-Sep-2020","Job Responsibilities":"The Primary responsibility of the role is to perform quality checks on web pages and digital content for the e-book reader.\nThe associate needs to perform e-book conversion and would need to have working knowledge of HTML and CSS.\nThe role will require the candidate to quickly understand the eBook content editing tools and operation workflow tools.\nThe associate need to continuously adapt and learn new features on the Editors and improve on acumen to quickly edit and fix up contents.\nShould follow editing SOP to spot\/catch errors in the content.\nThe associate needs to perform content quality check to qualify user experience for content viewing (flow and format quality) and usage on the Kindle device.\nNeed to use software tools for quality audit, content editing and data capture.\nThe associate will need to be aware of the operations metrics like productivity (Number of titles processed per hour), quality (defect %age) and delivery\/latency SLA. The associate will be measured on his compliance to these Metrics, SLA requirements, QA guidelines, team and personal goals.\nThe associate should be a team player and come up with improvement ideas to his direct report and improve the editing\/QA process.\nThe associate will need to often contact stakeholders globally to provide status reports, communicate relevant information and escalate when needed.\nThe role is an individual contributor role.\nThe role requires a graduate degree with exposure to MS office and comfort with numbers.\nIn addition the associate should have attention to detail, good communication skills, and a professional demeanor.\n","Company Name":"Amazon\n","Experience":"0 to 4 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-for-content-associate-with-hindi-html-expertise-amazon-development-centre-india-pvt-ltd-chennai-0-to-4-years-160820000675 - ","Job Position":"Content Associate\n","Basic Qualifications":"Must be a graduate in any stream from any reputable university.\nWorking knowledge of InDesign, HTML, CSS, e-pub, XML standards is mandatory.\nExpertise to read and write Hindi.\nMust possess knowledge in e-book\/print book conversion.\nAbility to meet deadlines in a fast-paced work environment driven by complex software systems and processes.\nShould be self-motivated and a good team player.\nMust pay undivided attention to the details while editing content and diving deep to identify root cause of issues.\nGood at problem solving, data analysis and troubleshooting issues related to content editing.\nGood interpersonal skills to manage ongoing relationships with software team and inter-operations teams Knowledge\/experience in publishing industry would be preferred.\n","Summary":"Amazon Recruitment in Chennai For Content Associate Position. Graduates are eligible to apply for this job. More details regarding Amazon Chennai Job Openings is given below.","postTitle":"Amazon Recruitment | Content Associate (0-4 years) | Chennai"},{"Job Location":"Bangalore\n","About Mphasis":"Mphasis applies next-generation technology to help enterprises transform businesses globally. Customer centricity is foundational to Mphasis and is reflected in the Mphasis’ Front2Back™ Transformation approach. Front2Back™ uses the exponential power of cloud and cognitive to provide hyper-personalized (C=X2C2 TM=1) digital experience to clients and their end customers.\nMphasis’ Service Transformation approach helps ‘shrink the core’ through the application of digital technologies across legacy environments within an enterprise, enabling businesses to stay ahead in a changing world. Mphasis’ core reference architectures and tools, speed and innovation with domain expertise and specialization are key to building strong relationships with marquee clients. Company Website: www.mphasis.com.\n","Salary":"Rs. 1,75,000 – 2,25,000\/- per annum\n","Navigation":"mphasis-recruitment-non-voice-process-0-2-years-bangalore","Eligibility Criteria":"Graduate Fresher\/Experience.\nGood Data Entry and data validation skills.\nGood typing speed.\nOpen to work in 24\/7 shift.\nAbility to work under pressure, managing deadlines and effectively prioritizing work.\nAbility to work within a team.\nSelf-motivated.\n","Job Category":"BPO\n","Job Description":"Mphasis is Hiring for Back Office \/ Non Voice profiles for International Process.\nLooking for Fresher (Graduates) \/ Experience for minimum 1 year in back end operations.\nIncentives, Cab both ways.\n","Date":"23-Sep-2020","No.of Openings":"10\n","Company Name":"Mphasis\n","Experience":"Freshers\/0 to 2 years\n","Qualification":"Any Graduation (BSc, BCom, BA, BBA, BMS, BArch…)\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-for-non-voice-process-mphasis-bangalore-mphasis-limited-bengaluru-bangalore-0-to-2-years-190520003102?src=jobsearchDesk&sid=16004624292321064_19 - ","Job Position":"Non Voice Process\n","Note":"No BE\/BTech\/MTech\/MCA or 10+2 or PUC (Not illegible).\n","Summary":"Mphasis Freshers and Experienced Recruitment in Bangalore For Non Voice Process. Graduates are eligible to apply for this job. More details regarding Mphasis Bangalore Job Openings is given below.","postTitle":"Mphasis Recruitment | Non Voice Process (0-2 years) | Bangalore"},{"Job Location":"Pune\n","Salary":"Rs. 4,00,000\/- per annum\n","Navigation":"incedo-freshers-recruitment-software-engineer-trainee-2019-2020-batch-pune","Eligibility Criteria":"Minimum Marks: 70% (Throughout the academics).\nCandidate should have either UG or PG qualifications.\n","Job Category":"IT | Software\n","Job Description":"Our Hiring Model will include Internship Hiring for 6 months and conversion to FTE basis performance.\nThe offered CTC while conversion to FTE will be 4 LPA.\n","Date":"24-Sep-2020","No.of Openings":"10\n","Company Name":"Incedo\n","Experience":"Freshers\n","Qualification":"BE\/BTech (Computer Science, Electronics and Communication, Information science, Information Technology), MCA.\n2020\/2019 Batch from good Colleges.\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Software-Engineer-Trainee-Pune-jobs-in-Pune-in-Incedo-Technology-Solutions-Ltd-010920600003 - ","Job Positions":"Candidate has to work on the below languages.\n","Desired Skills":"Good written and oral communication skills.\nAnalytical mind with problem-solving aptitude.\nA good team Player.\nAptitude to learn.\n","Job Position":"Software Engineer Trainee\n","Summary":"Incedo Freshers Recruitment in Pune For Software Engineer Trainee Position. BE, BTech, MCA Freshers 2019, 2020 are eligible to apply for this job. More details regarding Incedo Pune Freshers Job Openings 2020 is given below.","postTitle":"Incedo Freshers Recruitment | Software Engineer Trainee | 2019, 2020 Batch | Pune","Primary Skills":"Primary Skills required for this role are\n"},{"Job Location":"Hyderabad\n","Navigation":"hgs-freshers-recruitment-trainee-process-consultant-hyderabad","Eligibility Criteria":"Graduation (Freshers) is mandatory.\nDegree Grads Can Apply.\nBE and BTech graduates are not eligible.\nShifts: Willing to work in Night shifts.\n","Job Category":"BPO\n","Job Description":"HGS is hiring for US Healthcare Voice Process.\nWorking Days: 5 Days.\nWeek Off: 2 days fixed off.\nCab: 2 Way cab facility is provided.\n","Date":"24-Sep-2020","Company Name":"HGS (Hinduja Global Solutions)\n","Experience":"Freshers\n","Qualification":"Any Graduation (BSc, BCA, BCom, BA, BBA, BHM, BMS, BPharma…)\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-trainee-process-consultant-hinduja-global-solutions-limited-hyderabad-secunderabad-0-to-0-years-070920001902?src=jobsearchDesk&sid=15995128761461751_7 - ","Compensation":"1.68 CTC and 9500 take home.\n","Desired Skills":"Good Communication.\nGood Analytical Skills.\nBasic computer knowledge.\n","Job Position":"Trainee Process Consultant\n","Interview Process":"All rounds will be conducted digitally.\n","Summary":"HGS (Hinduja Global Solutions) Freshers Recruitment in Hyderabad As Trainee Process Consultant. Any Graduate Freshers are eligible to apply for this job. More details regarding HGS Hyderabad Freshers Job Openings is given below.","postTitle":"HGS Freshers Recruitment | Trainee Process Consultant | Hyderabad"},{"Job Location":"Hyderabad, Chennai\n","Salary":"During training period a stipend of Rs. 12000\/- PM will be paid.\nAfter successful completion of the training a salary of Rs 3,50,000 PA will be paid.\n","Navigation":"ntt-data-recruitment-oracle-apps-dba-2017-2018-2019-batch-hyderabad-chennai","Eligibility Criteria":"4 years full time Engineers With Oracle DBA \/ Apps DBA Trained.\nOpen to relocate to other locations based on requirements.\nExcellent in communication both verbal and writing.\nThey should be open to work in Shifts as per business needs.\nNationality should be Indian.\n","Selection Process":"Online Assessment.\nTechnical Interview.\nManagement Interview.\n","Job Category":"IT | Software\n","Date":"23-Sep-2020","Year of Passing":"2017, 2018, 2019 Passed out\n","Company Name":"NTT Data\n","Experience":"0 to 1 year\n","Qualification":"BE, BTech, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-excellent-opportunity-for-oracle-apps-dba-role-in-chennai-ntt-data-ntt-data-global-delivery-services-private-limited-chennai-hyderabad-secunderabad-0-to-1-years-220920001810 - ","Job Position":"Oracle Apps DBA\n","Summary":"NTT Data Recruitment in Hyderabad and Chennai For Oracle Apps DBA Position. BE, BTech, MTech, MCA Graduates 2017, 2018, 2019 are eligible to apply for this job. More details regarding NTT Data Hyderabad and Chennai Job Openings is given below.","postTitle":"NTT Data Recruitment | Oracle Apps DBA | 2017, 2018, 2019 Batch | Hyderabad, Chennai"},{"Job Location":"Bangalore\n","Company Name":"Refinitiv\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/refinitiv.wd3.myworkdayjobs.com\/careers\/job\/IND-BLR-Divyasree-Technopolis\/Software-Engineer_R0020174-1 - ","Navigation":"refinitiv-recruitment-software-engineer-bangalore","Job Position":"Software Engineer\n","Eligibility Criteria":"Strong programming skills in C\/C++.\nKnowledge on multi-threading.\nAbility to multi-task and engage productively on multiple projects simultaneously.\nBasic knowledge on shell scripting.\nKnowledge on Linux OS internals will be an added advantage.\n","Summary":"Refinitiv Recruitment in Bangalore For Software Engineer Position. BE, BTech Graduates are eligible to apply for this job. More details regarding Refinitiv Bangalore Job Openings is given below.","postTitle":"Refinitiv Recruitment | Software Engineer | Bangalore","Job Category":"IT | Software\n","About Refinitiv":"Serving more than 40,000 institutions in approximately 190 countries, Refinitiv provides information, insights and technology that drive innovation and performance in global financial markets.\nOur heritage of integrity enables our customers to make critical decisions with confidence while our best-in-class data and cutting-edge technologies enable greater opportunity.\nWe enable the financial community to trade smarter and faster, overcome regulatory challenges, and scale intelligently. Company Website: www.refinitiv.com\n","Date":"23-Sep-2020"},{"Job Location":"Hyderabad\n","Navigation":"amazon-recruitment-programmeranalyst-0-3-years-hyderabad","Job Category":"IT | Software\n","Job Description":"The Transportation Team is looking for a passionate software programmer analyst who will be responsible for working with business, operations to gather ship carrier requirements and collaborate with transportation technology teams to integrate new carriers and ship methods into the network.\nAs part of the integration, you have to design, develop and maintain transportation documents like shipping labels, carrier electronic manifest and invoices.\nYou should also be working alongside development on Amazon Corporate and Divisional Software projects, updating\/enhancing our current software, automation of manual configuration processes and documentation of our systems.\nYour solutions will impact our customers directly! This job requires you to constantly hit the ground running and your ability to learn quickly and work on disparate and overlapping tasks will define your success.\nThe ideal candidate must be detail oriented, have superior verbal and written communication skills, strong organizational skills, able to juggle multiple tasks at once, able to work independently and can maintain professionalism under pressure.\nYou must be able to identify problems before they happen and implement solutions that detect and prevent outages.\nYou must be able to accurately prioritize projects, make sound judgments, work to improve the customer experience, and get the right things done.\n","Date":"24-Sep-2020","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/1241393\/programmer-analyst-i - ","Job Position":"Programmer\/Analyst\n","Basic Qualifications":"0-3 years overall development\/technical support experience.\nStrong object oriented development knowledge in C++ and\/or Java.\nKnowledge of the UNIX\/Linux operating system.\nProven ability to troubleshoot and identify the root cause of issues.\nDemonstrates skill and passion for operational excellence.\nDocumentation skills.\n","Summary":"Amazon Recruitment in Hyderabad For Programmer\/Analyst Position. BE, BTech, ME, MTech, MCA Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Programmer\/Analyst (0-3 years) | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"sap-recruitment-associate-devops-engineer-0-2-years-bangalore","Eligibility Criteria":"Experience in SAP Basis administration and SAP NetWeaver.\nHands-on experience with SAP HANA or similar Database technologies.\nExperience in UNIX\/Linux (SUSE\/RHEL).\nGood analytical and troubleshooting skills.\nGood interpersonal, presentation and communication skills in English.\nUnderstanding of SaaS and Cloud offerings or products, and related processes is an advantage.\nUnderstanding of Google Cloud or Azure related operations is an advantage.\nUnderstanding of Virtualization and other Infrastructure areas like Storage and Network is an advantage.\nExposure to ITIL\/ITSM processes.\n","Job Category":"IT | Software\n","Job Description":"","Date":"24-Sep-2020","SAP Cloud DevOps Engineer – SAP Basis\/SAP HANA\/SUSE Linux":"The Integrated Business Planning (IBP) Cloud Delivery department – as part of the Intelligent Enterprise Group organization – is responsible for the complete life cycle management (planning, production, and operations) of SAP’s IBP Cloud Software as a Service (SaaS) solutions.\nThe IBP Cloud Delivery and Operations department drives and executes all required activities based on an end-to-end approach and facilitates all functions from development engagement to cloud architecture, design, production, life cycle management and other services of our productive customer landscapes.\nWe are looking to fill the position of SAP Cloud DevOps Engineer in the IBP Cloud Delivery and Operations department in Bangalore.\nIn the role of DevOps Engineer you will be contributing to the success of SAP Cloud solutions which enables hundreds of our customers to run their business seamlessly.\nAs a member of this team you will be responsible for system and landscape operations, handling many challenging issues and projects in the newest SAP Cloud Technologies, like HANA, Fiori and NetWeaver\/ABAP across multiple SAP’s own datacenters and Hyperscalers like Azure, GCP & Ali Cloud.\nYou’ll also be collaborating closely with IBP Product Development, IBP Architecture, Cloud Architecture and Cloud Infrastructure teams, spread across various geographies.\n","Job Responsibilities":"Maintaining IBP Customer instances in SAP SaaS Cloud landscape.\nOwn and handle Operation tasks like Monitoring\/Alert handling, Incident Management, Change Management, System Installation, Provisioning, Life Cycle Management activities like Hotfixes\/Patches and Upgrades.\nAssist in the resolution of application-related problems.\nResearch and resolve database problems, ensuring database integrity, security, stability, and system availability.\nUpdate systems using Software Update Manager (SUM), SPAM\/SAINT tool.\nConfigure STMS, dump analysis, user and profile management.\nPerformance monitoring and tuning.\nSupport Continuity of Business.\nContribute to Root Cause Analysis.\nCoordination with other support functions and team to resolve the issues in a timely manner.\n","Company Name":"SAP\n","Experience":"0 to 2 years\n","Qualification":"BTech, MTech, MCA, MSc\n","How To Apply":"https:\/\/jobs.sap.com\/job\/Bangalore-Associate-DevOps-Engineer-Job-KA\/621449101\/ - ","Job Position":"Associate DevOps Engineer\n","Note":"Please Dont Apply if you have more than 2 years experience.\nWillingness to work in shifts: 24\/7 Coverage.\n","Summary":"SAP Recruitment in Bangalore For Associate DevOps Engineer Position. BTech, MTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding SAP Bangalore Job Openings is given below.","postTitle":"SAP Recruitment | Associate DevOps Engineer (0-2 years) | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"banyan-data-services-recruitment-junior-cloud-software-engineer-0-2-years-bangalore","Eligibility Criteria":"0-2 years of experience with 1 or more development languages such as Java, Python or Spark.\nFreshers can also apply\nCertification or any training’s completion of any one of the cloud environment like AWS, GCP, Azure and Oracle Cloud.\nCurious minds who are inclined to ask, Why?\nStrong problem-solvers who are comfortable in unfamiliar situations, and can view challenges through multiple perspectives.\nDriven to develop technical skills for oneself and team-mates.\nAbility to connect with clients and colleagues of different backgrounds and communication styles, through empathy and clear verbal, visual, and written communication.\nHands-on experience with cloud computing and\/or traditional enterprise data-Center technologies, i.e., network, compute, storage, and virtualization.\n1 years + of experience with private\/public\/hybrid cloud model design, implementation, orchestration, and support.\nPossess at least one cloud-related certification from AWS, Azure or equivalent.\nApplying advanced technical knowledge and skills in developing cloud software solutions or problem solving where complexity, innovation and technical expertise are required.\nStrong knowledge in the database fundamentals and the Dev-Ops processes (including CI\/CD).\nAbility to write high-quality, well-tested code and comfort with Object-Oriented or functional programming patterns.\nPast experience quickly learning new languages and frameworks.\nAbility to work with a high degree of autonomy and self-direction.\nExperience with software development agile\/iterative methodologies and SOA.\n","Job Category":"IT | Software\n","Date":"24-Sep-2020","Job Responsibilities":"A wide variety of engineering projects including data visualization, web services, data engineering, web-portals, SDKs, and integrations in numerous languages, frameworks, and clouds platforms.\nApply continuous delivery practices to deliver high-quality software and value as early as possible.\nWork in collaborative teams to build new experiences.\nParticipate in the entire cycle of software consulting and delivery from ideation to deployment.\nIntegrating multiple software products across cloud and hybrid environments.\nMigrating existing on-premises software applications to cloud leveraging a structured method and best practices.\nDeveloping processes and procedures for software applications migration to the cloud, as well as managed services in the cloud.\n","Company Name":"Banyan Data Services\n","Experience":"Freshers \/ 0 to 2 years\n","Qualification":"BE, BTech, MTech, MCA, MSc\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-junior-cloud-software-engineer-banyan-data-services-india-pvt-ltd-bengaluru-bangalore-0-to-2-years-120920002839 - ","Job Position":"Junior Cloud Software Engineer\n","Summary":"Banyan Data Services Recruitment For Freshers and Experienced As Junior Cloud Software Engineer. BE, BTech, MTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding Banyan Data Services Bangalore Job Openings is given below.","postTitle":"Banyan Data Services Recruitment | Junior Cloud Software Engineer (0-2 years) | Bangalore"},{"Job Location":"Chennai\n","Salary":"Rs. 1,00,000 – 2,00,000\/- per annum\n","Navigation":"adp-freshers-recruitment-payroll-process-trainee-2019-2020-batch-chennai","Eligibility Criteria":"Preferred Qualification: BCom, BBA, BA (Maths, English), MBA (HR).\nPercentage: 70%.\n","Job Category":"IT | Software\n","Job Description":"In this role (Payroll Process Trainee), it’s all about enabling our customers to be more effective employers.\nOur service teams make it happen by collaborating with our clients and other key internal stakeholders to ensure that we provide “Everyday Excellence” and improve our client’s experience. (P.S. Did you know that the majority of our customers are not only satisfied, but they’d recommend ADP to someone else?).\nAs a Payroll Process Trainee, you will assist in payroll processing by providing inputs and preparation of pay sheets for clients.\n","Date":"24-Sep-2020","No.of Openings":"10\n","Year of Passing":"2019, 2020 Passedouts.\n","Job Responsibilities":"What you’ll do:\n","Company Name":"ADP India Pvt Ltd\n","Experience":"Freshers\n","Qualification":"Any Graduate except Computer Stream Students.\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-freshers-for-payroll-processing-for-adp-india-adp-india-pvt-ltd-chennai-0-to-1-years-030920001754?src=jobsearchDesk&sid=1599166294436782_2 - ","Desired Skills":"Bonus points if you have these:\n","Job Position":"Payroll Process Trainee\n","Summary":"ADP Freshers Recruitment in Chennai For Payroll Process Trainee Position. Any Graduate Freshers 2019, 2020 are eligible to apply for this job. More details regarding ADP Chennai Freshers Job Openings 2020 is given below.","postTitle":"ADP Freshers Recruitment | Payroll Process Trainee | 2019, 2020 Batch | Chennai"},{"Job Location":"Hyderabad\n","Navigation":"legato-health-technologies-freshers-recruitment-claims-associate-hyderabad","Eligibility Criteria":"BE\/BTech Graduates are NOT Eligible.\n","Job Description":"Each associate will be responsible for processing applications submitted by members\/applicants.\nThe process will include enrollment of applications submitted by applicant into the system accurately within the TAT.\nReporting To: Team Leader.\n","Date":"24-Sep-2020","Job Responsibilities":"Meeting RE & Quality scores.\nComplete all IDP & compliance trainings.\nCompletion of cases in queue within specified time frame.\n","Company Name":"Legato Health Technologies\n","Measurable":"RE & Quality scores.\nComplete al the transaction assigned within time.\nPunctuality & attendance adherence.\nProcess improvement initiatives.\nAccreditation within timelines.\n","Experience":"Freshers\n","Qualification":"Any Graduate\n","How To Apply":"https:\/\/jobs.legatohealth.com\/jobs\/associate-fresher-claims-57036 - ","Desired Skills":"Good written Communication Skills.\nEye for detail & logical thinking.\nAbility to work accurately and efficiently at all times, including peak volume season.\nSensitivity to the confidential nature of the data and proprietary company information.\nFlexibility to work in shifts.\n","Job Position":"Claims Associate\n","Summary":"Legato Health Technologies Freshers Recruitment in Hyderabad For Claims Associate Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Legato Health Technologies Hyderabad Freshers Job Openings is given below.","postTitle":"Legato Health Technologies Freshers Recruitment | Claims Associate | Hyderabad"},{"Job Location":"Chennai\n","Navigation":"plintron-freshers-recruitment-trainee-2019-2020-batch-chennai","Eligibility Criteria":"Consistent 60% marks throughout (10th, 12th, UG \/ PG).\nGood communication skills.\nNo Current Arrears.\nMale Candidates are eligible.\n","Interview Process (Microsoft Teams)":"Level 1: Technical interview with Lead.\nLevel 2: Technical Interview with VP.\nLevel 3: HR Discussion.\n","Job Category":"IT | Software\n","Job Description":"Plintron hiring freshers (0-1 year) for multiple skill sets.\nReviewing software requirements and preparing test scenarios.\nExecuting tests on software usability.\nAnalyzing test results on database impacts, errors or bugs, and usability.\nInteracting with Team to understand product requirements.\nParticipating in design reviews and providing input on requirements, product design, and potential problems.\nPreparing reports on all aspects related to the software testing carried out and reporting to the respective teams.\n","Date":"23-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Company Name":"Plintron\n","Experience":"Freshers \/ 0 to 1 year\n","Qualification":"BE (CSE, IT, ECE, EEE), MCA, MSc (CS, IT)\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-plintron-hiring-b-e-cse-it-ece-eee-msc-mca-freshers-plintron-chennai-0-to-1-years-220920002021?src=jobsearchDesk&sid=16008076742306146_2 - ","CTC":"Rs. 20,000\/- Gross\n","Job Position":"Trainee (For 1 year)\n","Note":"Candidates must be willing to sign a 3 years of agreement with us, which is non breakable.\n","Summary":"Plintron Freshers Recruitment in Chennai For Trainee Position. BE, MCA, MSc Freshers 2019, 2020 are eligible to apply for this job. More details regarding Plintron Chennai Freshers Job Openings 2020 is given below.","postTitle":"Plintron Freshers Recruitment | Trainee | 2019, 2020 Batch | Chennai"}]}