{"jobs":[{"Job Location":"Bangalore\n","Navigation":"siemens-recruitment-trainee-bcom-bangalore","About Siemens":"We’re Siemens. A collection of over 377,000 minds building the future, one day at a time in over 200 countries. We’re dedicated to equality and we welcome applications that reflect the diversity of the communities we work in.\nAll employment decisions at Siemens are based on qualifications, merit and business need. Bring your curiosity and creativity and help us craft tomorrow. Company Website: www.siemens.com.\n","Eligibility Criteria":"You are BCom graduate with sound knowledge of accountancy quality methodology.\nYou have an excellent communication skill and flexible with shifts.\n","Job Summary":"We provide a variety of competitive, innovative and reliable Record-to-Report services from maintaining financial records to financial closing and reporting.\nWe process, compile and deliver relevant financial information covering Accounting & Closing, Commercial, Tax and Master Data Services.\nWe deliver maximum value to the business by driving Record-to-Report optimization and digitalization using our entrepreneurial approach.\nWe also support our customers’ current and future business requirements with the help of our high level of process and automation competency.\n","Job Category":"Finance\n","Job Description":"You will perform daily Customer\/Vendor Creations and Modifications for 3rd party and Intra Companies requests, Processing of emergency requests.\nYou will ensure proper Accounting and Controls are performed for processing activity.\nYou will be contacting requestors for Discrepancy resolution and providing assistance to the team as needed.\n","Date":"17-Sep-2020","Company Name":"Siemens\n","Qualification":"BCom\n","How To Apply":"https:\/\/jobs.siemens.com\/jobs\/217276 - ","Job Position":"Trainee\n","Note":"This role is in Bangalore where you’ll get the chance to work with teams impacting entire cities, countries – and the craft of things to come.\n","Summary":"Siemens Recruitment in Bangalore For Trainee Position. BCom Graduates are eligible to apply for this job. More details regarding Siemens Bangalore Job Openings is given below.","postTitle":"Siemens Recruitment | Trainee | BCom | Bangalore"},{"Job Location":"Hyderabad\n","Navigation":"hgs-freshers-recruitment-voice-non-voice-process-hyderabad","Eligibility Criteria":"Graduation is mandatory.\nDegree Grads Can Apply.\nOnly Freshers without any backlog.\nBE and BTech graduates are not eligible.\nShifts: Willing to work in Night shifts.\n","Job Category":"BPO\n","Job Description":"HGS is hiring for US Healthcare Voice and Non Voice Process.\nWorking Days: 5 Days.\nWeek Off: 2 days fixed off.\nCab: 2 Way cab facility is provided.\n","Date":"17-Sep-2020","No.of Openings":"150\n","Year of Passing":"2018, 2019 Batch\n","Company Name":"HGS (Hinduja Global Solutions)\n","Experience":"Freshers\n","Qualification":"Any Graduation (BSc, BCA, BCom, BA, BBA, BMS…)\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-international-voice-and-non-voice-opening-hinduja-global-solutions-limited-hyderabad-secunderabad-0-to-0-years-100920001171?src=jobsearchDesk&sid=15997714840693633_6 - ","Desired Skills":"Good Communication.\nGood Analytical Skills.\nBasic computer knowledge.\n","Job Position":"Voice and Non Voice Process\n","Interview Process":"All rounds will be conducted digitally.\n","Summary":"HGS (Hinduja Global Solutions) Freshers Recruitment in Hyderabad For Voice and Non Voice Process. Any Graduate Freshers are eligible to apply for this job. More details regarding HGS Hyderabad Freshers Job Openings is given below.","postTitle":"HGS Freshers Recruitment | Voice, Non Voice Process | Hyderabad","Job Designation":"Trainee Process Consultant\n"},{"Job Location":"Bangalore\n","Navigation":"hp-freshers-recruitment-2020-java-software-developer-bangalore","Eligibility Criteria":"Bachelor’s or Master’s degree in Computer Science or equivalent.\n0-1 Year experience, must have passed out in 2020 only.\n","Required Skills":"Strong understanding of Object-Oriented Programming and Design.\nSoftware development experience with Java or C, C++ or related language.\nSoftware development experience (i.e. internship, co-op, or other work or academic project experience).\n","Job Category":"IT | Software\n","Job Description":"Must have knowledge of Java, good to have experience with UNIX, Linux Windows.\nKnowledge of Agile lifecycle process including Scrum, Continuous Integration, and Test-Driven Development Methodologies.\nDevelop, review, analyze, and modify programming systems, including encoding, testing, debugging and installing for a large-scale system\nUpdate release notes by documenting new features, fixes, and notable setup or configuration.\nMonitor builds and collaborating with DevOps and test team members to resolve build issues.\nTroubleshooting deployment issues in conjunction with DevOps and test team members.\n","Date":"17-Sep-2020","Year of Passing":"2020 Batch\n","Company Name":"HP\n","Experience":"Freshers \/ 0 to 1 year\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/jobs.hp.com\/en-us\/showjob\/jobid\/4060\/javasoftwaredeveloper - ","Job Position":"Java Software Developer\n","Summary":"HP Freshers Recruitment 2020 in Bangalore As Java Software Developer. BE, BTech, ME, MTech, MCA Freshers 2020 are eligible to apply for this job. More details regarding HP Bangalore Freshers Job Openings 2020 is given below.","postTitle":"HP Freshers Recruitment 2020 | Java Software Developer | Bangalore"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,50,000 – 4,50,000\/- per annum\n","Navigation":"schindler-freshers-recruitment-2020-sales-engineer-be-btech-bangalore","Eligibility Criteria":"Must be pass out of 2020 academics.\nCandidates based out off Bangalore only can apply.\n100% field work profile, Must be willing to travel across Bangalore and should be aware of Bangalore geography.\n","Job Description":"Identifying sales opportunities by constantly scanning the environment (field work), pursuing the identified opportunities and calling on the potential customers.\nCompleting all the documentation associated with the order, i.e. order tender, technical clarifications and data, legal documents, etc. and submitting them to the customer within the given time frame.\nMeeting volume and profit targets and operating within the agreed cost and profit margin framework.\nSupervising the work of the sub contractors and other external agencies like suppliers, labour contractors etc.\nCompletion and handing over to the customer.\nCoordinating with the Installation Team and the Logistics team to ensure smooth and timely delivery of the product.\nSupervising the work of the sub contractors and other external agencies like suppliers, labor contractors etc.\nResponsible for receivables\nHandles customer within a defined territory\/geographic location.\nIs the one – stop – window for the customer, Leading the project to its successful\/completion.\n","Date":"17-Sep-2020","Year of Passing":"2020 Batch\n","Company Name":"Schindler India Pvt Ltd\n","Experience":"Freshers\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-sales-engineer-fresher-be-b-tech-2020-passed-out-schindler-india-pvt-ltd-bengaluru-bangalore-0-to-0-years-160920000799?src=jobsearchDesk&sid=16002854691517235_20 - ","Job Position":"Sales Engineer\n","Summary":"Schindler India Freshers Recruitment in Bangalore For Sales Engineer Position. BE, BTech Freshers 2020 are eligible to apply for this job. More details regarding Schindler Bnagalore Freshers Job Openings 2020 is given below.","postTitle":"Schindler Freshers Recruitment 2020 | Sales Engineer | BE, BTech | Bangalore"},{"Job Location":"Bangalore\n","Job Requirements":"Good understanding of Security, LAN\/WAN topologies and technologies.\nIn-depth knowledge of OSI Model, TCP\/IP, Network Security basics.\nAbility to work on in a high-level stress and interrupt driven environment\nGood understanding of L2-L7 networking protocols, major Operating Systems such as UNIX \/ Linux\nDemonstrated ability to use in-depth troubleshooting to resolve or workaround customer issues using troubleshooting tools i.e. Wire Shark, Netmon etc.\nRouting and Switching knowledge will be added advantage.\nWilling to work in 24×7 environment in night shifts.\n","Navigation":"sonicwall-freshers-recruitment-graduate-trainee-engineer-intern-bangalore","Eligibility Criteria":"Bachelor’s degree in Computer Science\/Information Sciences\/ Electronic & Communications Engineering\n0 – 1 years networking and network security support experience with solid understanding of LAN\/WAN topologies and technologies.\nIn-depth knowledge of the network protocols: TCP\/IP.\nRouting Protocols like OSPF, RIP, BGP, Firewall, IDS\/IPS will be added advantage.\n","Job Category":"IT | Software\n","Job Description":"SonicWall is looking for Graduates who are comfortable to work in fixed night shifts.\n","Date":"23-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Job Responsibilities":"Responsible for providing technical support across SonicWall product lines via Phone\/Web & Emails in 24x7x365 days environment.\nAssist customers with deployment of SonicWall network security products like Firewall\/IPS and VPN solutions.\nProvide technical solutions and workarounds for end users with their issues on respective product line.\nOwns customer issues from beginning to resolution (handles in place)\nAssists customers by diagnosing problems and providing resolutions for technical and service issues.\nUse troubleshooting techniques and tools to identify products that are defective and follows guidelines in issuing service calls\/contacts.\nAdvises\/educates customers within procedural guidelines to ensure a complete solution to their technical or service questions.\nRecreates, identifies and provides input on unique or recurring customer problems.\nFocuses on delivering a positive customer experience according to SonicWall standards.\nMonitors and tracks issues to ensure accurate resolution.\nCandidate should work closely with the Engineering and other cross functional teams to replicate the issues reported by the customers, validate the bug fixes provided through various patch releases and resolve the customer issues in a professional manner.\nProvide consistent feedback to the team on products supported.\nRemains knowledgeable of SonicWall product line and related industry products and technologies.\n","Company Name":"SonicWall\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"BE\/BTech (CS\/ECE\/IT\/IS)\n","How To Apply":"https:\/\/boards.greenhouse.io\/sonicwall\/jobs\/2347856 - ","Job Position":"Graduate Trainee Engineer (Intern)\n","Summary":"SonicWall Freshers Recruitment in Bangalore As Graduate Trainee Engineer Intern. BE, BTech Freshers 2019, 2020 are eligible to apply for this job. More details regarding SonicWall Bangalore Freshers Job Openings 2020 is given below.","postTitle":"SonicWall Freshers Recruitment | Graduate Trainee Engineer Intern | Bangalore"},{"Job Location":"Hyderabad\n","Navigation":"insideview-technologies-recruitment-trainee-be-btech-me-mtech-hyderabad","Eligibility Criteria":"Bachelor’s\/Master’s Degree in Computer Science (or any related technical discipline).\nGood academic scores and\/or experience in technically significant projects.\n0-1 years Test\/Development experience will be preferred either as a Full-time\/Freelancing\/Internship.\nKnowledge and understanding of OOPS, web technologies and programming concepts.\nCoding skills in at least one of the following languages: Java, C#, C\/C++, Javascript\/HTML-CSS.\nStrong understanding of data structures, algorithms and a basic understanding of database concepts.\nKnowledge of Selenium, Backbone, Angular, React, Bootstrap, JQuery, etc.\nExposure to source code management tools.\nExperience in Agile Development Process.\n","Job Category":"IT | Software\n","Job Description":"InsideView is seeking a talented and passionate engineer to join our Hyderabad based product development team.\nContractual job for 6 months, conversion to full time employee depends upon company performance and business requirement.\nYou are excited about building scalable web applications.\nYou want to work with a talented, high energy and creative team focused on building a world-class product.\nYou thrive when solving problems and applying your experience to tackle new challenges.\n","About You":"In view of the current remote work environment, must be willing and be able to work from home with a reliable internet connection and a distraction-free environment.\nBeing able to communicate their thoughts and understand clearly what is being told.\nDetail-oriented analytical and problem-solving skills.\nSelf-organized and self-driven.\nQuick learner, passionate about learning new things and has strong opinions.\nResult-oriented and receptive to constructive feedback.\nMotivated and dedicated to building a superior product.\nExcellent Team player and comfortable using collaborative tools via instant message application and video\/audio call.\n","Job Type":"Remote\/Work from home\n","Date":"17-Sep-2020","Job Responsibilities":"Demonstrate an understanding of the product and the technologies used.\nAnalyze requirements, understand the design, demonstrate accountability to drive feature to completion.\nFollow best practices to develop, test and deliver high-quality code.\nBe responsible for delivering and maintaining high-quality product.\nCollaborate with the team to deliver on sprint cycle commitments.\nRaise risks when necessary.\n","Company Name":"InsideView Technologies\n","Experience":"0 to 1 year\n","Qualification":"BE, BTech, ME, MTech\n","How To Apply":"https:\/\/boards.greenhouse.io\/insideviewin\/jobs\/4155663003 - ","Job Position":"Trainee (Data)\n","Summary":"InsideView Technologies Recruitment in Hyderabad For Trainee Position. BE, BTech, ME, MTech Graduates are eligible to apply for this job. More details regarding InsideView Technologies Hyderabad Job Openings is given below.","postTitle":"InsideView Technologies Recruitment | Trainee | BE, BTech, ME, MTech | Hyderabad"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000\/- per annum\n","Navigation":"soft-suave-technologies-recruitment-full-stack-developer-0-2-years-bangalore","No..of Openings":"25\n","Job Category":"IT | Software\n","Job Description":"Execute full software development life cycle (SDLC)\nCode, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology.\nDevelop flowcharts, layouts and documentation to identify requirements and solutions\nMaintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes.\nWrite quality and clean code using prescribed specifications.\nEvaluate the interrelationships between programs.\nAnalyze performance of programs and take action to correct deficiencies .\nConfer with users to gain understanding of needed changes or modifications of existing programs.\nResolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls.\n","Date":"17-Sep-2020","Year of Passing":"2018, 2019, 2020 Batch\n","Company Name":"Soft Suave Technologies\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-bangalore-full-stack-developer-0-2-yrs-java-python-node-js-c-soft-suave-technologies-private-limited-bengaluru-bangalore-0-to-2-years-040920004317 - ","Desired Skills":"Good knowledge in Java, Pyton, Node JS, C++.\nStrong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL.\nLogical and analytical thinking towards the Java programming.\nSound knowledge of modern software architecture and development techniques.\nShould be a self initiator and interested in learning new technologies.\nShould have designed at least one project module using object oriented analysis and design techniques.\n","Job Position":"Full Stack Developer (Trainee Software Engineer – Java, Python, Node JS, C++ )\n","Interview Process":"Level 1: Technical Aptitude Test.\nLevel 2: written Programming Test\nLevel 3: System Execution of Program.\nLevel 4: HR Interview.\n","Note":"Those who have taken up the interview in last 3 months are not eligible to undergo interview again.\n","Summary":"Soft Suave Technologies Recruitment in Bangalore As Full Stack Developer. BE, BTech, ME, MTech, MCA Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Soft Suave Technologies Bangalore Job Openings is given below.","postTitle":"Soft Suave Technologies Recruitment | Full Stack Developer (0-2 years) | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,11,473\/- per annum (CTC)\n","Navigation":"virtusa-recruitment-analyst-2018-2019-2020-batch-hyderabad","Eligibility Criteria":"Should sign service agreement of 14 months.\nShould be Open to work in rotational shifts.\nBatch of 2020, if you have cleared final Semester and have mark sheets, then please apply.\n","Job Description":"Review Ads, Search Contents.\nReview Contents given by client – Comments \/ edit.\nReview search contents and classify them as per client guidelines.\n","Date":"22-Sep-2020","No.of Openings":"50\n","Year of Passing":"2018, 2019, 2020 Batch\n","Company Name":"Virtusa\n","Qualification":"BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Analyst-Ads-Curations-jobs-in-Hyderabad-Secunderabad-in-Virtusa-Consulting-Services-Pvt-Ltd-220920600018 - ","Industry Type":"IT-Software – Software Services\n","Desired Skills":"High proficiency in Verbal\/Written English.\nExpert knowledge of MS Excel (analyze and generate reports using Pivot Table, V & H look ups, apply formulaes like sum if, Index, match etc).\nGood working knowledge about Internet.\nAware about how Google search works, good searching skills through use of effective keywords.\nTech Savvy is definitely plus\nFamiliar in searching for goods \/ services \/ ads online.\n","Job Position":"Analyst – Ads Curations\n","Summary":"Virtusa Recruitment in Hyderabad For Analyst Position. BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Virtusa Hyderabad Job Openings is given below.","postTitle":"Virtusa Recruitment | Analyst | 2018, 2019, 2020 Batch | Hyderabad"},{"Job Location":"Hyderabad\n","Salary":"Rs. 3,40,000 – 4,00,000\/- per annum\n","About the team":"ROC (Relay Operations Center) is the central command and control center for Transportation Execution across the Amazon Supply Chain network supporting multiple geographies like NA and EU.\nIt ensures hassle free, timely pick-up and delivery of freight from vendors to Amazon fulfillment centers (FC) and from Amazon FCs to carrier hubs.\nIn case of any exceptions, ROC steps in to resolve the issue and keeps all the stakeholders informed on the proceedings.\nAlong with this tactical problem solving ROC is also charged with understanding trends in network exceptions and then automating processes or proposing process changes to streamline operations.\nThis second aspect involves network monitoring and significant analysis of network data.\nOverall, ROC plays a critical role in ensuring the smooth functioning of Amazon transportation and thereby has a direct impact on Amazons ability to serve its customers on time.\n","Navigation":"amazon-recruitment-roc-0-4-years-hyderabad","Job Category":"BPO\n","Job Description":"A Trans Ops Specialist at ROC facilitates flow of information between different stakeholders (Trans Carriers\/Hubs\/Warehouses) and resolves any potential issues that impacts customer experience and business continuity.\nTrans Ops Specialist at ROC works across two verticals Inbound and Outbound operations.\nInbound Operations deals with Vendor\/Carrier\/FC relationship, ensuring that the freight is picked-up on time and is delivered at FC as per the given appointment.\nTrans Ops Specialist on Inbound addresses any potential issues occurring during the lifecycle of pick-up to delivery.\nOutbound Operations deals with FC\/Carrier\/Carrier Hub relationship, ensuring that the truck leaves the FC in order to delivery customer orders as per promise.\nTrans Ops Specialist on Outbound addresses any potential issues occurring during the lifecycle of freight leaving the FC and reaching customer premises.\nA Trans Ops Specialist provides timely resolution to the issue in hand by researching and querying internal tools and by taking real-time decisions.\nAn ideal candidate should be able to understand the requirements\/be able to analyze data and notice trends and be able to drive Customer Experience without compromising on time.\nThe candidate should have the basic understanding of Logistics and should be able to communicate clearly in the written and oral form.\nTrans Ops Specialist should be able to ideate process improvements and should have the zeal to drive them to conclusion.\nShifts: Rotational (It is a 24\/7 shift environment and shifts are rotational).\nWeekly Off: Rotational two-days off.\nImmediate joiners only.\nMode of employment: Full Time Contract (5 to 6 months).\n","Date":"17-Sep-2020","Job Responsibilities":"This includes, but are not limited to:\n","Company Name":"Amazon\n","Experience":"Freshers \/ 0 to 4 years\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-for-roc-transportation-specialist-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-4-years-220620001104 - ","Job Position":"ROC (Transportation Specialist)\n","Note":"Candidates who have applied for the same role in last 6 months are not eligible to apply.\n","Basic Qualifications":"Bachelor’s Degree and above.\n0-48 months of work experience.\nGood communication skills – Transportation Specialist will be facilitating flow of information between external parties\nProficiency in MS Excel (Pivot tables, V-lookups).\nAbility to handle and interpret large sets of data.\nDemonstrated ability to work in a team in a very dynamic environment.\n","Summary":"Amazon Recruitment For Freshers and Experienced in Hyderabad As ROC. Any Graduates, Post Graduaets are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | ROC (0-4 years) | Hyderabad","Preferred Qualifications":"Master’s degree in Operations or in a related field will be preferred.\nBachelor’s degree in Engineering, Supply chain, Computers or a related field with excellent academic record required.\n"},{"Job Location":"Bangalore\n","Navigation":"oracle-recruitment-applications-developer-0-2-years-bangalore","Eligibility Criteria":"BS degree or equivalent experience relevant to functional area.\n0-2 years of previous software engineering or related experience.\n","Job Category":"IT | Software\n","Job Description":"Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.\nAs a member of the software engineering division, you will develop software according to provided design specifications.\nAnalyze system specifications and existing business processes and information systems.\nBuild enhancements and resolve bugs.\nBuild and execute unit tests and unit test plans.\nWork involves some problem solving with assistance and guidance in understanding and applying company policies and processes.\nGaining competence in own area and acquiring a higher level understanding of role, processes and procedures.\n","Date":"23-Sep-2020","Company Name":"Oracle\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, BS\n","How To Apply":"https:\/\/oracle.taleo.net\/careersection\/2\/jobdetail.ftl?job=20000R8F&tz=GMT%2B05%3A30&tzname=Asia%2FKolkata - ","Job Position":"Applications Developer\n","Note":"Applicants are required to read, write, and speak the following languages: English.\n","Summary":"Oracle Recruitment in Bangalore For Applications Developer Position. BE, BTech, BS Graduates are eligible to apply for this job. More details regarding Oracle Bangalore Job Openings is given below.","postTitle":"Oracle Recruitment | Applications Developer (0-2 years) | Bangalore","Preferred Qualifications":"Software Development & DevOps.\n"},{"Job Location":"Hyderabad\n","Navigation":"vistex-freshers-recruitment-associate-software-engineer-be-btech-hyderabad","Eligibility Criteria":"Min 60% aggregate.\nGood Communication Skills.\nAdded advantage if trained in ABAP\/SD\/HANA.\n","Job Category":"IT | Software\n","Job Description":"Vistex is an SAP software solutions extensions partner serving businesses of all sizes worldwide across a spectrum of industries by managing their master data, contracts, pricing, rebates and incentive programs.\nOur solutions provide unprecedented visibility into the breadth and depth of go-to-market programs and enable businesses with insightful information that drive revenue, control costs and increase margins.\nOur deep industry expertise coupled with in-house implementation, delivery and training services makes Vistex a full solutions resource and consultancy.\nVistex is seeking for dynamic, enthusiastic team members to contribute to the long term success of the Organization.\n","Date":"17-Sep-2020","Year of Passing":"2019, 2020 Passouts\n","Job Responsibilities":"Development of Object (ABAP application).\nUnit Testing by Developer.\nReleasing the object to test environment.\n","Company Name":"Vistex\n","Experience":"Freshers\n","Qualification":"BE\/BTech (CSE, IT, ECE)\n","How To Apply":"https:\/\/international-vistex.icims.com\/jobs\/1509\/associate-software-engineer\/job - ","Job Position":"Associate Software Engineer\n","Summary":"Vistex Freshers Job Openings in Hyderabad As Associate Software Engineer. BE, BTech Freshers 2019, 2020 are eligible to apply for this job. More details regarding Vistex Hyderabad Freshers Recruitment 2020 is given below.","postTitle":"Vistex Freshers Recruitment | Associate Software Engineer | BE, BTech | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"amazon-recruitment-software-development-engineer-intern-bangalore","Job Category":"IT | Software\n","Job Description":"Amazon is looking for a passionate, hard-working, and talented Software Development Engineer who can build innovative & mission critical system software applications & tools.\nYou will have an enormous opportunity to make a large impact on the design, architecture, and development of consumer products.\nYou will be responsible for delivery and support of large-scale, multi-tiered, distributed software applications and tools.\n","Date":"17-Sep-2020","Job Responsibilities":"Ability to design and code right solutions starting with broadly defined problems.\nDrive best practices and engineering excellence.\nWork in an agile environment to deliver high quality software.\nWork with other team members to develop the architecture and design of new and current systems.\n","Company Name":"Amazon\n","Qualification":"BE, BTech, ME, MTech, MCA, MSc (Computers)\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/1162643\/software-development-engineer-intern - ","Job Position":"Software Development Engineer Intern\n","Basic Qualifications":"A Bachelor’s\/ Master’s degree in Computer Science or equivalent combination of technical education and work experience.\nProgramming experience with at least one modern language such as Java, C++, or C# including object-oriented design.\nStrong, object-oriented design and coding skills (C\/C++ and\/or Java preferably on a UNIX or Linux platform).\nGood software development background including design patterns, data structures, test driven development.\nExperience with mobile technologies (native\/hybrid) a plus.\nExperience with distributed systems, algorithms and relational databases.\nSoftware development experience in building highly scalable applications.\nExcellent verbal and written communication skills.\n","Summary":"Amazon Recruitment in Bangalore As Software Development Engineer Intern. BE, BTech, ME, MTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding Amazon Bangalore Job Openings is given below.","postTitle":"Amazon Recruitment | Software Development Engineer Intern | Bangalore","Preferred Qualifications":"Bachelor’s\/ Master’s degree in Computer Science, Computer Engineering or related technical discipline.\nExperience in Mobile App development.\nAbility to handle multiple competing priorities in a fast-paced environment.\nExperience working with service oriented architectures and web based solutions.\n"},{"Job Location":"Hyderabad\n","Navigation":"amazon-recruitment-customer-service-associate-hyderabad","Job Category":"BPO\n","Job Description":"An Amazon Customer Service Associate is a critical part of our mission to deliver timely, accurate and professional customer service to all Amazon customers.\nThis vital position requires an action-oriented, flexible problem-solver who will assist customers in expediting orders and correcting post-sales problems.\nAssociates communicate with customers primarily through mail, chat and phone and utilize a variety of software tools to navigate customer accounts, research and review policies and communicate effective solutions in a fun and fast-paced environment.\n","Customer Focus":"Excellent customer service skills, including maintaining focus on the customer issue in a fast-paced environment.\nAbility to empathize with and prioritize customer needs.\nDemonstrates interpersonal skills with a diverse customer base.\nDemonstrates conflict resolution, negotiation, and de-escalation skills.\nDemonstrates ownership to resolve challenging customer issues, escalating when necessary.\nAbility to determine customer needs and provide appropriate solutions.\nMaintain regular and reliable attendance, including the daily schedule as assigned.\nFlexible with the working schedule; may be expected to work weekends, holidays and events.\nAbility to work overtime as required by business – as much as 60 hours a week, most often occurring in the weeks surrounding the Christmas holiday season.\n","Date":"17-Sep-2020","Company Name":"Amazon\n","Communication Skills":"Excellent communication skills (written and verbal).\nAbility to communicate correctly and clearly with all customers.\nExcellent documentation skills.\nGood comprehension skills – ability to clearly understand and state the issues customers present.\nAbility to concentrate – follow customers issues without distraction to resolution.\nGood composition skills – ability to compose a grammatically correct, concise, and accurate written response.\nWork successfully in a team environment as well as independently.\n","Qualification":"10+2, Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/SF200040669\/customer-service-associate-hyderabad-india - ","Job Position":"Customer Service Associate\n","Summary":"Amazon Recruitment in Hyderabad For Customer Service Associate Position. Any Under Graduate, Graduate, Post Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Customer Service Associate | Hyderabad","Problem Solving Skills":"Effective problem solving skills including decision making, time management and immediate prioritization of tasks as assigned.\nAbility to approach problems logically and rationally.\nAction oriented and self-disciplined.\nOrganized and detail-oriented.\nAbility to quickly and effectively prioritize work time in various departments to meet business need.\nAbility to maintain composure in highly escalated situations.\nQualified candidates will be comfortable in a multi-tasking, high-energy environment.\nThey will be creative and analytical problem solvers with a passion for excellent customer service.\n","Computer Knowledge\/Skills":"Ability to use a desktop computer system.\nFamiliarity with Windows XP, Microsoft Outlook, Microsoft Word and Internet Explorer.\nExcellent typing skills.\nDemonstrates understanding of the Internet, Amazon.com website, and competitor websites.\nDemonstrates an ability to successfully navigate websites.\nDemonstrates a proficient knowledge of email applications.\nDemonstrates an ability to learn in various media.\nAbility to successfully adapt to changes in the work environment.\n"},{"Job Location":"Across India\n","Navigation":"delhivery-freshers-recruitment-2020-scm-operations-btech-mba-across-india","About Delhivery":"Since its inception in 2011, Delhivery has become India’s leading supply chain services company. Our vision is to become the operating system for commerce in India, through a combination of world-class infrastructure, logistics operations of the highest quality and cutting-edge engineering and technology capabilities.\nOur team has successfully fulfilled over 600 million orders to more than 120 million households across India. 24 automated sort centers, 75 fulfilment centers, 70 hubs, 2500+ direct delivery centers, 8000+ partner centers, 14000+ vehicles and 40000+ team members make it possible to deliver a million packages a day, 24 hours a day, 7 days a week, 365 days a year. We are Delhivery.\nDelhivery provides products and services with the aim of building trust and improving the lives of consumers, small businesses, enterprises and our growing team of employees and partners. We are disrupting India’s logistics industry through our proprietary network design, infrastructure, partnerships, and engineering and technology capabilities. Delhivery brings unparalleled cost efficiency and pan-India reach to the businesses of over 10000 customers. It is driven by its mission to shrink time and distance, making the world a smaller place for its customers and over a billion consumers they serve. Company Website: .\n","Job Description":"We are in Process of Hiring Fresh 2020 batch of BTech and MBA students across the country for entry level requirements under SCM Operations Team.\nAnyone who is interested in building a career in the logistics industry can apply.\nWe would only be considering freshers for these roles (2020 Batch)\nWork Locations: Hyderabad, Bengaluru, Chennai, Mumbai, Pune, Delhi NCR, Kolkata.\n","Date":"17-Sep-2020","Year of Passing":"2020 Batch\n","Company Name":"Delhivery\n","Experience":"Freshers\n","Qualification":"BTech, MBA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-we-are-hiring-btech-mba-freshers-scm-operations-team-delhivery-private-limited-chennai-pune-delhi-ncr-mumbai-bengaluru-bangalore-hyderabad-secunderabad-kolkata-0-to-0-years-160920005803?src=jobsearchDesk&sid=16002854691517235_2 - ","Job Position":"SCM Operations (Supply Chain Management)\n","Summary":"Delhivery Freshers Recruitment 2020 Across India For SCM Operations. BTech, MBA Freshers 2020 are eligible to apply for this job. More details regarding Delhivery Frehsers Job Openings is given below.","postTitle":"Delhivery Freshers Recruitment 2020 | SCM Operations | BTech, MBA | Across India"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000\/- per annum\n","Contact Person":"HR\nCompany Website:\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"soft-suave-technologies-walkin-full-stack-developer-0-2-years-26th-to-27th-september-2020-bangalore","Walkin Time":"9\n","Job Category":"IT | Software\n","Job Description":"Execute full software development life cycle (SDLC)\nCode, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology.\nDevelop flowcharts, layouts and documentation to identify requirements and solutions\nMaintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes.\nWrite quality and clean code using prescribed specifications.\nEvaluate the interrelationships between programs.\nAnalyze performance of programs and take action to correct deficiencies .\nConfer with users to gain understanding of needed changes or modifications of existing programs.\nResolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"10\n","Year of Passing":"2018, 2019, 2020 batch\n","Walkin Date":"26th, 27th September 2020\n","Company Name":"Soft Suave Technologies\n","Walkin Venue":"Soft Suave Technologies Pvt Ltd, Gayatri Tech Park (4th floor), Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru – 560066.\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-walk-in-bangalore-soft-suave-technologies-private-limited-bengaluru-bangalore-0-to-2-years-190920000575?src=jobsearchDesk&sid=1600548771756218_3 - ","Desired Skills":"Good knowledge in Java, Pyton, Node JS, C++.\nStrong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL.\nLogical and analytical thinking towards the Java programming.\nShould have designed at least one project module using object oriented analysis and design techniques.\nSound knowledge of modern software architecture and development techniques.\nShould be a self initiator and interested in learning new technologies.\n","Job Position":"Full Stack Developer (Trainee Software Engineer – Java, Python, Node JS, C++)\n","Interview Process":"Level 1: Technical Aptitude Test.\nLevel 2: Written Programming Test.\nLevel 3: System Execution of Program.\nLevel 4: HR Interview.\n","Note":"Those who have taken up the interview in last 3 months are not eligible to undergo interview again.\n","Summary":"Soft Suave Technologies Walkin in Bangalore As Full Stack Developer On 26th, 27th September 2020. BE, BTech, ME, MTech, MCA Graduates 2018, 2019, 2020 are eligible for this walkin drive. More details regarding Soft Suave Technologies Bangalore Walkin Drive is given below.","postTitle":"Soft Suave Technologies Walkin | Full Stack Developer (0-2 years) | 26th to 27th September 2020 | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-data-associate-0-3-years-hyderabad","Job Summary":"About the team: The Alexa Data Services (ADS) organization provides data creation, curation, and analytics services to help develop, test, and train the Alexa AI. We work closely with Amazon Machine Learning (ML) Science and modeling teams, providing the critical data they need to improve Alexas speech recognition and language understanding capabilities.\n","Job Description":"We are hiring Data Associates (1 year contract) in our Hyderabad team to undertake labeling functions such as transcription, annotation and dialogue evaluation on speech & text data to assess and improve Alexas performance.\nAs a Data Associate, you will work on speech and text data.\nWe value your high attention to details and your ability to adapt to dynamic changes due to emerging business requirements.\nYou are recognized as a role model for your proactivity in identifying issues with efficiency and accuracy.\n","Date":"23-Sep-2020","Job Responsibilities":"Work with text, speech and other types of data and attach tags to the contents, at scale.\nDeliver high quality of labeled data, leveraging guidelines to meet specific key performance indicators, and using in-house tools and software.\nReport issues with tools and software to the development team when necessary.\nProvide feedback for improvements to existing tooling that can increase labeling throughput and quality.\nMaintain strict confidentiality and follow all applicable Amazon policies for securing confidential information.\nProficiency in English, Hindi grammar and spelling (both written and verbal).\nComfortable working with speech from various dialects and accents of Hindi.\nWillingness and flexibility to work in shifts including night shift etc.\n","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"High School, Diploma, Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-hindi-data-associate-hyderabad-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-3-years-230920001257 - ","Job Position":"Hindi Data Associate\n","Note":"Work Location: Hyderabad (Only candidates currently in Hyderabad are eligible).\nJob Type: Contractual role for 1 year.\n","Basic Qualifications":"High School or Equivalent diploma\nWork Experience: Maximum of 24 months of experience in any industry\nProficient computer skills in MS Office with good typing speed (> 40 wpm and >90% accuracy), including basic troubleshooting with the ability to utilize proprietary tools.\n","Summary":"Amazon Recruitment in Hyderabad For Data Associate Position. High School, Diploma, Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Data Associate (0-3 years) | Hyderabad"},{"Job Location":"Chennai\n","Navigation":"zoho-corporation-recruitment-technical-support-engineer-0-2-years-chennai","Eligibility Criteria":"Proficiency in English.\nAttention to detail and a strong desire to learn.\nAbility to work independently and deliver value to the customers and the company.\nShould be willing to work in night shifts.\nMust be interested in the accounting and finance side.\n","Job Category":"IT | Software\n","Job Description":"Answering customer queries through phone, e-mail & chat about product features and capabilities.\nHelping customers with basic troubleshooting, configuration difficulties and advanced technical issues in the product by working closely with the development team.\nPrompt communication of customer requirements to the development team.\nFacilitate with product demos, implementations and training.\n","Date":"23-Sep-2020","Year of Passing":"2018, 2019, 2020\n","Company Name":"Zoho Corporation\n","Experience":"0 t o 2 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/careers.zohorecruit.com\/recruit\/WebFormServeServlet?rid=162060bf19ef5bfd9c408621bb66328b6c49a8d3a80058b2d65120b6b5591867gidf62d65585721aed69c3d0236e3a70183 - ","Job Position":"Technical Support Engineer\n","Note":"If you have attended the written test \/ Interview with ZOHO anytime in the past 3 months, you should not attend this test.\nStudents who are graduating in 2021 are not eligible to apply this form.\n","Summary":"Zoho Corporation Recruitment in Chennai For Technical Support Engineer Position. Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Zoho Corporation Chennai Job Openings is given below.","postTitle":"Zoho Corporation Recruitment | Technical Support Engineer (0-2 years) | Chennai"},{"Job Location":"Chennai\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"changepond-technologies-freshers-walkin-software-trainee-24th-to-25th-september-2020-chennai","Eligibility Criteria":"Fresher’s only.\nGraduates with an aggregate of minimum 60% in Academics.\nMandate: Java\/.Net Certification from any Training Institute\nGood communication Skills.\n","Walkin Time":"9.30 AM to 12.30 PM\n","Job Category":"IT | Software\n","Job Description":"Changepond Technologies is Hiring Engineering graduates – Freshers For Trainee Position.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"20\n","Year of Passing":"2017, 2018, 2019\n","Walkin Date":"24tth, 25th September 2020\n","Company Name":"Changepond Technologies\n","Walkin Venue":"Changepond Technologies, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai – 603 103. Land Mark: Opposite to TCS 2nd Gate\nContact Person: Kalaiselvan R (HR)\nCompany Website: www.changepond.com\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-engineering-graduates-fresher-s-for-changepond-technologies-changepond-technologies-private-limited-chennai-0-to-1-years-210920002968?src=jobsearchDesk&sid=16007227599368720_2 - ","Job Position":"Software Trainee (.NET\/Java)\n","Summary":"Changepond Technologies Freshers Walkin Drive in Chennai For Software Trainee Position. BE, BTech, MCA Graduates 2017, 2018, 2019 are eligible for this walkin. More details regarding Changepond Technologies Chennai Freshers Walkin is given below.","postTitle":"Changepond Technologies Freshers Walkin | Software Trainee | 24th to 25th September 2020 | Chennai"},{"Navigation":"newage-software-freshers-recruitment-java-developer-0-1-year-chennai","Eligibility Criteria":"Freshers or 0-1 year experience candidate can apply.\nNo standing arrears.\n","Job Category":"IT | Software\n","Job Description":"NewAge Software looking for 2019-2020 passed out candidates who is willing to work as a Java\/J2EE Developer.\nShould have completed a Course in Java\/J2EE from any training institute.\nWork Location: Bangalore.\nThe Role: Responsible for the design, testing, quality, accuracy and maintenance of software programs and codes.\n","Date":"17-Sep-2020","Interview Location":"Chennai\n","Company Name":"NewAge Software and Solutions (India) Pvt Ltd\n","Experience":"Freshers \/ 0 to 1 year\n","Qualification":"BE, BTech, ME, MTech\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-immediate-opening-for-freshers-interns-java-j2ee-developer-new-age-software-and-solutions-india-pvt-ltd-chennai-0-to-1-years-110920000343?src=jobsearchDesk&sid=1599858498557132_2 - ","About NewAge Software and Solutions (India) Pvt Ltd":"Newage is a leading technology company whose software and solutions power the demanding needs of the global supply chain, freight forwarding and logistics industries. We are, in the regions we operate, the ubiquitous choice for this industry; from small & medium businesses to large enterprises.\nNewage mines its deep domain knowledge in logistics and freight forwarding to deliver seamless cloud-based ERP software through its flagship product eFrieghtSuite; to help solve complex business needs with the best functionality in the industry. In addition, Newage also offers outsourcing capabilities to support all the constituents of the freight forwarding and logistics industries through a range of services from documentation to sales to customer operations to finance & accounting to revenue management.\nTogether, our software and services support customers in over 30 countries including the US, EU, UK, MEA, Asia and India. We are headquartered in Dubai with key development centers in India at Bangalore and Chennai. Company Website: www.newage-global.com.\n","Desired Skills":"Good understanding on Java\/J2EE Concepts.\nSound knowledge of object-oriented techniques and design patterns.\nGood knowledge in Core Java, Spring, any ORM like Hibernate or Spring JPA.\nGood Knowledge in SQL queries, Web Services.\nPassion for learning new technologies other than what is used in day-to-day work.\nShould have good analytical skills, positive attitude and good communication skill.\n","Job Position":"Intern or Java\/J2EE Developer\n","Summary":"NewAge Software Freshers Recruitment in Chennai For Intern or Java Developer Positions. BE, BTech, ME, MTech Frehsers are eligible to apply for this job. More details regarding NewAge Software Chennai Freshers Job Openings is given below.","postTitle":"NewAge Software Freshers Recruitment | Java Developer (0-1 year) | Chennai"},{"Job Location":"Across India\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"thyrocare-technologies-freshers-recruitment-business-development-executive-across-india","Eligibility Criteria":"Freshers.\nGraduate\/Pursuing Graduation.\nGood written and verbal communication skill.\nShould know English and additional one Regional language.\nMust have system and internet connectivity at home.\n","Job Description":"Work Locations: Hyderabad, Bengaluru, Chennai, Delhi NCR, Mumbai, Bhubaneshwar, Ahmedabad, Kochi, Kolkata.\n","Benefits":"Work From Home opportunity.\nFull time payroll job.\nMonthly allowance for internet connectivity.\n","Date":"23-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"Procure network members viz; hospital, laboratory, polyclinics that associates with the company to ensure pan-India presence and service.\nEnhance B2B business for company.\nIdentify new sales opportunities within existing association by up-selling and cross-selling.\nImplementing the company strategy across all the territory.\n","Company Name":"Thyrocare Technologies\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-thyrocare-technologies-ltd-chennai-bhubaneshwar-delhi-ncr-mumbai-ahmedabad-bengaluru-bangalore-ernakulam-kochi-cochin-hyderabad-secunderabad-kolkata-0-to-1-years-220920001050?src=jobsearchDesk&sid=1600806475101972_6 - ","Job Position":"Business Development Executive\n","Summary":"Thyrocare Technologies Freshers Recruitment Across India For Business Development Executive Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Thyrocare Technologies Freshers Job Openings is given below.","postTitle":"Thyrocare Technologies Freshers Recruitment | Business Development Executive | Across India"}]}