{"jobs":[{"Job Location":"Hyderabad\n","Navigation":"focus-softnet-freshers-recruitment-technical-support-consultant-sql-hyderabad","Eligibility Criteria":"Should have Good Communication skills.\n","Job Category":"IT | Software\n","Job Description":"Focus Softnet is looking for SQL Trained candidates for CRM Technical Support.\n","About Focus Softnet":"Established in 1992, Focus Softnet rose from a regional IT company to a multinational business solutions provider and innovator. With its acclaimed products and services, strong emphasis on R&D and a richly experienced work force, Focus has expanded across 17 countries around the globe, operating from 27 offices.\nSince its inception, Focus has ensured that its products not only use state-of-the-art technology, but are also feature-rich and based on extensive research. This has earned Focus, partnerships and business associates from all around the world from major business organizations.\nAs an IT solutions provider with over 25 years of experience and multi-domain expertise, Focus Softnet’s consulting services and skill sets are backed by a vast knowledge-base and a keen understanding of what it takes to run and grow a business.\nFocus has come to be known for re-engineering business processes, optimizing resources, developing and deploying user-friendly, flexible and cost-efficient industry specific solutions. Company Website: www.focussoftnet.com.\n","Date":"19-Sep-2020","Company Name":"Focus Softnet\n","Experience":"Freshers\n","Qualification":"BE\/BTech (Computers)\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-technical-support-consultant-sql-for-crm-software-support-focus-softnet-pvt-ltd-hyderabad-secunderabad-0-to-0-years-180920004093 - ","Desired Skills":"SQL.\n","Job Position":"Technical Support Consultant (SQL)\n","Summary":"Focus Softnet Freshers Recruitment in Hyderabad For Technical Support Consultant (SQL) Position. BE, BTech Freshers are eligible to apply for this job. More details regarding Focus Softnet Hyderabad Freshers Job Openings is given below.","postTitle":"Focus Softnet Freshers Recruitment | Technical Support Consultant (SQL) | Hyderabad"},{"Job Location":"Bangalore\n","Job Requirements":"Good understanding of Security, LAN\/WAN topologies and technologies.\nIn-depth knowledge of OSI Model, TCP\/IP, Network Security basics.\nAbility to work on in a high-level stress and interrupt driven environment\nGood understanding of L2-L7 networking protocols, major Operating Systems such as UNIX \/ Linux\nDemonstrated ability to use in-depth troubleshooting to resolve or workaround customer issues using troubleshooting tools i.e. Wire Shark, Netmon etc.\nRouting and Switching knowledge will be added advantage.\nWilling to work in 24×7 environment in night shifts.\n","Navigation":"sonicwall-freshers-recruitment-graduate-trainee-engineer-intern-bangalore","Eligibility Criteria":"Bachelor’s degree in Computer Science\/Information Sciences\/ Electronic & Communications Engineering\n0 – 1 years networking and network security support experience with solid understanding of LAN\/WAN topologies and technologies.\nIn-depth knowledge of the network protocols: TCP\/IP.\nRouting Protocols like OSPF, RIP, BGP, Firewall, IDS\/IPS will be added advantage.\n","Job Category":"IT | Software\n","Job Description":"SonicWall is looking for Graduates who are comfortable to work in fixed night shifts.\n","Date":"23-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Job Responsibilities":"Responsible for providing technical support across SonicWall product lines via Phone\/Web & Emails in 24x7x365 days environment.\nAssist customers with deployment of SonicWall network security products like Firewall\/IPS and VPN solutions.\nProvide technical solutions and workarounds for end users with their issues on respective product line.\nOwns customer issues from beginning to resolution (handles in place)\nAssists customers by diagnosing problems and providing resolutions for technical and service issues.\nUse troubleshooting techniques and tools to identify products that are defective and follows guidelines in issuing service calls\/contacts.\nAdvises\/educates customers within procedural guidelines to ensure a complete solution to their technical or service questions.\nRecreates, identifies and provides input on unique or recurring customer problems.\nFocuses on delivering a positive customer experience according to SonicWall standards.\nMonitors and tracks issues to ensure accurate resolution.\nCandidate should work closely with the Engineering and other cross functional teams to replicate the issues reported by the customers, validate the bug fixes provided through various patch releases and resolve the customer issues in a professional manner.\nProvide consistent feedback to the team on products supported.\nRemains knowledgeable of SonicWall product line and related industry products and technologies.\n","Company Name":"SonicWall\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"BE\/BTech (CS\/ECE\/IT\/IS)\n","How To Apply":"https:\/\/boards.greenhouse.io\/sonicwall\/jobs\/2347856 - ","Job Position":"Graduate Trainee Engineer (Intern)\n","Summary":"SonicWall Freshers Recruitment in Bangalore As Graduate Trainee Engineer Intern. BE, BTech Freshers 2019, 2020 are eligible to apply for this job. More details regarding SonicWall Bangalore Freshers Job Openings 2020 is given below.","postTitle":"SonicWall Freshers Recruitment | Graduate Trainee Engineer Intern | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,11,473\/- per annum (CTC)\n","Navigation":"virtusa-recruitment-analyst-2018-2019-2020-batch-hyderabad","Eligibility Criteria":"Should sign service agreement of 14 months.\nShould be Open to work in rotational shifts.\nBatch of 2020, if you have cleared final Semester and have mark sheets, then please apply.\n","Job Description":"Review Ads, Search Contents.\nReview Contents given by client – Comments \/ edit.\nReview search contents and classify them as per client guidelines.\n","Date":"22-Sep-2020","No.of Openings":"50\n","Year of Passing":"2018, 2019, 2020 Batch\n","Company Name":"Virtusa\n","Qualification":"BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Analyst-Ads-Curations-jobs-in-Hyderabad-Secunderabad-in-Virtusa-Consulting-Services-Pvt-Ltd-220920600018 - ","Industry Type":"IT-Software – Software Services\n","Desired Skills":"High proficiency in Verbal\/Written English.\nExpert knowledge of MS Excel (analyze and generate reports using Pivot Table, V & H look ups, apply formulaes like sum if, Index, match etc).\nGood working knowledge about Internet.\nAware about how Google search works, good searching skills through use of effective keywords.\nTech Savvy is definitely plus\nFamiliar in searching for goods \/ services \/ ads online.\n","Job Position":"Analyst – Ads Curations\n","Summary":"Virtusa Recruitment in Hyderabad For Analyst Position. BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Virtusa Hyderabad Job Openings is given below.","postTitle":"Virtusa Recruitment | Analyst | 2018, 2019, 2020 Batch | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"oracle-recruitment-applications-developer-0-2-years-bangalore","Eligibility Criteria":"BS degree or equivalent experience relevant to functional area.\n0-2 years of previous software engineering or related experience.\n","Job Category":"IT | Software\n","Job Description":"Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.\nAs a member of the software engineering division, you will develop software according to provided design specifications.\nAnalyze system specifications and existing business processes and information systems.\nBuild enhancements and resolve bugs.\nBuild and execute unit tests and unit test plans.\nWork involves some problem solving with assistance and guidance in understanding and applying company policies and processes.\nGaining competence in own area and acquiring a higher level understanding of role, processes and procedures.\n","Date":"23-Sep-2020","Company Name":"Oracle\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, BS\n","How To Apply":"https:\/\/oracle.taleo.net\/careersection\/2\/jobdetail.ftl?job=20000R8F&tz=GMT%2B05%3A30&tzname=Asia%2FKolkata - ","Job Position":"Applications Developer\n","Note":"Applicants are required to read, write, and speak the following languages: English.\n","Summary":"Oracle Recruitment in Bangalore For Applications Developer Position. BE, BTech, BS Graduates are eligible to apply for this job. More details regarding Oracle Bangalore Job Openings is given below.","postTitle":"Oracle Recruitment | Applications Developer (0-2 years) | Bangalore","Preferred Qualifications":"Software Development & DevOps.\n"},{"Job Location":"Bangalore\n","Navigation":"flexera-freshers-recruitment-2020-engineering-intern-bangalore","Eligibility Criteria":"BE\/BTech (Preferably in Computer Science or Information Technology), MCA.\nGraduating 2020 (2020 pass outs).\n","Job Category":"IT | Software\n","Job Description":"Respond to requests to investigate content related issues, identify root cause and remediate.\nConduct research, investigate and collect data on software and hardware products from various sources and curate the data into the Data Platform.\nRelate data points from 3rd party vendors and product suppliers, and ensure consistency, quality and accuracy in our normalized database.\n","Date":"19-Sep-2020","Year of Passing":"2020 Batch\n","Company Name":"Flexera\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/flexerasoftware.wd1.myworkdayjobs.com\/en-US\/FlexeraSoftware\/job\/Bangalore\/Intern---Engineering_11063 - ","Desired Skills":"Authoritative knowledge of at least one mainstream development language such as Java, Python, Go, MVC, or Javascript (from the level of university pass out).\nFamiliar with stored procedures in SQL Server (Should be clear with the normalization).\nGood knowledge on SDLC (Understanding of software development process, including requirements. .gathering, analysis and design, development tools and technologies, release and version control, and testing methodologies).\nAbility to convey ideas and concepts to another team member or within the team environment effectively\nAbility to adopt to new tools and technologies.\nStrong analytical, problem-solving skills and demonstrated interpersonal skills.\nExperience in the development of his academic projects.\nKnowledge on AWS, Web Services.\nAbility to gather, analyse, and interpret relevant requirements and information.\n","Job Position":"Intern – Engineering\n","Summary":"Flexera Freshers Recruitment 2020 in Bangalore For Engineering Intern Position. BE, BTech, MCA Freshers 2020 are eligible to apply for this job. More details regarding Flexera Bangalore Freshers Job Openings 2020 is given below.","postTitle":"Flexera Freshers Recruitment 2020 | Engineering Intern | Bangalore"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000 – 5,50,000\/- per annum\n","Navigation":"cronj-freshers-recruitment-software-developer-bangalore","Eligibility Criteria":"Bachelor’s Degree in Computer Science and IT can apply.\nMechnical\/Civil\/EEE are strictly not allowed.\nMust have 60% throughout academics.\nStrong knowledge of the following: C, C++, Java,SQL,OOPS.\nMust have excellent verbal and written communication skills.\n","Job Category":"IT | Software\n","Job Description":"CronJ Is hiring Freshers for Software Developer Role.\nWork Location: HSR, Bangalore.\n","Date":"19-Sep-2020","No.of Openings":"10\n","Company Name":"CronJ IT Technologies Pvt Ltd\n","Experience":"Freshers\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-software-developer-fresher-cronj-it-technologies-private-limited-bengaluru-bangalore-0-to-1-years-210820002432?src=jobsearchDesk&sid=15980424113158071_2 - ","Desired Skills":"Must have excellent troubleshooting, problem solving skills, both technically and at the application level.\nStrength in “attention to detail” and analytical skills to include OOP and SQL experience.\nInjects new industry trends, technology and best practices into the team.\nTakes initiative to enhance and document existing processes.\nStrength in verbal and written communication to our internal and external customers.\nAbility to establish priorities and manage multiple critical paths.\nSelf-motivated to diagnose and resolve escalated issues involving proprietary products.\nFacilitate technical issues resolution in a collaborative team approach involving development, product management and implementation as appropriate.\n","Job Position":"Software Developer\n","Note":"Shortlisted candidates will be informed through mail for next steps.\n","Summary":"CronJ Freshers Recruitment in Bangalore As Software Developer. BE, BTech Freshers are eligible to apply for this job. More details regarding CronJ Bangalore Freshers Job Openings is given below.","postTitle":"CronJ Freshers Recruitment | Software Developer | Bangalore"},{"Job Location":"Chennai\n","Salary":"Rs. 3,00,000\/- per annum\n","Navigation":"tnq-technologies-freshers-recruitment-java-developer-chennai","Eligibility Criteria":"Should be good at logical thinking.\nCertification in Java is an added advantage.\n","Job Category":"IT | Software\n","Job Description":"Requirement analysis, Design, Development, Implementation, Maintenance for enterprise business applications.\nInvolve in software and architectural development activities.\nConduct software analysis, programming, testing and debugging.\n","Date":"19-Sep-2020","No.of Openings":"5\n","Company Name":"TNQ Technologies Pvt Ltd\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-java-fresher-tnq-technologies-pvt-ltd-chennai-0-to-0-years-030620003463?src=jobsearchDesk&sid=15912187828445923&xp=1&px=1 - ","About TNQ Technologies Pvt Ltd":"TNQ is a publishing technology and services company based in Chennai, India. Founded in 1998, TNQ today serves some of the world leaders in STM publishing – like Elsevier, Wolters Kluwer, Royal Society of Chemistry – across time zones from Australia to North America, specialising in Roman script composition and XML-first production processes.\nIn October 2018, the Software Development Division at TNQ Technologies was reappraised at Level 3 of the CMMI Institute’s Capability Maturity Model Integration. Company Website: www.tnq.co.in.\n","Desired Skills":"Java.\nCore Java.\nJ2EE.\n","Job Position":"Java Developer (Java Fresher)\n","Summary":"TNQ Technologies Freshers Recruitment in Chennai As Java Developer. BE, BTech, MCA Freshers are eligible to apply for this job. More details regarding TNQ Technologies Chennai Freshers Job Openings is given below.","postTitle":"TNQ Technologies Freshers Recruitment | Java Developer | Chennai"},{"Job Location":"Across India (Bengaluru, Hyderabad, Chennai, Delhi and Pune)\n","Navigation":"amazon-freshers-recruitment-software-development-engineer-intern-across-india","Job Summary":"At Amazon, we hire the best minds in technology to innovate and build on behalf of our customers.\nThe intense focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA.\nOur interns write real software and collaborate with a select group of experienced software development engineers (SDEs) who guide interns on projects that matter to our customers.\n","Note 2":"Applications are reviewed on a rolling basis.\nFor an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal.\nAmazon works with a high volume of applicants so we appreciate your patience as we review applications.\n","Job Category":"IT | Software\n","Job Description":"As an intern, you will be matched to a manager and a mentor.\nYou will have the opportunity to influence the evolution of Amazon technology and lead mission critical projects early in your career.\nYour design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed systems, data mining, automation, optimization, scalability, and security – just to name a few.\nIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship.\nNo matter the location of your internship, we give you the tools to own your project and learn in a real-world setting.\nMany of our technologies overlap, and you would be hard pressed to find a team that is not using Amazon Web Services (AWS), touching the catalogue, or iterating services to better personalize for customers.\n","Date":"19-Sep-2020","Job Responsibilities":"Collaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\nDesign and build innovative technologies in a large distributed computing environment, and help lead fundamental changes in the industry.\nCreate solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\nBuild distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage\/use.\nAbility to design and code the right solutions starting with broadly defined problems.\nWork in an agile environment to deliver high-quality software.\n","Note 1":"By applying to this position your application will be considered for all locations we hire for in India.\nThis includes but is not limited to Bengaluru, Chennai, Hyderabad, Delhi and Pune.\nAmazon internships are full-time (40 hours\/week) for eight consecutive weeks (two months) with start dates between April and May 2021 or six months (as per university academic framework) with start dates between January and February 2021.\n","Company Name":"Amazon\n","Experience":"Freshers\n","Qualification":"BE, BTech, ME, MTech, MCA, MSc (Computers)\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/1227693\/software-development-engineer-intern - ","Desired Skills":"","Job Position":"Software Development Engineer Intern\n","Basic Qualifications":"Currently enrolled in a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, or related field at time of application.\nKnowledge of the syntax of languages such as Java, C\/C++ or Python.\nKnowledge of Computer Science fundamentals such as object-oriented design, algorithm design, data structures, problem solving, and complexity analysis.\n","Summary":"Amazon Freshers Recruitment Across India For Software Development Engineer Intern Position. BE, BTech, ME, MTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding Amazon Freshers Job Openings is given below.","postTitle":"Amazon Freshers Recruitment | Software Development Engineer Intern | Across India","Preferred Qualifications":"Previous technical internship(s), if applicable.\nExperience with distributed, multi-tiered systems, algorithms, and relational databases.\nExperience in optimization mathematics such as linear programming and nonlinear optimization.\nAbility to effectively articulate technical challenges and solutions.\nAdept at handling ambiguous or undefined problems as well as ability to think abstractly.\n"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000\/- per annum\n","Contact Person":"HR\nCompany Website:\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"soft-suave-technologies-walkin-full-stack-developer-0-2-years-26th-to-27th-september-2020-bangalore","Walkin Time":"9\n","Job Category":"IT | Software\n","Job Description":"Execute full software development life cycle (SDLC)\nCode, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology.\nDevelop flowcharts, layouts and documentation to identify requirements and solutions\nMaintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes.\nWrite quality and clean code using prescribed specifications.\nEvaluate the interrelationships between programs.\nAnalyze performance of programs and take action to correct deficiencies .\nConfer with users to gain understanding of needed changes or modifications of existing programs.\nResolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"10\n","Year of Passing":"2018, 2019, 2020 batch\n","Walkin Date":"26th, 27th September 2020\n","Company Name":"Soft Suave Technologies\n","Walkin Venue":"Soft Suave Technologies Pvt Ltd, Gayatri Tech Park (4th floor), Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru – 560066.\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-walk-in-bangalore-soft-suave-technologies-private-limited-bengaluru-bangalore-0-to-2-years-190920000575?src=jobsearchDesk&sid=1600548771756218_3 - ","Desired Skills":"Good knowledge in Java, Pyton, Node JS, C++.\nStrong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL.\nLogical and analytical thinking towards the Java programming.\nShould have designed at least one project module using object oriented analysis and design techniques.\nSound knowledge of modern software architecture and development techniques.\nShould be a self initiator and interested in learning new technologies.\n","Job Position":"Full Stack Developer (Trainee Software Engineer – Java, Python, Node JS, C++)\n","Interview Process":"Level 1: Technical Aptitude Test.\nLevel 2: Written Programming Test.\nLevel 3: System Execution of Program.\nLevel 4: HR Interview.\n","Note":"Those who have taken up the interview in last 3 months are not eligible to undergo interview again.\n","Summary":"Soft Suave Technologies Walkin in Bangalore As Full Stack Developer On 26th, 27th September 2020. BE, BTech, ME, MTech, MCA Graduates 2018, 2019, 2020 are eligible for this walkin drive. More details regarding Soft Suave Technologies Bangalore Walkin Drive is given below.","postTitle":"Soft Suave Technologies Walkin | Full Stack Developer (0-2 years) | 26th to 27th September 2020 | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-data-associate-0-3-years-hyderabad","Job Summary":"About the team: The Alexa Data Services (ADS) organization provides data creation, curation, and analytics services to help develop, test, and train the Alexa AI. We work closely with Amazon Machine Learning (ML) Science and modeling teams, providing the critical data they need to improve Alexas speech recognition and language understanding capabilities.\n","Job Description":"We are hiring Data Associates (1 year contract) in our Hyderabad team to undertake labeling functions such as transcription, annotation and dialogue evaluation on speech & text data to assess and improve Alexas performance.\nAs a Data Associate, you will work on speech and text data.\nWe value your high attention to details and your ability to adapt to dynamic changes due to emerging business requirements.\nYou are recognized as a role model for your proactivity in identifying issues with efficiency and accuracy.\n","Date":"23-Sep-2020","Job Responsibilities":"Work with text, speech and other types of data and attach tags to the contents, at scale.\nDeliver high quality of labeled data, leveraging guidelines to meet specific key performance indicators, and using in-house tools and software.\nReport issues with tools and software to the development team when necessary.\nProvide feedback for improvements to existing tooling that can increase labeling throughput and quality.\nMaintain strict confidentiality and follow all applicable Amazon policies for securing confidential information.\nProficiency in English, Hindi grammar and spelling (both written and verbal).\nComfortable working with speech from various dialects and accents of Hindi.\nWillingness and flexibility to work in shifts including night shift etc.\n","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"High School, Diploma, Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-hindi-data-associate-hyderabad-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-3-years-230920001257 - ","Job Position":"Hindi Data Associate\n","Note":"Work Location: Hyderabad (Only candidates currently in Hyderabad are eligible).\nJob Type: Contractual role for 1 year.\n","Basic Qualifications":"High School or Equivalent diploma\nWork Experience: Maximum of 24 months of experience in any industry\nProficient computer skills in MS Office with good typing speed (> 40 wpm and >90% accuracy), including basic troubleshooting with the ability to utilize proprietary tools.\n","Summary":"Amazon Recruitment in Hyderabad For Data Associate Position. High School, Diploma, Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Data Associate (0-3 years) | Hyderabad"},{"Job Location":"Bangalore\n","Non Voice Process Interview Rounds":"HR\nOnline Test\nEssay\nOps Round\n","Salary":"Rs. 13,000 – 21,000\/- per month ( Take Home Salary) and incentives.\n","Navigation":"247-ai-recruitment-voice-non-voice-process-0-4-years-bangalore","Eligibility Criteria":"Minimum Qualification: Candidate should have completed 12th \/ 2nd PUC or 3 years of diploma from a recognized university.\nBE \/BTech and Graduates from any stream are eligible to apply.\nFreshers and candidates with prior relevant (BPO) and non-relevant (other domain) experience are eligible to apply.\nMaster Graduate should have atleast 1 year experience in BPO sector.\nGood Communication Skills only in English\n","Job Category":"BPO\n","Job Description":"[24]7.ai is hiring freshers and experienced candidates for International Voice process and Non Voice Process.\nShifts: Rotational Shifts and 5 days Working.\nWork Location: Bangalore – [24]7.ai Prestige Tech Platina, Kadubeesanahalli, Marathahalli Outer Ring Road, Bangalore 560087.\n","Voice Process Interview Rounds":"HR\nVarsant Round\nScalability\nOps Round\n","Benefits":"Transport: Free transportation with door to door pick up and drop facility round the clock.\nLife Insurance for self.\nMedical Insurance for self and immediate dependents.\n","Date":"19-Sep-2020","No.of Openings":"100\n","Company Name":"[24]7.ai\n","Experience":"Freshers \/ 0 to 4 years\n","Qualification":"PUC (12th), Diploma, Undergraduates, Graduates\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-online-interview-for-24-7-ai-international-voice-and-non-voice-proce-24-7-customer-private-ltd-bengaluru-bangalore-0-to-4-years-020620006544?src=jobsearchDesk&sid=15999459315141060_5 - ","Job Position":"International Voice and Non Voice Process\n","Interview Process":"Online Interview.\n","Note":"Candidates who have attended the interview in last 30 days are not eligible.\n","Summary":"[24]7.ai Recruitment Freshers and Experienced in Bangalore For Voice and Non Voice Process. 12th, Diploma, Undergraduates, Graduates are eligible to apply for this job. More details regarding [24]7.ai Bangalore Job Openings is given below.","postTitle":"[24]7.ai Recruitment | Voice, Non Voice Process (0-4 years) | Bangalore","Job Designation":"Associate and Senior Associate\n"},{"Job Location":"Hyderabad, Vijayawada, Vizag\n","Salary":"Rs. 1,50,000 – 2,75,000\/- per annum\n","Navigation":"indusind-bank-freshers-recruitment-business-development-executive-0-4-years-hyderabad-vijayawada-vizag","Eligibility Criteria":"Work Experience: 1 to 4 Years (Preferably from NBFC, BFSI sector).\nFreshers can apply.\n","Job Category":"Banking\n","Job Description":"IndusInd Bank is looking forward to hire young, dynamic and agile Business Development Executive \/ Businees Development Manager in Andhra Pradesh and Telangana who comes with the conviction & ability to work in a fast pace environment with rewarding career opportunities.\nAchieve the Sales Targets (CA\/SA) set in terms of NTB, Value & product mix.\nAchieve the budgeted cross sell targets across the designated Product lines\nExtend professional customer service to achieve a high level of customer satisfaction and retention\nAchieve defined quality parameters in terms of AMB depletion\/FTR %\/ UID penetration and NBD penetration.\nAchieve Sales call plans to acquire large prospective customers through referrals.\nHave complete knowledge of the customer base in terms of the profile, demographics & psycho graphics for his\/ her assigned territory.\nWork Location: Andhra Pradesh and Telangana.\n","Bank Name":"IndusInd Bank\n","Date":"19-Sep-2020","No.of Openings":"50\n","Experience":"Freshers\/1 to 4 years\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-business-development-manager-indusind-bank-limited-visakhapatnam-vizag-hyderabad-secunderabad-vijayawada-0-to-4-years-150720000608?src=jobsearchDesk&sid=15987346357667500_4 - ","About IndusInd Bank":"Commencing its operations in the year 1994, IndusInd Bank derives its name and inspiration from the Indus Valley Civilization – a culture described as one of the greatest in the ancient world combining a spirit of innovation with sound business and trade practices. IndusInd Bank has grown ceaselessly and dynamically as an organization driven by a sincere zeal to give its customers banking services and products at par with the highest quality standards in the industry.\nIndusInd bank boasts of more than 1000 branches and over 1,800 ATMs spread across the country. The Bank also has representative offices in London, Dubai and Abu Dhabi. Bank Website: www.indusind.com.\n","Job Position":"Business Development Executive \/ Business Development Manager\n","Summary":"IndusInd Bank Freshers and Experienced Recruitment in Hyderabad, Vijayawada, Vizag As Business Development Executive. Any Graduates are eligible to apply for this job. More details regarding IndusInd Recruitment 2020 is given below.","postTitle":"IndusInd Bank Freshers Recruitment | Business Development Executive (0-4 years) | Hyderabad, Vijayawada, Vizag"},{"Job Location":"Hyderabad\n","Navigation":"osi-systems-recruitment-software-development-intern-0-1-year-hyderabad","Eligibility Criteria":"Required 0 to 1 years of Software development experience using several of the skills and technologies mentioned below.\nJava EE certification highly preferred.\n","Job Category":"IT | Software\n","Job Description":"Intern shall be responsible for writing unit test cases uinf Junit framewok for Java code developed by team.\nHe\/She should be able to collaborate effectively with development team to write effective unit test cases to improve code coverage and detect defects early in the development cycle.\nHe\/She should be adhering to the schedules, standards and quality processes and procedures of the Organization.\nUphold the company’s core values of Integrity, Innovation, Accountability, and Teamwork.\nDemonstrate behavior consistent with the company’s Code of Ethics and Conduct.\nDuties may be modified or assigned at any time to meet the needs of the business.\nIt is the responsibility of every employee to report to their manager or a member of senior management any quality problems or defects in order for corrective action to be implemented and to avoid recurrence of the problem.\n","Date":"19-Sep-2020","Job Responsibilities":"Understand the product functionalities and code in depth for writing unit test cases.\nAble to write positive, negative and edge conditions unit test cases using Junit framework.\nUnit testing & debugging of production software.\nUnderstanding of code coverage tools such as cobertura.\nComplete assigned tasks on-time and in accordance with the appropriate process.\nGood in usage of software configuration management tools, defect tracking tools, Static Code Analyzer tools, Debugging tools.\n","Company Name":"OSI Systems\n","Experience":"0 to 1 year\n","Qualification":"BE\/BTech\/ME\/MTech (CSE), MCA or equivalent experience.\n","How To Apply":"https:\/\/jobs-osi-systems.icims.com\/jobs\/19672\/software-development-intern\/job - ","Desired Skills":"Candidates should have knowledge in the following skills and technologies:\n","Job Position":"Software Development Intern (Java)\n","Summary":"OSI Systems Recruitment in Hyderabad For Software Development Intern Position. BE, BTech, ME, MTech, MCA Graduates are eligible to apply for this job. More details regarding OSI Systems Hyderabad Job Openings is given below.","postTitle":"OSI Systems Recruitment | Software Development Intern (0-1 year) | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"globalfoundries-freshers-recruitment-java-intern-bangalore","Intern Duration":"6 months\n","Required Qualifications":"Final year students pursuing BTech (BE) in any stream (Computers, Electronics, Electrical & Mechanical Engineering etc.,) or Fresh graduate getting trained in any training institute on programming languages.\n","Job Category":"IT | Software\n","Job Description":"GlobalFoundries is looking for Fresh Graduates or Final Year Students to work on Software Development & Test Teams.\nAs a member of the team, reporting to the Manufacturing Systems COE lead, the candidate will participate in every phase of the software development lifecycle, from design stages up to the final product release.\nThe candidate will work closely with developers, project managers, testers and end-users.\nResponsibilities include design, development of software and creating automated tests.\nCandidate should be able to drive and execute development with effectiveness and thereby reduce maintenance costs.\n","Date":"19-Sep-2020","Company Name":"GlobalFoundries\n","Experience":"Freshers\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/gfoundries.taleo.net\/careersection\/gf_ext\/jobdetail.ftl?job=216685 - ","Job Position":"Intern (Java)\n","Summary":"GlobalFoundries Freshers Recruitment in Bangalore As Intern (Java). BE, BTech Freshers are eligible to apply for this job. More details regarding GlobalFoundries Bangalore Freshers Job Openings is given below.","postTitle":"GlobalFoundries Freshers Recruitment | Java Intern | Bangalore","Preferred Qualifications":"Advanced degree in computer science, software engineering or relevant field.\nUnderstanding of software development life cycle (SDLC).\nUnderstanding of Object Oriented Programming.\nExposure to any programing languages like Java, C, Javascript, Python, SQL, Oracle DB, RHEL (Linux) OS, Analyzing Logs.\nUnderstanding of Database concepts and ability to write SQL queries.\nExcellent verbal and written communication.\n","Job Essential Responsibilities":"Undergo provided training, understand specifications and complete assigned tasks on time.\nWork with teams across multiple geographic locations around the globe.\n\n"},{"Job Location":"Chennai\n","Navigation":"zoho-corporation-recruitment-technical-support-engineer-0-2-years-chennai","Eligibility Criteria":"Proficiency in English.\nAttention to detail and a strong desire to learn.\nAbility to work independently and deliver value to the customers and the company.\nShould be willing to work in night shifts.\nMust be interested in the accounting and finance side.\n","Job Category":"IT | Software\n","Job Description":"Answering customer queries through phone, e-mail & chat about product features and capabilities.\nHelping customers with basic troubleshooting, configuration difficulties and advanced technical issues in the product by working closely with the development team.\nPrompt communication of customer requirements to the development team.\nFacilitate with product demos, implementations and training.\n","Date":"23-Sep-2020","Year of Passing":"2018, 2019, 2020\n","Company Name":"Zoho Corporation\n","Experience":"0 t o 2 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/careers.zohorecruit.com\/recruit\/WebFormServeServlet?rid=162060bf19ef5bfd9c408621bb66328b6c49a8d3a80058b2d65120b6b5591867gidf62d65585721aed69c3d0236e3a70183 - ","Job Position":"Technical Support Engineer\n","Note":"If you have attended the written test \/ Interview with ZOHO anytime in the past 3 months, you should not attend this test.\nStudents who are graduating in 2021 are not eligible to apply this form.\n","Summary":"Zoho Corporation Recruitment in Chennai For Technical Support Engineer Position. Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Zoho Corporation Chennai Job Openings is given below.","postTitle":"Zoho Corporation Recruitment | Technical Support Engineer (0-2 years) | Chennai"},{"Job Location":"Bangalore\n","Navigation":"axis-bank-freshers-recruitment-business-development-executive-bangalore","Job Description":"To increase the customer base by developing business relationships with current customers.\n","Bank Name":"Axis Bank\n","Date":"20-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"It is a field job which involve traveling within the city\/local area and the following responsibilities:\n","Experience":"Freshers\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-fresher-axis-bank-limited-bengaluru-bangalore-0-to-1-years-240820000258?src=jobsearchDesk&sid=15982611600164326 - ","Desired Skills":"Good communication skills.\nProactive And Creative\nGood Presentable Skills.\n","Job Position":"Business Development Executive\n","Summary":"Axis Bank Freshers Recruitment in Bangalore As Business Development Executive. Any Graduate, Post Graduate Freshers are eligible to apply for this job. More details regarding Axis Bank Bangalore Freshers Job Openings is given below.","postTitle":"Axis Bank Freshers Recruitment | Business Development Executive | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"wipro-freshers-recruitment-document-validation-and-processing-0-1-year-bangalore","Eligibility Criteria":"Minimum Qualification: Graduate\/BE\/BTech would be considered.\nResults pending would not be eligible.\nFresher, Experienced up to 0.6 – 1 year will be considered (More than 1 year will not be considered).\nShould have good typing speed, Quick Learner.\nFlexibility to work on 24\/7 shift.\nShould adhere to the company policies.\nImmediate joining required.\n","Job Category":"BPO\n","Job Description":"Entry Level Processor, who validates the BOL (Bill of Lading)\/Tenders received and processes the same as per the SOP.\n5 day working, rotational weekly offs (can be split off).\n","Date":"19-Sep-2020","Job Responsibilities":"Matching the documents with internal tools and initiating the payment.\nReceiving invoices and processing them immediately for payment.\nConsistently exceed productivity and error standards.\nShould be able to provide updates\/best practice sharing to the team.\nProtects organization’s value by keeping information confidential.\nHandled customer inquiry functions.\nUploading documents (Internal Tools).\nKeeping a great relationship with all the Client.\n","Company Name":"Wipro\n","Experience":"Freshers \/ 6 months to 1 year\n","Qualification":"BE, BTech, Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-document-validation-and-processing-wipro-limited-bengaluru-bangalore-0-to-1-years-040920001752?src=jobsearchDesk&sid=15992551676275192_18 - ","Desired Skills":"Flexible with Shifts.\nShould be ready work on all Public Holidays (Indian & International).\nGood communication skills (Written and Verbal)\n","Job Position":"Document Validation and Processing\n","Summary":"Wipro Freshers and Experienced Recruitment in Bangalore For Document Validation and Processing. BE, BTech, Any Graduates are eligible to apply for this job. More details regarding Wipro Bangalore Freshers Job Openings is given below.","postTitle":"Wipro Freshers Recruitment | Document Validation and Processing (0-1 year) | Bangalore"},{"Job Location":"Chennai\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"changepond-technologies-freshers-walkin-software-trainee-24th-to-25th-september-2020-chennai","Eligibility Criteria":"Fresher’s only.\nGraduates with an aggregate of minimum 60% in Academics.\nMandate: Java\/.Net Certification from any Training Institute\nGood communication Skills.\n","Walkin Time":"9.30 AM to 12.30 PM\n","Job Category":"IT | Software\n","Job Description":"Changepond Technologies is Hiring Engineering graduates – Freshers For Trainee Position.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"20\n","Year of Passing":"2017, 2018, 2019\n","Walkin Date":"24tth, 25th September 2020\n","Company Name":"Changepond Technologies\n","Walkin Venue":"Changepond Technologies, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai – 603 103. Land Mark: Opposite to TCS 2nd Gate\nContact Person: Kalaiselvan R (HR)\nCompany Website: www.changepond.com\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-engineering-graduates-fresher-s-for-changepond-technologies-changepond-technologies-private-limited-chennai-0-to-1-years-210920002968?src=jobsearchDesk&sid=16007227599368720_2 - ","Job Position":"Software Trainee (.NET\/Java)\n","Summary":"Changepond Technologies Freshers Walkin Drive in Chennai For Software Trainee Position. BE, BTech, MCA Graduates 2017, 2018, 2019 are eligible for this walkin. More details regarding Changepond Technologies Chennai Freshers Walkin is given below.","postTitle":"Changepond Technologies Freshers Walkin | Software Trainee | 24th to 25th September 2020 | Chennai"},{"Job Location":"Bangalore\n","Salary":"Rs. 2,00,000 – 2,50,000\/- per annum\n","Navigation":"amazon-recruitment-content-risk-analyst-0-2-years-bangalore","Eligibility Criteria":"For new hires DA (Device Associate) evaluation will include basic coding knowledge and technical evaluation round.\nOpen to working in shifts and rotational week offs.\nStrong knowledge in language vocabulary and grammar\nAptitude for grasping and applying acquired knowledge\nHighly skilled at analyzing data and sorting relevant information\nA passion for computers, eCommerce, the Internet, digital content, and the mobile market segment.\nMeticulous attention to detail; the ability to juggle many tasks in parallel without lowering your quality bar\nComfort working with a broad range of technological productivity and work-flow management tools including SharePoint, Excel, and Word\nStreet smarts; willingness to roll up the sleeves and do whatever is necessary to meet team goal.\nSelf-motivation and a strong bias for action; the ability to hit aggressive productivity goals without micromanagement\n","Job Category":"IT | Software\n","Job Description":"Amazon Bangalore is offering a truly exceptional opportunity to be a part of a team working on Amazon.com’s best selling products.\nOur systems need to meet remarkably high standards of quality, performance and reliability, operating around the clock on a massive scale.\nIf you are a curious, talented, detail-oriented and enthusiastic person who is passionate about quality and is enthusiastic about the new cutting edge technology offered to customers, then this is the right team for you.\nDevice Associates at Amazon Appstore test cutting edge apps and products at the user level , both manually and with automated tools.\nDevice Associates at Amazon are excellent individual contributors capable of taking up tasks of test case execution from start to completion with minimal help.\nDevice Associates would be responsible for understanding the product in detail, and updating the test case tool with test execution results.\nTablets, Smartphones, and other content streaming devices are becoming increasingly sophisticated and pervasive, and they are enabling customers to access content, applications, and services anywhere.\nAmazons experience in retail, technology, digital content, and mobile services provides a strong foundation for future development in this arena, and were moving aggressively to help our customers in new and innovative ways.\nThe Amazon Appstore is looking for high-energy, detail-oriented, and technically-savvy Content Test Associates to perform content evaluation on the digital content consumed by Amazons mobile customers.\nYou will manage the flow and processing of new submissions and re-submissions to include record creation, record management, download, install, test and validation of the digital content to ensure it meets Amazons high quality bar.\nAbove all, you will play a vital role in helping us meet our selection expansion goals while protecting our high-quality customer experience.\n","Date":"20-Sep-2020","Job Responsibilities":"Some of the key job functions of a Device associate involved in testing are:\n","Company Name":"Amazon\n","Experience":"0 t o 2 years\n","Qualification":"BE\/BTech, ME\/MTech, BSc, MCA with specialization in Computer Science, Information Technology.\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-content-risk-analyst-bangalore-amazon-development-centre-india-pvt-ltd-bengaluru-bangalore-0-to-2-years-260820001190 - ","Job Position":"Content Risk Analyst\n","Summary":"Amazon Recruitment in Bangalore For Content Risk Analyst Position. BE, BTech, ME, MTech, MCA, BSc Graduates are eligible to apply for this job. More details regarding Amazon Bangalore Job Openings is given below.","postTitle":"Amazon Recruitment | Content Risk Analyst (0-2 years) | Bangalore"},{"Job Location":"Across India\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"thyrocare-technologies-freshers-recruitment-business-development-executive-across-india","Eligibility Criteria":"Freshers.\nGraduate\/Pursuing Graduation.\nGood written and verbal communication skill.\nShould know English and additional one Regional language.\nMust have system and internet connectivity at home.\n","Job Description":"Work Locations: Hyderabad, Bengaluru, Chennai, Delhi NCR, Mumbai, Bhubaneshwar, Ahmedabad, Kochi, Kolkata.\n","Benefits":"Work From Home opportunity.\nFull time payroll job.\nMonthly allowance for internet connectivity.\n","Date":"23-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"Procure network members viz; hospital, laboratory, polyclinics that associates with the company to ensure pan-India presence and service.\nEnhance B2B business for company.\nIdentify new sales opportunities within existing association by up-selling and cross-selling.\nImplementing the company strategy across all the territory.\n","Company Name":"Thyrocare Technologies\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-thyrocare-technologies-ltd-chennai-bhubaneshwar-delhi-ncr-mumbai-ahmedabad-bengaluru-bangalore-ernakulam-kochi-cochin-hyderabad-secunderabad-kolkata-0-to-1-years-220920001050?src=jobsearchDesk&sid=1600806475101972_6 - ","Job Position":"Business Development Executive\n","Summary":"Thyrocare Technologies Freshers Recruitment Across India For Business Development Executive Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Thyrocare Technologies Freshers Job Openings is given below.","postTitle":"Thyrocare Technologies Freshers Recruitment | Business Development Executive | Across India"}]}