{"jobs":[{"Job Location":"Hyderabad\n","Navigation":"posidex-technologies-freshers-recruitment-software-developer-hyderabad","Eligibility Criteria":"Graduates with 65% or above throughout his\/her academics.\nFreshers with good skills in Java and Advance Java.\nWilling to travel at short notice to client location for support, deployment or for trouble shooting activities.\n","Job Category":"IT | Software\n","Date":"20-Sep-2020","About Posidex Technologies":"POSIDEX Technologies’ innovative Enterprise Customer Data Platform, with its proven sophisticated entity resolution technology based on Machine Learning and InMemory Analytics, has transformed the way businesses operate and engage with their customers during their entire life cycle with the organisation. The ability to combine many attributes of an entity, and going beyond the current use of fuzzy logic techniques, provides a very granular configuration for real-time resolution over very large volumes. This innovative approach provides our clients a game changing ability to widen the scope of their solutions in Fraud Detection, Risk Management, Compliance and Customer Experience.\nPOSIDEX’s disruptive technologies has motivated its clients to replace their existing customer data platforms; achieve a lower TCO; and very high return on investment by way of increased throughput and automated decisioning. POSIDEX customers also benefit indirectly due to improved risk mitigation, better compliance and more reliable data for Analytics and Business Intelligence. POSIDEX technology has been tested, proven and is trusted by 40+ large enterprise level customers across Banking, Financial Services, Insurance, Securities, Retail, Telecom, Credit Bureau and Government verticals in meeting their critical business needs in real-time. Company Website: www.posidex.com.\n","Company Name":"Posidex Technologies\n","Experience":"Freshers\n","Qualification":"BTech, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-freshers-posidex-technologies-pvt-ltd-hyderabad-secunderabad-0-to-1-years-180920500152?src=jobsearchDesk&sid=16004627465015081_2 - ","Desired Skills":"Basic database skills in Oracle\/MySQL\/MS SQLServer\nBasic knowledge of Angular and Spring Frameworks\nInitiaive driven with Strong communication, analytical and problem-solving skills.\n","Job Position":"Software Developer (Java)\n","Summary":"Posidex Technologies Freshers Recruitment in Hyderabad For Software Developer Position. BTech, MTech, MCA Freshers are eligible to apply for this job. More details regarding Posidex Technologies Hyderabad Freshers Job Openings is given below.","postTitle":"Posidex Technologies Freshers Recruitment | Software Developer | Hyderabad"},{"Job Location":"Bangalore\n","Job Requirements":"Good understanding of Security, LAN\/WAN topologies and technologies.\nIn-depth knowledge of OSI Model, TCP\/IP, Network Security basics.\nAbility to work on in a high-level stress and interrupt driven environment\nGood understanding of L2-L7 networking protocols, major Operating Systems such as UNIX \/ Linux\nDemonstrated ability to use in-depth troubleshooting to resolve or workaround customer issues using troubleshooting tools i.e. Wire Shark, Netmon etc.\nRouting and Switching knowledge will be added advantage.\nWilling to work in 24×7 environment in night shifts.\n","Navigation":"sonicwall-freshers-recruitment-graduate-trainee-engineer-intern-bangalore","Eligibility Criteria":"Bachelor’s degree in Computer Science\/Information Sciences\/ Electronic & Communications Engineering\n0 – 1 years networking and network security support experience with solid understanding of LAN\/WAN topologies and technologies.\nIn-depth knowledge of the network protocols: TCP\/IP.\nRouting Protocols like OSPF, RIP, BGP, Firewall, IDS\/IPS will be added advantage.\n","Job Category":"IT | Software\n","Job Description":"SonicWall is looking for Graduates who are comfortable to work in fixed night shifts.\n","Date":"23-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Job Responsibilities":"Responsible for providing technical support across SonicWall product lines via Phone\/Web & Emails in 24x7x365 days environment.\nAssist customers with deployment of SonicWall network security products like Firewall\/IPS and VPN solutions.\nProvide technical solutions and workarounds for end users with their issues on respective product line.\nOwns customer issues from beginning to resolution (handles in place)\nAssists customers by diagnosing problems and providing resolutions for technical and service issues.\nUse troubleshooting techniques and tools to identify products that are defective and follows guidelines in issuing service calls\/contacts.\nAdvises\/educates customers within procedural guidelines to ensure a complete solution to their technical or service questions.\nRecreates, identifies and provides input on unique or recurring customer problems.\nFocuses on delivering a positive customer experience according to SonicWall standards.\nMonitors and tracks issues to ensure accurate resolution.\nCandidate should work closely with the Engineering and other cross functional teams to replicate the issues reported by the customers, validate the bug fixes provided through various patch releases and resolve the customer issues in a professional manner.\nProvide consistent feedback to the team on products supported.\nRemains knowledgeable of SonicWall product line and related industry products and technologies.\n","Company Name":"SonicWall\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"BE\/BTech (CS\/ECE\/IT\/IS)\n","How To Apply":"https:\/\/boards.greenhouse.io\/sonicwall\/jobs\/2347856 - ","Job Position":"Graduate Trainee Engineer (Intern)\n","Summary":"SonicWall Freshers Recruitment in Bangalore As Graduate Trainee Engineer Intern. BE, BTech Freshers 2019, 2020 are eligible to apply for this job. More details regarding SonicWall Bangalore Freshers Job Openings 2020 is given below.","postTitle":"SonicWall Freshers Recruitment | Graduate Trainee Engineer Intern | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,11,473\/- per annum (CTC)\n","Navigation":"virtusa-recruitment-analyst-2018-2019-2020-batch-hyderabad","Eligibility Criteria":"Should sign service agreement of 14 months.\nShould be Open to work in rotational shifts.\nBatch of 2020, if you have cleared final Semester and have mark sheets, then please apply.\n","Job Description":"Review Ads, Search Contents.\nReview Contents given by client – Comments \/ edit.\nReview search contents and classify them as per client guidelines.\n","Date":"22-Sep-2020","No.of Openings":"50\n","Year of Passing":"2018, 2019, 2020 Batch\n","Company Name":"Virtusa\n","Qualification":"BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Analyst-Ads-Curations-jobs-in-Hyderabad-Secunderabad-in-Virtusa-Consulting-Services-Pvt-Ltd-220920600018 - ","Industry Type":"IT-Software – Software Services\n","Desired Skills":"High proficiency in Verbal\/Written English.\nExpert knowledge of MS Excel (analyze and generate reports using Pivot Table, V & H look ups, apply formulaes like sum if, Index, match etc).\nGood working knowledge about Internet.\nAware about how Google search works, good searching skills through use of effective keywords.\nTech Savvy is definitely plus\nFamiliar in searching for goods \/ services \/ ads online.\n","Job Position":"Analyst – Ads Curations\n","Summary":"Virtusa Recruitment in Hyderabad For Analyst Position. BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Virtusa Hyderabad Job Openings is given below.","postTitle":"Virtusa Recruitment | Analyst | 2018, 2019, 2020 Batch | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"oracle-recruitment-applications-developer-0-2-years-bangalore","Eligibility Criteria":"BS degree or equivalent experience relevant to functional area.\n0-2 years of previous software engineering or related experience.\n","Job Category":"IT | Software\n","Job Description":"Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.\nAs a member of the software engineering division, you will develop software according to provided design specifications.\nAnalyze system specifications and existing business processes and information systems.\nBuild enhancements and resolve bugs.\nBuild and execute unit tests and unit test plans.\nWork involves some problem solving with assistance and guidance in understanding and applying company policies and processes.\nGaining competence in own area and acquiring a higher level understanding of role, processes and procedures.\n","Date":"23-Sep-2020","Company Name":"Oracle\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, BS\n","How To Apply":"https:\/\/oracle.taleo.net\/careersection\/2\/jobdetail.ftl?job=20000R8F&tz=GMT%2B05%3A30&tzname=Asia%2FKolkata - ","Job Position":"Applications Developer\n","Note":"Applicants are required to read, write, and speak the following languages: English.\n","Summary":"Oracle Recruitment in Bangalore For Applications Developer Position. BE, BTech, BS Graduates are eligible to apply for this job. More details regarding Oracle Bangalore Job Openings is given below.","postTitle":"Oracle Recruitment | Applications Developer (0-2 years) | Bangalore","Preferred Qualifications":"Software Development & DevOps.\n"},{"Job Location":"Bangalore\n","Company Name":"Zeotap\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/jobs.lever.co\/zeotap\/d07f2c87-afa4-4352-8e3f-49f412f0e1be\/ - ","Navigation":"zeotap-recruitment-software-engineer-intern-bangalore","Job Position":"Software Engineer Intern\n","Eligibility Criteria":"Degree in Computer Science or IT with strong academic credentials.\nCourses in Big data and No SQL technologies.\nCourses in complex SQL queries.\nVery good in Advanced data structures and algorithms.\nStrong problem-solving ability.\nGood programming skills in any one of – Java, Scala, GoLang, Python.\nGood SQL querying skills. Above Basic level.\nExperience in handling terabyte size datasets.\nStrong understanding of transactional and high scale systems.\n","Summary":"Zeotap Recruitment in Bangalore For Software Engineer Intern Position. BE, BTech Graduates are eligible to apply for this job. More details regarding Zeotap Bangalore Job Openings is given below.","postTitle":"Zeotap Recruitment | Software Engineer Intern | Bangalore","Job Category":"IT | Software\n","Date":"20-Sep-2020","Job Responsibilities":"You will be a part of product development team, developing modules for data driven applications\nYou will deliver production quality code adhering to best practices\nYou should assist in production troubleshooting\nYou should research and implement cutting-edge technologies relevant to zeotap business problems\nYou adhere to zeotap’s company, privacy and information security policies and procedures\nYou complete all the awareness training assigned on time\n"},{"Job Location":"Bangalore\n","Salary":"Rs. 1,50,000 – 2,50,000\/- per annum\n","Navigation":"kotak-mahindra-bank-recruitment-customer-service-executive-0-5-years-bangalore","Eligibility Criteria":"Freshers can also apply.\nExcellent communication skills Verbal & Written\nFlexible to get scattered 8 Week Offs in a month with 9hours shift (For Females: 7AM till 8PM).\nGood listening skills and strong communication abilities.\nBe Confident and willing to learn with a flair for knowledge.\nPossess an upbeat, positive can-do attitude & works with integrity\nTeam Player, collaborative Self-motivated person including the ability to act as a role model within the organization.\nShould be able to establish rapport quickly with peers, managers & customers\nTeam player: Candidate must be able to work effectively with all levels of the organization.\n","Job Description":"Work Location: Gold Hill Square, opp. to Oxford college, Popular Colony, Bommanahalli, Bengaluru, Karnataka 560068.\n","Bank Name":"Kotak Mahindra Bank\n","Date":"20-Sep-2020","No.of Openings":"10\n","Job Responsibilities":"To Attend the inbound calls of customers in Retail Liabilities and process the queries & requests to customer’s satisfaction.\nTo identify and convert the opportunities for cross selling (banking product) on customer’s call.\nResponsible for quality communication and customer servicing within laid down productivity and service benchmarks.\nEnsure customer delight and consistent service experience, including timely resolution of customer queries\/issues.\nComplete the logs specified by the process (End-of-day target).\nAdherence to Information Security norms & quality process norms.\nTo be aware of and comply with any updates about the process.\nAct on the feedback given by Team Leader\/Team Coach or Quality or on the coaching provided to the team as guidelines for improving performance.\n","Experience":"Freshers \/ 0 to 5 years\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-customer-service-executive-kotak-mahindra-bank-kotak-mahindra-bank-limited-bengaluru-bangalore-0-to-5-years-170920000999?src=jobsearchDesk&sid=16003731445686098_22 - ","Job Position":"Customer Service Executive\n","Summary":"Kotak Mahindra Bank Recruitment For Freshers and Experienced As Customer Service Executive. Any Graduates are eligible to apply for this job. More details regarding Kotak Mahindra Bank Bangalore Job Openings is given below.","postTitle":"Kotak Mahindra Bank Recruitment | Customer Service Executive (0-5 years) | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"banyan-data-services-recruitment-sql-developer-0-1-year-bangalore","Eligibility Criteria":"0-1 year of experience of SQL and PL\/SQL programming.\nFresher can also apply with intensive knowledge of SQL.\nExperience with Requirement gathering, developing database objects like Tables, Functions, Stored Procedures, Packages , Indexes, Triggers, Cursors ,Materialized Views etc.\nStrong understanding of Oracle Database fundamentals and features and good at developing complex SQL queries.\nAble to understand the business requirements and translate requirements into technical specifications including the physical and logical data modelling, designing and data flow diagrams.\nExpertise in Client-Server application development using PL\/SQL, SQL, SQL*Loader and SQL*Plus\nStrong Hands on experience with Oracle 12c\/11g database platform SQL\/PL SQL, database object modelling or above (creating modifying tables, views, sequences, aggregate functions, etc.)\nPerformance SQL Tuning including tuning\/optimizing SQL, PL\/SQL code and writing complex queries for business logics.\nExperience in the full application life-cycle from inception through deployment and maintenance.\nWork experience on customization & development of various Reports using Oracle Reports.\nExposure to Oracle 18c\/19c versions would be a plus.\nBonus point to have an exposure to Oracle APEX version 5.1 or higher, strong skills in design and development of APEX applications.\nExperience in designing and manipulating web content dynamically using JQuery, Ajax, JavaScript, Angular JS, CSS and HTML.\nProficiency in any of scripting languages i.e ruby, python, Perl, bash, shell. Experience working with an Agile Development team Excellent problem-solving skills and phenomenal debugging skills. Follow team software development methodology and maintain documentation as needed.\n","Job Category":"IT | Software\n","Date":"20-Sep-2020","Company Name":"Banyan Data Services\n","Experience":"Freshers \/ 0 to 1 year\n","Qualification":"BE, BTech, MTech, BCA, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-sql-developer-banyan-data-services-india-pvt-ltd-bengaluru-bangalore-0-to-1-years-180920000305?src=jobsearchDesk&sid=1600463121842943 - ","Desired Skills":"Demonstrated ability to deliver results on time with high quality Aptitude to independently learn new technologies.\nExperience in JavaScript, Web Services, AJAX, XML, HTML, and CSS.\nAbility to define and tackle logical problems for highly technical applications.\nAbility to select, adapt, and effectively use a variety of programming methods.\nGood communication skills with both technical and non-technical clients.\nMust be flexible to work on the office timings to accommodate the multi-national client timings.\nWilling to learn new technologies and work on research orientated projects.\nAmbitious individual who can work under their own direction towards agreed targets\/goals.\n","Job Position":"SQL Developer\n","Summary":"Banyan Data Services Recruitment For Freshers and Experienced As SQL Developer. BE, BTech, MTech, BCA, MCA Graduates are eligible to apply for this job. More details regarding Banyan Data Services Bangalore Job Openings is given below.","postTitle":"Banyan Data Services Recruitment | SQL Developer (0-1 year) | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"ibm-recruitment-full-stack-developer-0-2-years-bangalore","Preferred Technical and Professional Expertise":"Understand requirements, design, code, and test high-quality mobile apps, using cross-platform technologies such that the resulting apps operate on Apple iOS and Google Android, from a single code base.\nTake wireframes from conception to implementation and design and improve user interfacing.\nWork in frameworks such as: Flutter, React Native, or Ionic, using cross-platform mobile app development programming languages like Dart or JavaScript.\nHave an interest in, understanding of, or experience with mobile app.\n","Job Category":"IT | Software\n","Job Description":"As a Full Stack Developer\n","Date":"21-Sep-2020","Job Responsibilities":"Develop back-end portions of web services.\nCreate and talk to REST services.\nDevelop front-end applications.\nShift between multiple projects and technologies.\nWrite clean code and test it throughout the development process to ensure the quality is up to standards.\nWork on software that is used by millions of people all around the world is a challenge that you’re willing to tackle.\nPerform peer reviews and mentor the team to evolve into full stack developers.\nEncourage a self-motivated squad model of working from handling design, development, test and operations for the micro services.\n","Company Name":"IBM\n","Experience":"0 to 2 years\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-ibm-india-pvt-limited-bengaluru-bangalore-0-to-2-years-180920902061?src=jobsearchDesk&sid=16006242746066045_5 - ","Job Position":"Full Stack Developer\n","Required Technical and Professional Expertise":"0-2 years of IT experience.\nRelevant industry and software development experience.\nProven experience in Java, Ruby, Python, JavaScript, Node.js, Angular.js.\nExperience and deep skills in system level language like Core Java, Backend language like Node.js and Framework based language like JavaScript with Angular or React.\nProven experience in UI Development technologies such as HTML\/CSS, JSON and REST API development experience (APIs like REST \/ RESTful APIs).\nShould have Full stack development experience and Microservices Architecture.\nExperience in any Databases like SQL \/ NoSQL.\n","Summary":"IBM Recruitment in Bangalore As Full Stack Developer. Any Graduate, Post Graduates are eligible to apply for this job. More details regarding IBM Bangalore Job Openings is given below.","postTitle":"IBM Recruitment | Full Stack Developer (0-2 years) | Bangalore"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000\/- per annum\n","Contact Person":"HR\nCompany Website:\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"soft-suave-technologies-walkin-full-stack-developer-0-2-years-26th-to-27th-september-2020-bangalore","Walkin Time":"9\n","Job Category":"IT | Software\n","Job Description":"Execute full software development life cycle (SDLC)\nCode, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology.\nDevelop flowcharts, layouts and documentation to identify requirements and solutions\nMaintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes.\nWrite quality and clean code using prescribed specifications.\nEvaluate the interrelationships between programs.\nAnalyze performance of programs and take action to correct deficiencies .\nConfer with users to gain understanding of needed changes or modifications of existing programs.\nResolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"10\n","Year of Passing":"2018, 2019, 2020 batch\n","Walkin Date":"26th, 27th September 2020\n","Company Name":"Soft Suave Technologies\n","Walkin Venue":"Soft Suave Technologies Pvt Ltd, Gayatri Tech Park (4th floor), Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru – 560066.\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-walk-in-bangalore-soft-suave-technologies-private-limited-bengaluru-bangalore-0-to-2-years-190920000575?src=jobsearchDesk&sid=1600548771756218_3 - ","Desired Skills":"Good knowledge in Java, Pyton, Node JS, C++.\nStrong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL.\nLogical and analytical thinking towards the Java programming.\nShould have designed at least one project module using object oriented analysis and design techniques.\nSound knowledge of modern software architecture and development techniques.\nShould be a self initiator and interested in learning new technologies.\n","Job Position":"Full Stack Developer (Trainee Software Engineer – Java, Python, Node JS, C++)\n","Interview Process":"Level 1: Technical Aptitude Test.\nLevel 2: Written Programming Test.\nLevel 3: System Execution of Program.\nLevel 4: HR Interview.\n","Note":"Those who have taken up the interview in last 3 months are not eligible to undergo interview again.\n","Summary":"Soft Suave Technologies Walkin in Bangalore As Full Stack Developer On 26th, 27th September 2020. BE, BTech, ME, MTech, MCA Graduates 2018, 2019, 2020 are eligible for this walkin drive. More details regarding Soft Suave Technologies Bangalore Walkin Drive is given below.","postTitle":"Soft Suave Technologies Walkin | Full Stack Developer (0-2 years) | 26th to 27th September 2020 | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"equiniti-india-freshers-recruitment-non-voice-process-bangalore","Job Category":"BPO\n","Job Description":"In the role of Process Executive you would need to carry out a range of assigned clerical \/ support duties in accordance with predetermined procedures and service standards under appropriate guidance and direction.\n","Benefits":"Free Cab Pick & Drop.\nFree Medical Insurance.\nGreat Work life balance.\nNight Shift Allowances (for employees working for US shift only).\n","Date":"21-Sep-2020","No.of Openings":"10\n","Job Responsibilities":"Respond to a range of general standard processing enquiries over email\/chat support.\nEnsure compliance with Equinitis procedures, standards and reporting requirements, together with all relevant regulatory and statutory requirements, where appropriate implementing actions to protect our business at all times.\nAlways to undertake the duties of this role in accordance with the requirements of the companys Regulators, including FCAs Principles for Business.\n","Company Name":"Equiniti India\n","Experience":"Freshers\n","Qualification":"BCom, MCom, BA, MA, BBA, MBA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-process-executive-non-voice-equiniti-india-bengaluru-bangalore-0-to-1-years-170920004454?src=jobsearchDesk&sid=16003731445686098_22 - ","Desired Skills":"Ensure that all work is undertaken within the quality system. To be the successful candidate one would need to possess the below\n","Job Position":"Non Voice Process (Process Executive)\n","Summary":"Equiniti India Freshers Recruitment in Bangalore For Non Voice Process. BCom, MCom, BA, MA, BBA, MBA Freshers are eligible to apply for this job. More details regarding Equiniti India Freshers Job Openings is given below.","postTitle":"Equiniti India Freshers Recruitment | Non Voice Process | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-data-associate-0-3-years-hyderabad","Job Summary":"About the team: The Alexa Data Services (ADS) organization provides data creation, curation, and analytics services to help develop, test, and train the Alexa AI. We work closely with Amazon Machine Learning (ML) Science and modeling teams, providing the critical data they need to improve Alexas speech recognition and language understanding capabilities.\n","Job Description":"We are hiring Data Associates (1 year contract) in our Hyderabad team to undertake labeling functions such as transcription, annotation and dialogue evaluation on speech & text data to assess and improve Alexas performance.\nAs a Data Associate, you will work on speech and text data.\nWe value your high attention to details and your ability to adapt to dynamic changes due to emerging business requirements.\nYou are recognized as a role model for your proactivity in identifying issues with efficiency and accuracy.\n","Date":"23-Sep-2020","Job Responsibilities":"Work with text, speech and other types of data and attach tags to the contents, at scale.\nDeliver high quality of labeled data, leveraging guidelines to meet specific key performance indicators, and using in-house tools and software.\nReport issues with tools and software to the development team when necessary.\nProvide feedback for improvements to existing tooling that can increase labeling throughput and quality.\nMaintain strict confidentiality and follow all applicable Amazon policies for securing confidential information.\nProficiency in English, Hindi grammar and spelling (both written and verbal).\nComfortable working with speech from various dialects and accents of Hindi.\nWillingness and flexibility to work in shifts including night shift etc.\n","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"High School, Diploma, Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-hindi-data-associate-hyderabad-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-3-years-230920001257 - ","Job Position":"Hindi Data Associate\n","Note":"Work Location: Hyderabad (Only candidates currently in Hyderabad are eligible).\nJob Type: Contractual role for 1 year.\n","Basic Qualifications":"High School or Equivalent diploma\nWork Experience: Maximum of 24 months of experience in any industry\nProficient computer skills in MS Office with good typing speed (> 40 wpm and >90% accuracy), including basic troubleshooting with the ability to utilize proprietary tools.\n","Summary":"Amazon Recruitment in Hyderabad For Data Associate Position. High School, Diploma, Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Data Associate (0-3 years) | Hyderabad"},{"Job Location":"Hyderabad\n","Navigation":"amazon-recruitment-systems-development-engineer-intern-hyderabad","Job Category":"IT | Software\n","Job Description":"Amazon is looking for a passionate, hard-working, and talented Systems Development Engineer who can build innovative & mission critical system software applications & tools.\nYou will have an enormous opportunity to make a large impact on the design, architecture, and development of consumer products.\nYou will be responsible for delivery and support of large-scale, multi-tiered, distributed software applications and tools.\n","Date":"21-Sep-2020","Job Responsibilities":"Ability to design and code right solutions starting with broadly defined problems.\nDrive best practices and engineering excellence.\nWork with other team members to develop the architecture and design of new and current systems.\nWork in an agile environment to deliver high quality software.\n","Company Name":"Amazon\n","Experience":"Freshers\n","Qualification":"BE, BTech, ME, MTech, MCA, MSc (Computers)\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/1279070\/systems-development-eng-intern - ","Job Position":"Systems Development Engineer Intern\n","Basic Qualifications":"Candidates Pursuing Bachelors\/Masters in Computer Science or Engineering or related field.\nExcellent problem solving skills.\nPossess an extremely sound understanding of areas in the basic areas of Computer Science such as Algorithms, Data Structures, Object Oriented Design, Databases.\nBe able to write Amazon quality code in an object oriented language – preferably in C\/C++\/Java in a Linux environment.\nCandidate must have good written and oral communication skills, be a fast learner and have the ability to adapt quickly to a fast-paced development environment.\n","Summary":"Amazon Freshers Recruitment in Hyderabad For Systems Development Engineer Intern Position. BE, BTech, ME, MTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Freshers Job Openings is given below.","postTitle":"Amazon Recruitment | Systems Development Engineer Intern | Hyderabad","Preferred Qualifications":"System engineering experience in the cloud Strong, object-oriented design and coding skills (C\/C++ and\/or Java preferably on a UNIX or Linux platform).\nKnowledge of Perl or other scripting languages a plus.\nExperience with distributed (multi-tiered) systems, algorithms, and relational databases.\nExperience in optimization mathematics (linear programming, nonlinear optimization).\nAbility to effectively articulate technical challenges and solutions.\nDeal well with ambiguous\/undefined problems; ability to think abstractly.\nPrevious technical internship(s) preferred.\n"},{"Job Location":"Telangana (Warangal)\n","Navigation":"tech-mahindra-recruitment-data-entry-operator-0-1-year-telangana","Eligibility Criteria":"Experience: Fresher and Experienced both are eligible.\n","Job Category":"BPO\n","Job Description":"Tech Mahindra is hiring for International Data Entry Process.\nShift Timings: Rotational.\nWorking Days: 5 Days Working.\nTransportation: 2 way cab facility is provided.\nWork Location: Warangal, Telangana.\n","Date":"20-Sep-2020","No.of Openings":"30\n","Company Name":"Tech Mahindra\n","Experience":"Freshers \/ 0 to 1 year\n","Qualification":"Any UG, Graduate, Post Graduate, Diploma\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-requirement-for-data-entry-operator-at-warangal-tech-mahindra-ltd-warangal-0-to-1-years-250820002535 - ","About Tech Mahindra":"Tech Mahindra represents the connected world, offering innovative and customer-centric information technology experiences, enabling Enterprises, Associates and the Society to Rise. We are a USD 5.2 billion company with 125+K professionals across 90 countries, helping 973 global customers including Fortune 500 companies.\nOur convergent, digital, design experiences, innovation platforms and reusable assets connect across a number of technologies to deliver tangible business value and experiences to our stakeholders. Tech Mahindra is the highest ranked Non-U.S. company in the Forbes Global Digital 100 list (2018) and in the Forbes Fab 50 companies in Asia (2018).\nThe Mahindra Group is a USD 21 billion federation of companies that enables people to rise through innovative mobility solutions, driving rural prosperity, enhancing urban living, nurturing new businesses and fostering communities. It enjoys a leadership position in utility vehicles, information technology, financial services and vacation ownership in India and is the world’s largest tractor company, by volume.\nIt also enjoys a strong presence in agribusiness, aerospace, commercial vehicles, components, defense, logistics, real estate, renewable energy, speedboats and steel, amongst other businesses. Headquartered in India, Mahindra employs over 2,40,000 people across 100 countries. Company Website: www.techmahindra.com.\n","Desired Skills":"Should be good in English communication skills.\nGood Typing Skills.\nAbility to handle multiple tasks simultaneously with appropriate priority while performing customer service.\n","Job Position":"Data Entry Operator\n","Summary":"Tech Mahindra Recruitment in Telangana For Freshers and Experienced As Data Entry Operator. Any Under Graduate, Diploma, Graduate, Post Graduates are eligible to apply for this job. More details regarding Tech Mahindra Telangana Job Openings is given below.","postTitle":"Tech Mahindra Recruitment | Data Entry Operator (0-1 year) | Telangana"},{"Job Location":"Hyderabad\n","Company Name":"Accenture\n","Experience":"0 t o 2 years\n","Qualification":"Any Graduation\nJob Description:\n","How To Apply":"https:\/\/www.accenture.com\/in-en\/careers\/jobdetails?id=46960_india_2&title=13-Digital+Marketing - ","Navigation":"accenture-recruitment-digital-marketing-0-2-years-hyderabad","Job Position":"Digital Marketing\n","Summary":"Accenture Recruitment in Hyderabad For Digital Marketing. Any Graduates are eligible to apply for this job. More details regarding Accenture Hyderabad Job Openings is given below.","postTitle":"Accenture Recruitment | Digital Marketing (0-2 years) | Hyderabad","Date":"21-Sep-2020","Job Designation":"Associate\n","Job Responsibilities":"In this role you are required to solve routine problems, largely through precedent and referral to general guidelines.\nYour primary interaction is within your own team and your direct supervisor.\nIn this role you will be given detailed instructions on all tasks.\nThe decisions that you make impact your own work and are closely supervised.\nYou will be an individual contributor as a part of a team with a predetermined, narrow scope of work.\nPlease note that this role may require you to work in rotational shifts.\n"},{"Job Location":"Chennai\n","Navigation":"zoho-corporation-recruitment-technical-support-engineer-0-2-years-chennai","Eligibility Criteria":"Proficiency in English.\nAttention to detail and a strong desire to learn.\nAbility to work independently and deliver value to the customers and the company.\nShould be willing to work in night shifts.\nMust be interested in the accounting and finance side.\n","Job Category":"IT | Software\n","Job Description":"Answering customer queries through phone, e-mail & chat about product features and capabilities.\nHelping customers with basic troubleshooting, configuration difficulties and advanced technical issues in the product by working closely with the development team.\nPrompt communication of customer requirements to the development team.\nFacilitate with product demos, implementations and training.\n","Date":"23-Sep-2020","Year of Passing":"2018, 2019, 2020\n","Company Name":"Zoho Corporation\n","Experience":"0 t o 2 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/careers.zohorecruit.com\/recruit\/WebFormServeServlet?rid=162060bf19ef5bfd9c408621bb66328b6c49a8d3a80058b2d65120b6b5591867gidf62d65585721aed69c3d0236e3a70183 - ","Job Position":"Technical Support Engineer\n","Note":"If you have attended the written test \/ Interview with ZOHO anytime in the past 3 months, you should not attend this test.\nStudents who are graduating in 2021 are not eligible to apply this form.\n","Summary":"Zoho Corporation Recruitment in Chennai For Technical Support Engineer Position. Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Zoho Corporation Chennai Job Openings is given below.","postTitle":"Zoho Corporation Recruitment | Technical Support Engineer (0-2 years) | Chennai"},{"Job Location":"Bangalore\n","Salary":"Rs. 2,25,000 – 3,25,000\/- per annum\n","Navigation":"unisys-freshers-recruitment-service-desk-associate-bangalore","Eligibility Criteria":"Minimum Education Required: Bachelor’s Degree.\nNo prior experience required.\n","Job Description":"The primary role of a service desk associate is to answer customer requests for assistance by email, chat, web or over the phone.\nThis role is crucial to ensuring customer requirements are met in terms of communication, prioritising, escalating and resolving incidents and requests.\nWork Location: Bengaluru (Sarjapur).\n","Date":"21-Sep-2020","Job Responsibilities":"First point of contact for all end user reported issues or requests.\nTypically provides technical support for Internal and External customers.\nResponsible for providing the first-line of telephone technical support of hardware, Operating Systems, sub-systems and\/or applications for customers and\/or employees.\nApplies basic diagnostic techniques to identify problems, investigate causes and recommend solutions to correct common failures.\nTakes end to end Ownership of End User Issues till resolution and follow up as mandated by the process requirements.\nEscalates complex problems to the Remote Support Engineering staff or Field Engineering.\nMaintains call quality and response times as per the agreed SLA’s.\nMaintains records of calls and ensure all cases are updated in the system.\n","Company Name":"Unisys\n","Experience":"Freshers\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-service-desk-associate-fresher-international-voice-process-unisys-india-pvt-ltd-bengaluru-bangalore-0-to-1-years-140720903815?src=jobsearchDesk&sid=16001172892275665_2 - ","Desired Skills":"Excellent verbal and written communication.\nGood Knowledge On Operating Systems, Hardware, Networking and MS Applications.\nGood knowledge of Microsoft Office Suite (Word, Excel, Outlook etc.)\nWell versed with technology (understanding of networks, monitoring, DBMS, Windows).\nMultitasking and coordination skills.\nExcellent judgment skills to be able to properly evaluate situations and immediately provide effective solutions\nWillingness and ability to work in shifts (24×7).\nTeam Player.\n","Job Position":"Service Desk Associate (Technical Support Engineer) – Voice Process\n","Summary":"Unisys Freshers Recruitment in Bangalore For Service Desk Associate Position. Any Graduate, Post Graduate Freshers are eligible to apply for this job. More details regarding Unisys Bangalore Freshers Job Openings is given below.","postTitle":"Unisys Freshers Recruitment | Service Desk Associate | Bangalore"},{"Job Location":"Hyderabad, Vijayawada\n","Salary":"Rs. 1,25,000 – 2,25,000\/- per annum\n","Navigation":"transdyne-freshers-recruitment-process-associate-hyderabad-vijayawada","Eligibility Criteria":"Candidates from any academic background can apply.\nShould have good written English skills.\nAt least two and half year contract is mandatory.\nCan choose to work in Day or Night Shift.\n","About TransDyne IT Services Pvt Ltd":"TransDyne is based in Hyderabad, India. Using our proprietary software and the latest Internet technologies, we have developed a system for transcription that effectively cuts cost and turnaround time while maintaining the highest level of quality and customer service. We add value to our clients through our customized solutions such as electronic letterhead templates and network compatibility.\nSmartTransfer, our custom web based file transfer system with embedded 128 bit encryption programming, allows sending voice files (from a digital recorder) securely over the Internet, 24 hours a day, 7 days a week. Our toll-free telephone system has the same capabilities. Sending dictations and receiving completed transcripts can be done from your home, office or hospital. Our associate company in the United States, TransDyne Inc., markets our products and services and provides customer support in the United States & Canada. Company Website: www.transdyne.in.\n","Job Category":"BPO\n","Job Description":"TransDyne is hiring Freshers with an option to work from any of our offices in Hyderabad (Punjagutta\/Secunderabad) and Vijayawada, or can opt for Work From Home.\nWe provide all the training required for the job.\n","Date":"20-Sep-2020","No.of Openings":"50\n","Company Name":"TransDyne\n","Perks and Benefits":"Plus incentives, Free Training with Performance Based Stipend during training.\n","Experience":"Freshers\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-work-from-home-jobs-for-freshers-transdyne-it-services-pvt-ltd-hyderabad-secunderabad-vijayawada-0-to-0-years-170620005468?src=jobsearchDesk&sid=15933750632159988_2&xp=7&px=1 - ","Job Position":"Process Associate, Process Specialist (Work From Home)\n","Summary":"TransDyne Freshers Recruitment in Hyderabad and Vijayawada For Process Associate Position. Any Graduate, Post Graduate Freshers are eligible to apply for this job. More details regarding TransDyne Freshers Job Openings is given below.","postTitle":"TransDyne Freshers Recruitment | Process Associate | Hyderabad, Vijayawada"},{"Job Location":"Chennai\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"changepond-technologies-freshers-walkin-software-trainee-24th-to-25th-september-2020-chennai","Eligibility Criteria":"Fresher’s only.\nGraduates with an aggregate of minimum 60% in Academics.\nMandate: Java\/.Net Certification from any Training Institute\nGood communication Skills.\n","Walkin Time":"9.30 AM to 12.30 PM\n","Job Category":"IT | Software\n","Job Description":"Changepond Technologies is Hiring Engineering graduates – Freshers For Trainee Position.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"20\n","Year of Passing":"2017, 2018, 2019\n","Walkin Date":"24tth, 25th September 2020\n","Company Name":"Changepond Technologies\n","Walkin Venue":"Changepond Technologies, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai – 603 103. Land Mark: Opposite to TCS 2nd Gate\nContact Person: Kalaiselvan R (HR)\nCompany Website: www.changepond.com\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-engineering-graduates-fresher-s-for-changepond-technologies-changepond-technologies-private-limited-chennai-0-to-1-years-210920002968?src=jobsearchDesk&sid=16007227599368720_2 - ","Job Position":"Software Trainee (.NET\/Java)\n","Summary":"Changepond Technologies Freshers Walkin Drive in Chennai For Software Trainee Position. BE, BTech, MCA Graduates 2017, 2018, 2019 are eligible for this walkin. More details regarding Changepond Technologies Chennai Freshers Walkin is given below.","postTitle":"Changepond Technologies Freshers Walkin | Software Trainee | 24th to 25th September 2020 | Chennai"},{"Job Location":"Bangalore\n","Navigation":"accenture-recruitment-service-desk-voice-support-0-2-years-bangalore","Job Category":"BPO\n","Job Description":"You will be aligned with our Customer Support vertical and help us in managing\/ resolving customers query, handling escalations and complaints of the dissatisfied customers & giving best resolutions.\nYou will also be responsible for closing the fault and complaints within SLA’s.\nYou will be working as a part of Query Management team which is accountable for the Inbound\/Outbound calls and e-mail\/chat support to resolve customer issue.\nIn Service Desk Voice Support team you will be responsible to perform day to day operations while maintaining SLA’s & solve queries related to disputes and coordinating with customer.\nYou will be recording, diagnosing, troubleshooting, resolving or assigning incidents and service requests based on defined scope of support.\nYou will have to manage unplanned interruptions to restore normal service operations as quickly as possible for voice interactions.\nGood to have skills: Good communication skills, Effectively collaboration and team work, Adaptable and flexible, Interpersonal skills, Time Management.\n","Date":"20-Sep-2020","Job Responsibilities":"In this role you are required to solve routine problems, largely through precedent and referral to general guidelines.\nInteraction is within own team and direct supervisor.\nDetailed instructions on all tasks will be provided at this role with close supervision.\nDecisions made impact own work and are closely supervised.\nIndividual contributor as a part of a team with a predetermined, narrow scope of work.\nPlease note that this role may require you to work in rotational shifts.\n","Company Name":"Accenture\n","Experience":"0 to 2 years\n","Qualification":"Any Graduation\/Under Graduate\/Diploma in Any Discipline\n","How To Apply":"https:\/\/www.accenture.com\/in-en\/careers\/jobdetails?id=42273_india_2 - ","Job Position":"Query Management – Service Desk Voice Support\n","Summary":"Accenture Recruitment in Bangalore For Service Desk Voice Support. Diploma, Under Graduate, Any Graduates are eligible to apply for this job. More details regarding Accenture Bangalore Job Openings is given below.","postTitle":"Accenture Recruitment | Service Desk Voice Support (0-2 years) | Bangalore","Job Designation":"Associate\n"},{"Job Location":"Across India\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"thyrocare-technologies-freshers-recruitment-business-development-executive-across-india","Eligibility Criteria":"Freshers.\nGraduate\/Pursuing Graduation.\nGood written and verbal communication skill.\nShould know English and additional one Regional language.\nMust have system and internet connectivity at home.\n","Job Description":"Work Locations: Hyderabad, Bengaluru, Chennai, Delhi NCR, Mumbai, Bhubaneshwar, Ahmedabad, Kochi, Kolkata.\n","Benefits":"Work From Home opportunity.\nFull time payroll job.\nMonthly allowance for internet connectivity.\n","Date":"23-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"Procure network members viz; hospital, laboratory, polyclinics that associates with the company to ensure pan-India presence and service.\nEnhance B2B business for company.\nIdentify new sales opportunities within existing association by up-selling and cross-selling.\nImplementing the company strategy across all the territory.\n","Company Name":"Thyrocare Technologies\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-thyrocare-technologies-ltd-chennai-bhubaneshwar-delhi-ncr-mumbai-ahmedabad-bengaluru-bangalore-ernakulam-kochi-cochin-hyderabad-secunderabad-kolkata-0-to-1-years-220920001050?src=jobsearchDesk&sid=1600806475101972_6 - ","Job Position":"Business Development Executive\n","Summary":"Thyrocare Technologies Freshers Recruitment Across India For Business Development Executive Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Thyrocare Technologies Freshers Job Openings is given below.","postTitle":"Thyrocare Technologies Freshers Recruitment | Business Development Executive | Across India"}]}