{"jobs":[{"Job Location":"Chennai\n","Salary":"Rs. 1,25,000 – 3,00,000\/- per annum\n","Navigation":"avasoft-recruitment-trainee-software-test-engineer-0-1-year-chennai","Eligibility Criteria":"Graduation: Any (Arrears candidates are fine as well).\nExperience: Nil – 1 year in Software Testing (Manual Preferred).\nCandidates with certification\/Internship\/Training in Software Testing is preferred.\n","Job Category":"IT | Software\n","Date":"16-Sep-2020","No.of Openings":"40\n","Company Name":"AVASOFT\n","Experience":"0 to 1 year\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-trainee-software-test-engineer-avasoft-chennai-0-to-1-years-030920003673?xp=22 - ","Desired Skills":"Should have good understanding of SDLC and STLC.\nShould have basic knowledge on Testing types and concepts.\nShould understand software requirements and write test case & scripts.\nBasic understanding of defect life cycle.\nBelief in process, defect prevention and early defect identification.\nShould have good communication skill.\n","Job Position":"Trainee Software Test Engineer\n","Summary":"AVASOFT Recruitment in Chennai For Trainee Software Test Engineer Position. Any Graduates are eligible to apply for this job. More details regarding AVASOFT Chennai Job Openings is given below.","postTitle":"AVASOFT Recruitment | Trainee Software Test Engineer (0-1 year) | Chennai","About AVASOFT":"AVASOFT is a NextGen product company accelerating the digital transformation of corporations and consumers leveraging modern workplace, data science, mobility, and cloud. We are based out of Pennsylvania with offices in Malaysia and India. Our products are developed with scalability as top of mind to deal with continuous enhancements and customizations that have helped us address our customer’s business needs more accurately within timelines. Highly experienced leadership with extensive Fortune 500 experience in leading and delivering large technology initiatives.\nThe genesis of AVASOFT and its central vision & philosophy is about “transforming business by harnessing Innovation and Efficiency”. The Innovation manifests in creating solution frameworks when the business problem is new, niche and challenging and in refining the solution framework on subsequent engagements. This product and framework philosophy has resulted in our large set of reusable products and solutions, which ensures our cost to delivery ratio being the best in the industry with an enviable track record of 100% on time delivery all along. AVASOFT’s experience in developing large enterprise products shows in the way we deliver custom solutions too. We have our unique WYSIWYG (What You See Is What You Get) approach to delivery, which has been fundamental to our success as it eschews deliverable communicate externally and internally. Our tried and tested support models is based on a judicious blend of next generation automation and good old support process. This helps to reduce our customer’s TCO year on year as it relies on robust collaborative knowledge management and reusable framework based environment.\nTypically our engagements start with a Business consultancy or enterprise assessment that leads to a technology solution that we deliver end to end. AVASOFT’s knowledge includes managing and delivering various market leading applications which were recognized and awarded by the industry.\nAt AVASOFT we have worked with more than 150+ Customers across the globe in these 10+ years on Products, Solutions and Support areas. Most of our clients are repeat customers, the best testament to AVASOFT team’s quality of work and business maturity. Company Website: www.avasoft.com.\n"},{"Job Location":"Bangalore\n","Job Requirements":"Good understanding of Security, LAN\/WAN topologies and technologies.\nIn-depth knowledge of OSI Model, TCP\/IP, Network Security basics.\nAbility to work on in a high-level stress and interrupt driven environment\nGood understanding of L2-L7 networking protocols, major Operating Systems such as UNIX \/ Linux\nDemonstrated ability to use in-depth troubleshooting to resolve or workaround customer issues using troubleshooting tools i.e. Wire Shark, Netmon etc.\nRouting and Switching knowledge will be added advantage.\nWilling to work in 24×7 environment in night shifts.\n","Navigation":"sonicwall-freshers-recruitment-graduate-trainee-engineer-intern-bangalore","Eligibility Criteria":"Bachelor’s degree in Computer Science\/Information Sciences\/ Electronic & Communications Engineering\n0 – 1 years networking and network security support experience with solid understanding of LAN\/WAN topologies and technologies.\nIn-depth knowledge of the network protocols: TCP\/IP.\nRouting Protocols like OSPF, RIP, BGP, Firewall, IDS\/IPS will be added advantage.\n","Job Category":"IT | Software\n","Job Description":"SonicWall is looking for Graduates who are comfortable to work in fixed night shifts.\n","Date":"23-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Job Responsibilities":"Responsible for providing technical support across SonicWall product lines via Phone\/Web & Emails in 24x7x365 days environment.\nAssist customers with deployment of SonicWall network security products like Firewall\/IPS and VPN solutions.\nProvide technical solutions and workarounds for end users with their issues on respective product line.\nOwns customer issues from beginning to resolution (handles in place)\nAssists customers by diagnosing problems and providing resolutions for technical and service issues.\nUse troubleshooting techniques and tools to identify products that are defective and follows guidelines in issuing service calls\/contacts.\nAdvises\/educates customers within procedural guidelines to ensure a complete solution to their technical or service questions.\nRecreates, identifies and provides input on unique or recurring customer problems.\nFocuses on delivering a positive customer experience according to SonicWall standards.\nMonitors and tracks issues to ensure accurate resolution.\nCandidate should work closely with the Engineering and other cross functional teams to replicate the issues reported by the customers, validate the bug fixes provided through various patch releases and resolve the customer issues in a professional manner.\nProvide consistent feedback to the team on products supported.\nRemains knowledgeable of SonicWall product line and related industry products and technologies.\n","Company Name":"SonicWall\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"BE\/BTech (CS\/ECE\/IT\/IS)\n","How To Apply":"https:\/\/boards.greenhouse.io\/sonicwall\/jobs\/2347856 - ","Job Position":"Graduate Trainee Engineer (Intern)\n","Summary":"SonicWall Freshers Recruitment in Bangalore As Graduate Trainee Engineer Intern. BE, BTech Freshers 2019, 2020 are eligible to apply for this job. More details regarding SonicWall Bangalore Freshers Job Openings 2020 is given below.","postTitle":"SonicWall Freshers Recruitment | Graduate Trainee Engineer Intern | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,11,473\/- per annum (CTC)\n","Navigation":"virtusa-recruitment-analyst-2018-2019-2020-batch-hyderabad","Eligibility Criteria":"Should sign service agreement of 14 months.\nShould be Open to work in rotational shifts.\nBatch of 2020, if you have cleared final Semester and have mark sheets, then please apply.\n","Job Description":"Review Ads, Search Contents.\nReview Contents given by client – Comments \/ edit.\nReview search contents and classify them as per client guidelines.\n","Date":"22-Sep-2020","No.of Openings":"50\n","Year of Passing":"2018, 2019, 2020 Batch\n","Company Name":"Virtusa\n","Qualification":"BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Analyst-Ads-Curations-jobs-in-Hyderabad-Secunderabad-in-Virtusa-Consulting-Services-Pvt-Ltd-220920600018 - ","Industry Type":"IT-Software – Software Services\n","Desired Skills":"High proficiency in Verbal\/Written English.\nExpert knowledge of MS Excel (analyze and generate reports using Pivot Table, V & H look ups, apply formulaes like sum if, Index, match etc).\nGood working knowledge about Internet.\nAware about how Google search works, good searching skills through use of effective keywords.\nTech Savvy is definitely plus\nFamiliar in searching for goods \/ services \/ ads online.\n","Job Position":"Analyst – Ads Curations\n","Summary":"Virtusa Recruitment in Hyderabad For Analyst Position. BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Virtusa Hyderabad Job Openings is given below.","postTitle":"Virtusa Recruitment | Analyst | 2018, 2019, 2020 Batch | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"oracle-recruitment-applications-developer-0-2-years-bangalore","Eligibility Criteria":"BS degree or equivalent experience relevant to functional area.\n0-2 years of previous software engineering or related experience.\n","Job Category":"IT | Software\n","Job Description":"Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.\nAs a member of the software engineering division, you will develop software according to provided design specifications.\nAnalyze system specifications and existing business processes and information systems.\nBuild enhancements and resolve bugs.\nBuild and execute unit tests and unit test plans.\nWork involves some problem solving with assistance and guidance in understanding and applying company policies and processes.\nGaining competence in own area and acquiring a higher level understanding of role, processes and procedures.\n","Date":"23-Sep-2020","Company Name":"Oracle\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, BS\n","How To Apply":"https:\/\/oracle.taleo.net\/careersection\/2\/jobdetail.ftl?job=20000R8F&tz=GMT%2B05%3A30&tzname=Asia%2FKolkata - ","Job Position":"Applications Developer\n","Note":"Applicants are required to read, write, and speak the following languages: English.\n","Summary":"Oracle Recruitment in Bangalore For Applications Developer Position. BE, BTech, BS Graduates are eligible to apply for this job. More details regarding Oracle Bangalore Job Openings is given below.","postTitle":"Oracle Recruitment | Applications Developer (0-2 years) | Bangalore","Preferred Qualifications":"Software Development & DevOps.\n"},{"Job Location":"Across India (Hyderabad, Bengaluru, Chennai, Delhi NCR)\n","Navigation":"amazon-recruitment-international-voice-support-0-10-years-across-india","Job Category":"BPO\n","Job Description":"The Selling Partner Support (SPS) Associate acts as the primary interface between Amazon and our 3rd party sellers, providing phone and\/or email support governed by internal service level agreements.\nThe SPS associate will be responsible for providing timely and accurate operational support to 3rd party Sellers on the Amazon platform.\nThe successful candidate has an immediate, distinct effect on the experience of customers of Amazon, making a strong record of customer focus a high standard for the role.\nA SPS associate is expected to address chronic system issues, provide process improvements, develop internal documentation, and contribute to a team environment.\nVirtual Contact Center (VCC) associates are expected to work from a home location approved by Amazon for all scheduled hours.\nIt is the responsibility of the associates to ensure uninterrupted internet connectivity and work- like environment at home location so that associates can deliver their best in terms of productivity and quality.\n","Job Type":"Work From Home (WFH)\n","Team Description":"Want to join the Earth’s most customer centric company? Do you like to dive deep to understand problems? Are you someone who like to challenge Status Quo? Do you strive to excel at goals aligned to you? If yes, we have opportunities for you.\nThe Selling Partner Support (SPS) team at Amazon is looking to hire candidates who can excel in a Virtual (Work from Home) Environment.\nThe SPS team acts as the primary interface between Amazon and our 3rd party Sellers and Vendors.\nSellers are our 3P customers that join the ‘Selling on Amazon’ program which in turn enables both individuals and businesses to sell their products and inventory on Amazon Marketplaces.\nWhen one registers as a Vendor, Amazon becomes a full-time distributor of your products.\nWe buy and store the inventory, and take care of everything from shipping and pricing to customer service and returns. India as a region support different marketplaces in India, NA, EMEA & APAC.\n","Date":"16-Sep-2020","Job Responsibilities":"This includes, but is not limited to:\n","Company Name":"Amazon\n","Experience":"0 to 10 years\n","Qualification":"Any Graduation\n","How To Apply":"","Job Position":"International Voice Support\n","Basic Qualifications":"Education: Any Graduation.\nExperience Levels: 0-10 years.\nExcellent: English Communication skills, both written and verbal\nSince the job involves providing support on phone calls, experience in International Voice support in a customer service\/contact center environment would be an advantage\nShifts: The job involves working in a 24\/7 environment including night shifts and the shifts are decided based on the business requirement.\nWeekly Off: Rotational two- consecutive day off (it is a 5-day working week with 2 consecutive days off. During the first four months (Training & Transition) no unplanned leaves are allowed.\nAbility to use a desktop\/Laptop and familiarity with Internet Browsers, Windows OS, Microsoft Outlook and MS Office.\nHome environment free from background noise where you can connect to the internet and work on your deliverable.\nShould have a good internet connection with a minimum speed of 20 MBPS or better and should have at least 100 GB data from a reliable provider.\nShould have access to mobile phone at all times from a reliable provider.\nShould have power back up in case of power shut down.\n","Summary":"Amazon Recruitment Across India For International Voice Support. Any Graduates are eligible to apply for this job. More details regarding Amazon Job Openings Across India is given below.","postTitle":"Amazon Recruitment | International Voice Support (0-10 years) | Across India"},{"Job Location":"Hyderabad\n","Navigation":"amd-freshers-recruitment-intern-hyderabad","Eligibility Criteria":"Good Knowledge on SQL, Power BI, .Net Core, Python and C#.\nGood in Web App Development and Data Analytics\nGood Understanding of Data modelling, Metrics, Data Mining, Querying, Aggregation and Visualization\nKnowledge in web based communication services (REST APIs), SOAP, HTML, CSS, JavaScript, XML and JSON\nClear thinker with superb problem-solving skills\nCurious, self-motivated & a self-starter with a ‘can do attitude’. Comfortable working in fast paced dynamic environment.\nMust be fluent in both written and spoken English\n","Job Category":"IT | Software\n","Job Description":"Our team writes large scale infrastructure and tools in .Net, Python and C++ for Windows and Linux.\nOur software is utilized during all stages of product development across multiple AMD sites and includes distributed automation and build processes, web applications and databases to track millions of records generated by thousands of systems.\nWe are constantly adapting our software development processes to manage the challenges we accept.\nWe are looking for Co-op\/Intern with Data Analysis & Business Intelligence knowledge.\nThe Co-op will work on Business Intelligence projects, as well as design, development and deployment of the automated solutions.\nThe ability to work on Multiple platforms, Problem solving, Analytics skills are critical.\n","Date":"16-Sep-2020","Desired Skills (Not Mandatory)":"Experience in GIT, Jira and Confluence.\nKnowledge on Devops and Open Source Tools.\nKnowledge on Angular, Bootstrap.\n","Company Name":"AMD\n","Experience":"Freshers\n","Qualification":"Final Year Master Degree Student in Computer Science\/IT\/Data Analytics or equivalent (ME, MTech…)\n","How To Apply":"https:\/\/jobs.amd.com\/job\/Hyderabad-Co-Op-Intern%2880248%29-Tela\/675643700\/ - ","Job Position":"Co-Op\/Intern\n","Summary":"AMD Freshers Recruitment in Hyderabad For Intern Position. ME. MTech Freshers are eligible to apply for this job. More details regarding AMD Hyderabad Freshers Job Openings is given below.","postTitle":"AMD Freshers Recruitment | Intern | Hyderabad"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000\/- per annum\n","Contact Person":"HR\nCompany Website:\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"soft-suave-technologies-walkin-full-stack-developer-0-2-years-26th-to-27th-september-2020-bangalore","Walkin Time":"9\n","Job Category":"IT | Software\n","Job Description":"Execute full software development life cycle (SDLC)\nCode, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology.\nDevelop flowcharts, layouts and documentation to identify requirements and solutions\nMaintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes.\nWrite quality and clean code using prescribed specifications.\nEvaluate the interrelationships between programs.\nAnalyze performance of programs and take action to correct deficiencies .\nConfer with users to gain understanding of needed changes or modifications of existing programs.\nResolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"10\n","Year of Passing":"2018, 2019, 2020 batch\n","Walkin Date":"26th, 27th September 2020\n","Company Name":"Soft Suave Technologies\n","Walkin Venue":"Soft Suave Technologies Pvt Ltd, Gayatri Tech Park (4th floor), Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru – 560066.\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-walk-in-bangalore-soft-suave-technologies-private-limited-bengaluru-bangalore-0-to-2-years-190920000575?src=jobsearchDesk&sid=1600548771756218_3 - ","Desired Skills":"Good knowledge in Java, Pyton, Node JS, C++.\nStrong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL.\nLogical and analytical thinking towards the Java programming.\nShould have designed at least one project module using object oriented analysis and design techniques.\nSound knowledge of modern software architecture and development techniques.\nShould be a self initiator and interested in learning new technologies.\n","Job Position":"Full Stack Developer (Trainee Software Engineer – Java, Python, Node JS, C++)\n","Interview Process":"Level 1: Technical Aptitude Test.\nLevel 2: Written Programming Test.\nLevel 3: System Execution of Program.\nLevel 4: HR Interview.\n","Note":"Those who have taken up the interview in last 3 months are not eligible to undergo interview again.\n","Summary":"Soft Suave Technologies Walkin in Bangalore As Full Stack Developer On 26th, 27th September 2020. BE, BTech, ME, MTech, MCA Graduates 2018, 2019, 2020 are eligible for this walkin drive. More details regarding Soft Suave Technologies Bangalore Walkin Drive is given below.","postTitle":"Soft Suave Technologies Walkin | Full Stack Developer (0-2 years) | 26th to 27th September 2020 | Bangalore"},{"Job Location":"PAN India, Delhi NCR, Mumbai, Noida\n","Salary":"Salary 12752\/- per month (80% fixed + 20% variable) + Internet Allowance.\n","Navigation":"tech-mahindra-recruitment-customer-service-associate-0-3-years-across-india","Eligibility Criteria":"Graduate\/Undergraduates both eligible to apply for the position.\nFresher\/Experience both eligible.\n","Job Category":"BPO\n","Job Description":"Permanent Work from Home.\nApplicants Across Pan India can apply.\nImmediate Joining.\n","Date":"16-Sep-2020","No.of Openings":"250\n","Job Responsibilities":"Customer service attitude.\nOutbound calls.\nExcellent Communication skills: Should be able to speak well in English & Hindi.\n24\/7 Rotational Shift, 6 Days working, 1 Rotational Off.\n","Company Name":"Tech Mahindra\n","Experience":"Freshers\/0 to 3 years\n","Qualification":"Any Graduation, Under Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-tech-mahindra-hiring-permanent-work-from-home-tech-mahindra-limited-delhi-ncr-mumbai-noida-0-to-3-years-180820003554?src=jobsearchDesk&sid=15987346357667500_34 - ","Pre-Requisites Model":"Personal Computer or Laptop.\nWorking charger.\nActive camera.\nMobile Phone for call handling \/ Headset including Mic.\nWorking\/Fully functional (in a good condition) asset.\nSystem Config – RAM in Laptop\/Desktop – 4 to 8GB RAM Proceser-I3 and above, 500 GB hard disk (Most suitable for WFH).\nGenuine Windows win 10 (License Version), IE10.\nHigh Speed broadband Connectivity or Wi-Fi\/Dongle.\nMinimum speed requirement is 5 MBPS.\nHands free headset is required.\nRequire Internet Explorer version is 10 or above with .NET framework 4.0 or above.\n","Job Position":"Customer Service Associate\n","Summary":"Tech Mahindra Recruitment For Freshers and Experienced Across India As Customer Service Associate. Its Permanent Work from Home position. Any Graduate, Undergraduates are eligible to apply for this job. More details regarding Tech Mahindra Job Openings is given below.","postTitle":"Tech Mahindra Recruitment | Customer Service Associate (0-3 years) | Across India"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-data-associate-0-3-years-hyderabad","Job Summary":"About the team: The Alexa Data Services (ADS) organization provides data creation, curation, and analytics services to help develop, test, and train the Alexa AI. We work closely with Amazon Machine Learning (ML) Science and modeling teams, providing the critical data they need to improve Alexas speech recognition and language understanding capabilities.\n","Job Description":"We are hiring Data Associates (1 year contract) in our Hyderabad team to undertake labeling functions such as transcription, annotation and dialogue evaluation on speech & text data to assess and improve Alexas performance.\nAs a Data Associate, you will work on speech and text data.\nWe value your high attention to details and your ability to adapt to dynamic changes due to emerging business requirements.\nYou are recognized as a role model for your proactivity in identifying issues with efficiency and accuracy.\n","Date":"23-Sep-2020","Job Responsibilities":"Work with text, speech and other types of data and attach tags to the contents, at scale.\nDeliver high quality of labeled data, leveraging guidelines to meet specific key performance indicators, and using in-house tools and software.\nReport issues with tools and software to the development team when necessary.\nProvide feedback for improvements to existing tooling that can increase labeling throughput and quality.\nMaintain strict confidentiality and follow all applicable Amazon policies for securing confidential information.\nProficiency in English, Hindi grammar and spelling (both written and verbal).\nComfortable working with speech from various dialects and accents of Hindi.\nWillingness and flexibility to work in shifts including night shift etc.\n","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"High School, Diploma, Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-hindi-data-associate-hyderabad-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-3-years-230920001257 - ","Job Position":"Hindi Data Associate\n","Note":"Work Location: Hyderabad (Only candidates currently in Hyderabad are eligible).\nJob Type: Contractual role for 1 year.\n","Basic Qualifications":"High School or Equivalent diploma\nWork Experience: Maximum of 24 months of experience in any industry\nProficient computer skills in MS Office with good typing speed (> 40 wpm and >90% accuracy), including basic troubleshooting with the ability to utilize proprietary tools.\n","Summary":"Amazon Recruitment in Hyderabad For Data Associate Position. High School, Diploma, Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Data Associate (0-3 years) | Hyderabad"},{"Job Location":"Chennai\n","Navigation":"axis-bank-freshers-recruitment-customer-service-officer-2018-2019-batch-chennai","Eligibility Criteria":"Any Full time Post Graduate Willing to work in and around Chennai, Villupuram & Pondicherry can apply.\nPost Graduation – 2018 \/ 2019 Passed Out in Regular Stream Only.\nProfound knowledge on Retail Banking Operations Exposure to Sales is mandate.\nGood communication skills.\nPreferable: AMFI \/ IRDA.\n","Job Description":"Work Locations: Villupuram\/Viluppuram, Pondicherry, Chennai.\n","Bank Name":"Axis Bank\n","Date":"16-Sep-2020","Year of Passing":"2018, 2019 Batch\n","Job Responsibilities":"Conducts outbound marketing calls and scouts for new leads and referrals to generate business.\nResponsible for sales of third-party products (Life Insurance – LI, General Insurance – GI, Mutual Funds – MF, Debit\/ Credit Cards, etc. to the existing customer base.\nResponsible for lead generation for Current Account and Savings Account – CASA to new customers and deepening of account balances for existing customers.\nCustomer Service and Operations: Responsible for timely processing of bank transactions like: Funds transfer Cheques Opening of accounts Reconciliation of office accounts Ensuring timely resolution of customer queries and improving customer service levels.\nCompliance: Compliance to the bank’s rules – internal guidelines, processes and procedures. Responsible for improving the Internal Audit Operational Efficiency score of the branch by timely completion of assigned tasks on continuous basis.\nProtecting bank’s property as per safety norms and ensuring ethical conduct in ordinary course of business.\n","Experience":"Freshers \/ 0 to 1 year\n","Qualification":"MBA\/PGDM, MCA, MCom, MA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-customer-service-officer-am-pg-freshers-full-time-chennai-axis-bank-limited-chennai-pondicherry-villupuram-viluppuram-0-to-1-years-290820001289?xp=5 - ","Job Position":"Customer Service Officer – AM\n","Summary":"Axis Bank Freshers Recruitment in Chennai As Customer Service Officer. MBA, PGDM, MCA, MCom, MA Freshers 2018, 2019 are eligible to apply for this job. More details regarding Axis Bank Chennai Freshers Job Openings is given below.","postTitle":"Axis Bank Freshers Recruitment | Customer Service Officer | 2018, 2019 Batch | Chennai","Job Industry":"Banking\n"},{"Job Location":"Hyderabad\n","Salary":"Rs. 3,60,000\/- per annum\n","Navigation":"achala-it-solutions-freshers-recruitment-sap-abap-developer-hyderabad","Eligibility Criteria":"Computer Science group candidates are preferred.\n0-1 years experience candidates can apply.\nProficient in SAP ABAP – Trained graduates will be preferred.\n","About Achala IT Solutions":"Achala IT Solutions was founded in 2009 currently with more than 300 employees across the globe. Achala is a fast growing technology driven company providing various services in the field of IT. It has been providing high quality services to various customers across the globe. Our main office is located in Hyderabad.\nWe also have our branches in Munch, Germany and US. Currently we are providing IT Services to Sulzer GMBH, BMW, Volkswagen, Audi (Leading Automobile Manufactures in the world) based in Munich, Germany. The team at Achala is talented and has wonderful experience in working with Global customers and in providing quality software and services in the field of Information Technology. Company Website: www.achalasolutions.com\n","Job Category":"IT | Software\n","Date":"16-Sep-2020","Job Responsibilities":"The ideal candidate should be able to deliver strong value from the ABAP, Gateway.\nGood in entire ABAP including ABAP object-oriented programming concepts.\nEffective in executing multiple tasks and assignments ahead of schedule and under budget\nCapable of working independently with minimum direction.\nPreferable Knowledge on development skills involving ABAP\/4 Reports, ABAP Objects, OO ALV, Data Migrations BDC, LSMW , Smart Forms, SAP scripts, Function Modules, ABAP Query, Dialog Programming, User Exits, Screen Painter, Menu Painter, Data Dictionary and Enhancements, BADIs, BAPI, ABAP objects, Class Builder, Roles Authorization, Security User Administration .\nGood Knowledge in creating the Database tables, Secondary Indexes, Table Maintenance Generator, Views, Structures, Data elements, Domains, Search Helps.\nShould have worked in Eclipse ADT tool. skills-Java, Troubleshooting.\nTo take part in software and architectural development activities.\nIdentifying production and non-production application issues.\nDevelop, test, implement and maintain application software.\nRecommend changes to improve established SAP application processes.\nPreferable have Knowledge in use of various SAP R\/3 functionality, ABAP modularization techniques.\nGood Knowledge in Object Oriented Programming OOP’s.\nExcellent analytical, communication and interpersonal skills.\n","Company Name":"Achala IT Solutions\n","Experience":"Freshers\/0 to 1 years\n","Qualification":"BE, BTech, MCA\n","How To Apply":"http:\/\/careers.achalasolutions.com\/fresher-sap-abap-developer-27795\/ - ","Job Position":"SAP ABAP Developer\n","Summary":"Achala IT Solutions Freshers Recruitment in Hyderabad As SAP ABAP Developer. BE, BTech, MCA Freshers are eligible to apply for this job. More details regarding Achala IT Solutions Hyderabad Freshers Job Openings is given below.","postTitle":"Achala IT Solutions Freshers Recruitment | SAP ABAP Developer | Hyderabad"},{"Job Location":"Chennai\n","Navigation":"integra-software-freshers-recruitment-testing-trainee-chennai","Eligibility Criteria":"Any Graduates from Computer background.\nShould have knowledge in manual testing and accessibility testing.\nMust have good communication skills.\nShould have eye to details.\n","Job Category":"IT | Software\n","About Integra Software Services Pvt Ltd":"At Integra, we are at our best when we are crafting content and digital transformation solutions for our customers through our innovative source-to-publish workflow offerings, and digital learning solutions across diverse industry verticals. With our leadership and expertise in end-to-end digital content solutions, content-focused technologies, and workflow solutions, we adeptly help our global publishing customers maximize ‘return on content production investments’ and focus on what they do best – publish great content products for their customers.\nWe work with many of world’s leading publishers across segments – Academic, Higher-Ed, ELT, and PreK-12 – many of whom we pride ourselves on more than a decade of working relationship. This longstanding relationship is a witness to our capabilities in delivering measurable business results through content solutions that improve publishing cycle times, boost productivity, and navigate through technology disruptions.\nDrawing on our sectoral know-how and vast experience in developing learning content and designing interactive learning, we also provide digital learning solutions to our customers in the education and enterprise segments. Today, we are one of the early movers in providing digital content development solutions in emerging disruptive content technologies like Augmented Reality, Virtual reality, and Mixed Reality. We are always at the ready to help our customers leverage technology to the benefit of their existing business and adding value to their end users.\nHeadquartered in Pondicherry, India, each day, 2000+ talented workforce work from ten delivery centers across six countries – India (Bangalore, Chennai, Delhi, Pune, and Pondicherry), Japan (Yokohama), UK (Reading), US (Illinois), Canada (Richmond) and Germany (Munich) – round the clock in meeting and exceeding our customers’ content and digital solutions needs. Company Website: www.integra.co.in.\n","Date":"16-Sep-2020","No.of Openings":"20\n","Job Responsibilities":"Will be responsible to test different projects to find bugs.\nWill be responsible to identify and analyze problems.\nAble to understanding QA standards and procedures.\nReview the courses, content validation and Graphic User Interface(GUI), performing Functionality Integration(FUI).\n","Company Name":"Integra Software Services Pvt Ltd\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"BE, BTech, ME, MTech, MCA, MSc (Computers)\n","How To Apply":"http:\/\/careers.integra.co.in\/job-listings-fresher-openings-for-quality-assurance-testing-trainee-integra-software-services-pvt-ltd-chennai-0-to-1-years-170820003871?xp=3 - ","Job Position":"Quality Assurance \/ Testing Trainee\n","Summary":"Integra Software Freshers Recruitment in Chennai As Testing Trainee. BE, BTech, ME, MTech, MCA, MSc Freshers are eligible to apply for this job. More details regarding Integra Software Chennai Freshers Job Openings is given below.","postTitle":"Integra Software Freshers Recruitment | Testing Trainee | Chennai"},{"Job Location":"Chennai\n","Navigation":"zoho-corporation-recruitment-technical-support-engineer-0-2-years-chennai","Eligibility Criteria":"Proficiency in English.\nAttention to detail and a strong desire to learn.\nAbility to work independently and deliver value to the customers and the company.\nShould be willing to work in night shifts.\nMust be interested in the accounting and finance side.\n","Job Category":"IT | Software\n","Job Description":"Answering customer queries through phone, e-mail & chat about product features and capabilities.\nHelping customers with basic troubleshooting, configuration difficulties and advanced technical issues in the product by working closely with the development team.\nPrompt communication of customer requirements to the development team.\nFacilitate with product demos, implementations and training.\n","Date":"23-Sep-2020","Year of Passing":"2018, 2019, 2020\n","Company Name":"Zoho Corporation\n","Experience":"0 t o 2 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/careers.zohorecruit.com\/recruit\/WebFormServeServlet?rid=162060bf19ef5bfd9c408621bb66328b6c49a8d3a80058b2d65120b6b5591867gidf62d65585721aed69c3d0236e3a70183 - ","Job Position":"Technical Support Engineer\n","Note":"If you have attended the written test \/ Interview with ZOHO anytime in the past 3 months, you should not attend this test.\nStudents who are graduating in 2021 are not eligible to apply this form.\n","Summary":"Zoho Corporation Recruitment in Chennai For Technical Support Engineer Position. Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Zoho Corporation Chennai Job Openings is given below.","postTitle":"Zoho Corporation Recruitment | Technical Support Engineer (0-2 years) | Chennai"},{"Job Location":"Hyderabad\n","Salary":"Rs. 1,00,000 – 4,00,000\/- per annum\n","Navigation":"unisys-freshers-recruitment-service-desk-associate-hyderabad","Eligibility Criteria":"Any Freshers with good communication Skills can apply.\nMinimum Qualification Required: Any Bachelor’s Degree \/ Graduate.\n","Job Category":"BPO\n","Job Description":"Unisys is hiring Technical Support Associate Fresher (International Voice Process).\nThe primary role of a service desk associate is to answer customer requests for assistance by email, chat, web or over the phone.\nThis role is crucial to ensuring customer requirements are met in terms of communication, prioritizing, escalating and resolving incidents and requests.\n","Date":"16-Sep-2020","Job Responsibilities":"Takes end to end Ownership of End User Issues till resolution and follow up as mandated by the process requirements.\nApplies basic diagnostic techniques to identify problems, investigate causes and recommend solutions to correct common failures.\nEscalates complex problems to the Remote Support Engineering staff or Field Engineering.\nTypically provides technical support for Internal and External customers.\nEscalates complex problems to higher level of expertise within organization.\nResponsible for providing the first-line of after-sales telephone technical support of hardware, Operating Systems, sub-systems and\/or applications for customers and\/or employees.\n","Company Name":"Unisys\n","Experience":"Freshers\n","Qualification":"BE, BTech, Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-unisys-hiring-service-desk-associate-fresher-voice-process-unisys-india-pvt-ltd-hyderabad-secunderabad-0-to-0-years-150920002703?src=jobsearchDesk&sid=16002005513685199_2 - ","Desired Skills":"Excellent verbal and written communication.\nWillingness and ability to work in shifts (24×7).\nGood Knowledge On Operating Systems, Hardware, Networking and MS Applications.\nGood knowledge of Microsoft Office Suite (Word, Excel, Outlook etc).\nMultitasking and coordination skills.\nTeam Player.\nExcellent judgment skills to be able to properly evaluate situations and immediately provide effective solutions.\n","Job Position":"Service Desk Associate \/ Technical Support Associate\n","Summary":"Unisys Freshers Recruitment in Hyderabad For Technical Support Position. BE, BTech, Any Graduate, Post Graduate Freshers are eligible to apply for this job. More details regarding Unisys Hyderabad Freshers Job Openings is given below.","postTitle":"Unisys Freshers Recruitment | Service Desk Associate | Hyderabad"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,25,000 – 3,50,000\/- per annum\n","Navigation":"amiti-software-technologies-freshers-recruitment-java-developer-bangalore","Eligibility Criteria":"Strong Java programming skills\nExcellent knowledge building scalable web applications\nProficient with JDBC, Spring, Servlet and JSP\nExcellent experience with Oracle RDBMS and SQL queries\nGood experience with Tomcat, JBoss, J2EE, JSP\/JSF\nExperience with Spring Framework, JMS, iBATIS, Hibernate.\nGood knowledge of Relational DB design and Object Oriented design.\nExcellent Communication & interpersonal Skills; Team Player.\nExcellent benefits such as fully paid technical courses and certifications such as Java Certification.\n","Job Category":"IT | Software\n","Job Description":"Amiti Software Technologies is hiring Freshers as Java Developer.\nLooking for candidates who can join us immediately or with a Notice period upto 15 days.\n","Date":"17-Sep-2020","No.of Openings":"5\n","Year of Passing":"2019, 2020 Passouts\n","Company Name":"Amiti Software Technologies Pvt Ltd\n","Experience":"Freshers\n","Qualification":"BE\/BTech (CS, IT), MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-opening-for-the-position-of-java-developer-freshers-amiti-software-technologies-private-limited-bengaluru-bangalore-0-to-0-years-190620005825?src=jobsearchDesk&sid=15925997673262463_2&xp=7&px=1 - ","About Amiti Software Technologies":"Amiti was founded in June 2003 as a private limited company. We are building an excellent reputation for delivering results oriented towards increasing the efficiency of our clients.\nWe guide our clients in choosing their offshore strategy and execute them according to the agreed upon plan. Company Website: www.amiti.in.\n","Job Position":"Java Developer\n","Note":"No physical presence required.\nAll the process from interview to selection will be online.\n","Summary":"Amiti Software Technologies Freshers Recruitment in Bangalore for Java Developer position. BE, BTech, MTech, MCA Freshers 2019, 2020 are eligible for this role. More details regarding Amiti Software Technologies Bangalore Freshers Job Openings is given below.","postTitle":"Amiti Software Technologies Freshers Recruitment | Java Developer | Bangalore"},{"Job Location":"Hyderabad\n","Navigation":"smartnet-it-solutions-freshers-recruitment-trainee-java-developer-hyderabad","Eligibility Criteria":"Fresh Collage Engineering Graduate (Any Stream).\nGood verbal communication skills must.\nTeam Player. Can coordinate internally with team well.\nWilling to work on Night Shift \/ Morning Shift\n","Job Category":"IT | Software\n","Job Description":"Trainee Java engineer with good technical knowledge and passion for technologies.\nYou will be part of cross-functional team and will meet\/understand the product\/customer requirements.\nYou will be initially working on Change Requests and basic bug fixing activities.\n","Date":"16-Sep-2020","Company Name":"SmartNet IT Solutions\n","About SmartNet IT Solutions":"SmartNet IT Solutions has its headquarters in Hyderabad,INDIA delivering the SPLAN products across the INDIAN Market. Splan is a California based company, specializing in providing next generation cloud software check-in solutions for Visitors, Events and Schools. Splan uniquely delivers an intelligent and fully automated solution for small to large enterprises. Splan is committed to deliver the most innovative security solutions, which are cost effective, easy to use, enterprise-centric and web-based.\nOur mobile KIOSK solution will take care of all your secure check-in and personal tracking needs. At SmartNet IT Solutions, we provide in person service, manage your account, handhold you through the process to ensure that you get the best out of every feature you have. Should you need a bit of customisation to make Splan work better for you, SmartNet IT Solutions is here to get that done. We endeavour to extend business automation solutions that simplify processes, save time and cost and improve people’s experiences. Company Website: www.smartnetsol.com.\n","Experience":"Freshers\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-trainee-java-developer-smartnet-it-solutions-ap-private-limited-hyderabad-secunderabad-0-to-1-years-290820500543?src=jobsearchDesk&sid=15987346357667500_5 - http:\/\/www.smartnetsol.com\/careers.html - ","Desired Skills":"He\/She should be flexible for 24\/7 rotational shifts\nKnowledge of developing applications based on Object Oriented Methodologies.\nThe candidate should have strong Core JAVA concepts.\nGood Understanding on technologies like Core Java, Servlets, JSP, JDBC, Hibernate and Struts.\nMust have strong Object-oriented design and programming skills.\nShould possess strong analytical, communication and interpersonal skills and should be a quick learner.\n","Job Position":"Trainee Java Developer\n","Summary":"SmartNet IT Solutions Freshers Recruitment in Hyderabad As Trainee Java Developer. BE, BTech Freshers are eligible to apply for this job. More details regarding SmartNet IT Solutions Hyderabad Freshers Job Openings is given below.","postTitle":"SmartNet IT Solutions Freshers Recruitment | Trainee Java Developer | Hyderabad"},{"Job Location":"Chennai\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"changepond-technologies-freshers-walkin-software-trainee-24th-to-25th-september-2020-chennai","Eligibility Criteria":"Fresher’s only.\nGraduates with an aggregate of minimum 60% in Academics.\nMandate: Java\/.Net Certification from any Training Institute\nGood communication Skills.\n","Walkin Time":"9.30 AM to 12.30 PM\n","Job Category":"IT | Software\n","Job Description":"Changepond Technologies is Hiring Engineering graduates – Freshers For Trainee Position.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"20\n","Year of Passing":"2017, 2018, 2019\n","Walkin Date":"24tth, 25th September 2020\n","Company Name":"Changepond Technologies\n","Walkin Venue":"Changepond Technologies, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai – 603 103. Land Mark: Opposite to TCS 2nd Gate\nContact Person: Kalaiselvan R (HR)\nCompany Website: www.changepond.com\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-engineering-graduates-fresher-s-for-changepond-technologies-changepond-technologies-private-limited-chennai-0-to-1-years-210920002968?src=jobsearchDesk&sid=16007227599368720_2 - ","Job Position":"Software Trainee (.NET\/Java)\n","Summary":"Changepond Technologies Freshers Walkin Drive in Chennai For Software Trainee Position. BE, BTech, MCA Graduates 2017, 2018, 2019 are eligible for this walkin. More details regarding Changepond Technologies Chennai Freshers Walkin is given below.","postTitle":"Changepond Technologies Freshers Walkin | Software Trainee | 24th to 25th September 2020 | Chennai"},{"Job Location":"Bangalore\n","Navigation":"iqvia-freshers-recruitment-production-support-btech-bca-mca-bangalore","Job Description":"Provide client support, managing clients expectations. Primary duties include supporting a wide range of IQVIA products and services for both internal and external clients.\nSupport hours is 24\/5 with logins from 5.30 AM to 9.00 PM via phone and email.\n","Date":"16-Sep-2020","About IQVIA":"IQVIA™ is the leading human data science company focused on helping healthcare clients find unparalleled insights and better solutions for patients.\nFormed through the merger of IMS Health and Quintiles, IQVIA offers a broad range of solutions that harness the power of healthcare data, domain expertise, transformative technology, and advanced analytics to drive healthcare forward. Company Website: www.iqvia.com.\n","Year of Passing":"2018, 2019 Batch\n","Job Responsibilities":"Understand client request for access to the IQVIA products on the customer portal and ensure that these are provisioned based on the assignment guidelines.\nRespond in a highly professional manner to all customer queries and problems via phone and emails and, liaising with relevant areas of the business.\nProvide timely updates where appropriate on issues via email and tickets.\nEnsure customers are appropriately informed of any delivery delays or errors and kept advised of progress and actions being taken.\nPerform basic troubleshoot on browser and customer portal issues to ensure product access is enabled to the client.\nEnsure any Service Level Agreements are honored to required quality and support standards.\nProvide an in-depth understanding of the IQVIA service offerings, with the ability to produce ad-hoc studies on demand.\nProvide support to other teams as appropriate or directed.\nWillingness to work in any assigned shift across the 24\/5 coverage.\n","Company Name":"IQVIA\n","Experience":"Freshers\n","Qualification":"BTech, BCA, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-iqvia-hiring-for-freshers-b-tech-bca-mca-bangalore-ims-health-analytics-services-private-limited-bengaluru-bangalore-0-to-0-years-160920005338?src=jobsearchDesk&sid=16002854691517235_20 - ","Job Position":"Production Support\n","Summary":"IQVIA Freshers Recruitment in Bangalore For Production Support. BTech, BCA, MCA Freshers 2018, 2019 are eligible to apply for this job. More details regarding IQVIA Bangalore Freshers Job Openings is given below.","postTitle":"IQVIA Freshers Recruitment | Production Support | BTech, BCA, MCA | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"abb-freshers-recruitment-power-bi-specialist-be-btech-me-mtech-bangalore","Eligibility Criteria":"Qualified BE\/BTech or Higher degree.\nKnowledge on BI tools & reporting.\nStrong Verbal and Written Communication.\n","Job Category":"IT | Software\n","Benefits":"Childcare\nTransportation\nMedical insurance\n","Date":"16-Sep-2020","About ABB":"ABB is a leading global engineering company that energizes the transformation of society and industry to achieve a more productive, sustainable future. By connecting software to its electrification, robotics, automation and motion portfolio, ABB pushes the boundaries of technology to drive performance to new levels. With a history of excellence stretching back more than 130 years, ABB’s success is driven by 110,000 talented employees in over 100 countries. Company Website: www.abb.com.\n","Job Responsibilities":"Developing and implementing BI through working in Agile teams.\nDeveloping and maintaining processes of automated data and using various business intelligence reporting tools to create dashboards.\nProviding coaching and training support for finance teams and business units for faster adoption of Power BI reports.\nWorking in cross-functional agile scrum teams to deliver visualization dashboards.\nLiving ABB’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business.\n","Company Name":"ABB\n","Experience":"Freshers\n","Qualification":"BE, BTech, ME, MTech\n","How To Apply":"https:\/\/jobs.abb.com\/jobsearch\/index.html?source_info=LinkedIn#\/posting\/IN72808543_E8 - ","Job Position":"Power BI Specialist\n","Summary":"ABB Freshers Recruitment in Bangalore For Power BI Specialist Position. BE, BTech, ME, MTech Freshers are eligible to apply for this job. More details regarding ABB Bangalore Freshers Job Openings is given below.","postTitle":"ABB Freshers Recruitment | Power BI Specialist | BE, BTech, ME, MTech | Bangalore"},{"Job Location":"Across India\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"thyrocare-technologies-freshers-recruitment-business-development-executive-across-india","Eligibility Criteria":"Freshers.\nGraduate\/Pursuing Graduation.\nGood written and verbal communication skill.\nShould know English and additional one Regional language.\nMust have system and internet connectivity at home.\n","Job Description":"Work Locations: Hyderabad, Bengaluru, Chennai, Delhi NCR, Mumbai, Bhubaneshwar, Ahmedabad, Kochi, Kolkata.\n","Benefits":"Work From Home opportunity.\nFull time payroll job.\nMonthly allowance for internet connectivity.\n","Date":"23-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"Procure network members viz; hospital, laboratory, polyclinics that associates with the company to ensure pan-India presence and service.\nEnhance B2B business for company.\nIdentify new sales opportunities within existing association by up-selling and cross-selling.\nImplementing the company strategy across all the territory.\n","Company Name":"Thyrocare Technologies\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-thyrocare-technologies-ltd-chennai-bhubaneshwar-delhi-ncr-mumbai-ahmedabad-bengaluru-bangalore-ernakulam-kochi-cochin-hyderabad-secunderabad-kolkata-0-to-1-years-220920001050?src=jobsearchDesk&sid=1600806475101972_6 - ","Job Position":"Business Development Executive\n","Summary":"Thyrocare Technologies Freshers Recruitment Across India For Business Development Executive Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Thyrocare Technologies Freshers Job Openings is given below.","postTitle":"Thyrocare Technologies Freshers Recruitment | Business Development Executive | Across India"}]}