{"jobs":[{"Job Location":"Chennai\n","Navigation":"amazon-recruitment-support-engineer-intern-chennai","Eligibility Criteria":"Candidates must be in Bachelor or Master Course in Computer Science or Engineering or related field.\nExcellent problem solving skills.\nPossess understanding of areas in the basic areas of Computer Science such as Algorithms, Data Structures, Object Oriented Design, Databases.\nBe able to write Amazon quality code in an object oriented language – preferably in C\/C++\/Java in a Linux environment.\nCandidate must have good written and oral communication skills, be a fast learner and have the ability to adapt quickly to a fast-paced development environment.\n","Job Category":"IT | Software\n","Job Description":"Support Engineer Intern will be responsible for TT resolution \/ root cause fixes, ensuring availability, sufficient metrics \/ monitors \/ alarms, maintenance and bug fixes \/ minor enhancements of APP services, , applications and tools.\n","Date":"21-Sep-2020","Company Name":"Amazon\n","Experience":"Freshers\n","Qualification":"BE, BTech, ME, MTech, MCA, MSc (Computers)\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/1279064\/support-engineer-intern - ","Job Position":"Support Engineer Intern\n","Summary":"Amazon Recruitment in Chennai For Support Engineer Intern Position. BE, BTech, ME, MTech, MCA, MSc Graduates are eligible to apply for this Job. More details regarding Amazon Chennai Job Openings is given below.","postTitle":"Amazon Recruitment | Support Engineer Intern | Chennai"},{"Job Location":"Mumbai\n","Job Requirements":"Experience in working with distributed environments.\nExcellent communication and teamwork skills.\nGreat attention to detail.\nOrganizational skills.\nPerform unit testing and participate in design and code-review process.\n","Navigation":"servosys-solutions-recruitment-software-engineer-trainee-java-mumbai","Eligibility Criteria":"Minimum 60% marks throughout academic standard.\n","Technical Skills":"Knowledge of Core Java, JSP, Servlets and Database.\nKnowledge of java frameworks such as spring, Hibernate.\nKnowledge of multiple front-end languages and libraries (e.g. HTML CSS, JavaScript, XML, jQuery).\nKnowledge of multiple back-end languages (e.g. Java) and JavaScript frameworks (e.g. Angular, React, Node.js).\nFamiliarity with databases (e.g. MySQL, Oracle), web servers (e.g. Apache) and UIUX design.\nExperience developing desktop and mobile applications.\nFamiliarity with common stacks.\nDeep functional knowledge or hands on design experience with Web Services (SOAP & REST).\n","Job Category":"IT | Software\n","Job Description":"Looking for a talented full stack developer who is proficient in Java JavaScript. Your primary focus will be developing user interface components and implementing them following well-known workflows.\nYou will ensure that these components and the overall application are robust and easy to maintain.\nYou will coordinate with the rest of the team working on different layers of the infrastructure.\nTherefore, a commitment to collaborative problem solving, sophisticated design, and quality product is important.\nYou will work in modern enterprise web stack with a growing development team.\n","Date":"21-Sep-2020","Job Responsibilities":"Responsible for development of new highly-responsive, web-based user interface.\nWork independently and collaborate with the rest of the development team.\nWrite clean, robust code backed by automated unit tests with full coverage.\nEvaluate and recommend software components and practices to help keep the product competitive.\nWork with product team and UIUX designers.\nLearn and understand user interactions.\nDevelop a flexible and well-structured front and back end architecture.\n","Company Name":"Servosys Solutions\n","Experience":"0 to 1 year\n","Qualification":"BTech (CSE, IT), MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-software-engineer-trainee-java-spring-hibernate-servosys-solutions-pvt-ltd-mumbai-0-to-1-years-100720903935?src=jobsearchDesk&sid=16006242746066045_5 - ","Job Position":"Software Engineer Trainee (Java\/Spring\/Hibernate)\n","Interview Process":"Technical Interview.\nTechno Managerial Interview.\nHR Round.\n","Summary":"Servosys Solutions Recruitment in Mumbai As Software Engineer Trainee. BTech, MCA Graduates are eligible for this job. More details regarding Servosys Solutions Mumbai Job Openings is given below.","postTitle":"Servosys Solutions Recruitment | Software Engineer Trainee (Java) | Mumbai"},{"Job Location":"Bangalore\n","Job Requirements":"Good understanding of Security, LAN\/WAN topologies and technologies.\nIn-depth knowledge of OSI Model, TCP\/IP, Network Security basics.\nAbility to work on in a high-level stress and interrupt driven environment\nGood understanding of L2-L7 networking protocols, major Operating Systems such as UNIX \/ Linux\nDemonstrated ability to use in-depth troubleshooting to resolve or workaround customer issues using troubleshooting tools i.e. Wire Shark, Netmon etc.\nRouting and Switching knowledge will be added advantage.\nWilling to work in 24×7 environment in night shifts.\n","Navigation":"sonicwall-freshers-recruitment-graduate-trainee-engineer-intern-bangalore","Eligibility Criteria":"Bachelor’s degree in Computer Science\/Information Sciences\/ Electronic & Communications Engineering\n0 – 1 years networking and network security support experience with solid understanding of LAN\/WAN topologies and technologies.\nIn-depth knowledge of the network protocols: TCP\/IP.\nRouting Protocols like OSPF, RIP, BGP, Firewall, IDS\/IPS will be added advantage.\n","Job Category":"IT | Software\n","Job Description":"SonicWall is looking for Graduates who are comfortable to work in fixed night shifts.\n","Date":"23-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Job Responsibilities":"Responsible for providing technical support across SonicWall product lines via Phone\/Web & Emails in 24x7x365 days environment.\nAssist customers with deployment of SonicWall network security products like Firewall\/IPS and VPN solutions.\nProvide technical solutions and workarounds for end users with their issues on respective product line.\nOwns customer issues from beginning to resolution (handles in place)\nAssists customers by diagnosing problems and providing resolutions for technical and service issues.\nUse troubleshooting techniques and tools to identify products that are defective and follows guidelines in issuing service calls\/contacts.\nAdvises\/educates customers within procedural guidelines to ensure a complete solution to their technical or service questions.\nRecreates, identifies and provides input on unique or recurring customer problems.\nFocuses on delivering a positive customer experience according to SonicWall standards.\nMonitors and tracks issues to ensure accurate resolution.\nCandidate should work closely with the Engineering and other cross functional teams to replicate the issues reported by the customers, validate the bug fixes provided through various patch releases and resolve the customer issues in a professional manner.\nProvide consistent feedback to the team on products supported.\nRemains knowledgeable of SonicWall product line and related industry products and technologies.\n","Company Name":"SonicWall\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"BE\/BTech (CS\/ECE\/IT\/IS)\n","How To Apply":"https:\/\/boards.greenhouse.io\/sonicwall\/jobs\/2347856 - ","Job Position":"Graduate Trainee Engineer (Intern)\n","Summary":"SonicWall Freshers Recruitment in Bangalore As Graduate Trainee Engineer Intern. BE, BTech Freshers 2019, 2020 are eligible to apply for this job. More details regarding SonicWall Bangalore Freshers Job Openings 2020 is given below.","postTitle":"SonicWall Freshers Recruitment | Graduate Trainee Engineer Intern | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,11,473\/- per annum (CTC)\n","Navigation":"virtusa-recruitment-analyst-2018-2019-2020-batch-hyderabad","Eligibility Criteria":"Should sign service agreement of 14 months.\nShould be Open to work in rotational shifts.\nBatch of 2020, if you have cleared final Semester and have mark sheets, then please apply.\n","Job Description":"Review Ads, Search Contents.\nReview Contents given by client – Comments \/ edit.\nReview search contents and classify them as per client guidelines.\n","Date":"22-Sep-2020","No.of Openings":"50\n","Year of Passing":"2018, 2019, 2020 Batch\n","Company Name":"Virtusa\n","Qualification":"BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Analyst-Ads-Curations-jobs-in-Hyderabad-Secunderabad-in-Virtusa-Consulting-Services-Pvt-Ltd-220920600018 - ","Industry Type":"IT-Software – Software Services\n","Desired Skills":"High proficiency in Verbal\/Written English.\nExpert knowledge of MS Excel (analyze and generate reports using Pivot Table, V & H look ups, apply formulaes like sum if, Index, match etc).\nGood working knowledge about Internet.\nAware about how Google search works, good searching skills through use of effective keywords.\nTech Savvy is definitely plus\nFamiliar in searching for goods \/ services \/ ads online.\n","Job Position":"Analyst – Ads Curations\n","Summary":"Virtusa Recruitment in Hyderabad For Analyst Position. BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Virtusa Hyderabad Job Openings is given below.","postTitle":"Virtusa Recruitment | Analyst | 2018, 2019, 2020 Batch | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"oracle-recruitment-applications-developer-0-2-years-bangalore","Eligibility Criteria":"BS degree or equivalent experience relevant to functional area.\n0-2 years of previous software engineering or related experience.\n","Job Category":"IT | Software\n","Job Description":"Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.\nAs a member of the software engineering division, you will develop software according to provided design specifications.\nAnalyze system specifications and existing business processes and information systems.\nBuild enhancements and resolve bugs.\nBuild and execute unit tests and unit test plans.\nWork involves some problem solving with assistance and guidance in understanding and applying company policies and processes.\nGaining competence in own area and acquiring a higher level understanding of role, processes and procedures.\n","Date":"23-Sep-2020","Company Name":"Oracle\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, BS\n","How To Apply":"https:\/\/oracle.taleo.net\/careersection\/2\/jobdetail.ftl?job=20000R8F&tz=GMT%2B05%3A30&tzname=Asia%2FKolkata - ","Job Position":"Applications Developer\n","Note":"Applicants are required to read, write, and speak the following languages: English.\n","Summary":"Oracle Recruitment in Bangalore For Applications Developer Position. BE, BTech, BS Graduates are eligible to apply for this job. More details regarding Oracle Bangalore Job Openings is given below.","postTitle":"Oracle Recruitment | Applications Developer (0-2 years) | Bangalore","Preferred Qualifications":"Software Development & DevOps.\n"},{"Job Location":"Hyderabad\n","Navigation":"anion-healthcare-freshers-recruitment-non-voice-process-hyderabad","Eligibility Criteria":"Candidates with good communication skills (verbal and written).\nGood typing speed.\nKnowledge on Medical Billing \/ US Healthcare will be an added advantage.\n","Job Category":"BPO\n","Job Description":"Anion Healthcare Services is hiring Trainee \/ Fresher For Non Voice Process.\n","Date":"21-Sep-2020","Company Name":"Anion Healthcare Services\n","Experience":"Freshers\n","Qualification":"Any Graduate, Post Graduate\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-opening-for-trainee-or-fresher-non-voice-process-anion-healthcare-services-hyderabad-secunderabad-0-to-1-years-030920001418?src=jobsearchDesk&sid=15991660022224471_2 - ","Job Position":"Non Voice Process\n","Note":"Candidates who are pursuing their graduation or post graduation are not eligible to apply for this opening.\n","About Anion Healthcare Services":"Anion was started by a team of medical and technical experts after understanding the need for back office support services in the healthcare sector. The company has been in business since 1999, offering quality services for Provider Billing, Medical Coding, Collections, Claims Entry & Processing, AR Follow-up, Refunds\/Adjustments, and Patient Statements etc.\nAnion has its roots strongly in the US (in Florida and Massachusetts.) Promoters & Business experts work from these offices interfacing with the clients while all the operational processes happen at the offshore facility based in Hyderabad, India.\nThe promoters carry with them impeccable domain, technical and business expertise. As a team, they have established several enterprises in the healthcare and web technology space successfully. Company Website: www.anion.com.\n","Summary":"Anion Healthcare Services Freshers Recruitment in Hyderabad For Non Voice Process. Any Graduate, Post Graduate Freshers are eligible to apply for this job. More details regarding Anion Healthcare Services Hyderabad Freshers Job Openings is given below.","postTitle":"Anion Healthcare Freshers Recruitment | Non Voice Process | Hyderabad"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000\/- per annum\n","Contact Person":"HR\nCompany Website:\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"soft-suave-technologies-walkin-full-stack-developer-0-2-years-26th-to-27th-september-2020-bangalore","Walkin Time":"9\n","Job Category":"IT | Software\n","Job Description":"Execute full software development life cycle (SDLC)\nCode, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology.\nDevelop flowcharts, layouts and documentation to identify requirements and solutions\nMaintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes.\nWrite quality and clean code using prescribed specifications.\nEvaluate the interrelationships between programs.\nAnalyze performance of programs and take action to correct deficiencies .\nConfer with users to gain understanding of needed changes or modifications of existing programs.\nResolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"10\n","Year of Passing":"2018, 2019, 2020 batch\n","Walkin Date":"26th, 27th September 2020\n","Company Name":"Soft Suave Technologies\n","Walkin Venue":"Soft Suave Technologies Pvt Ltd, Gayatri Tech Park (4th floor), Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru – 560066.\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-walk-in-bangalore-soft-suave-technologies-private-limited-bengaluru-bangalore-0-to-2-years-190920000575?src=jobsearchDesk&sid=1600548771756218_3 - ","Desired Skills":"Good knowledge in Java, Pyton, Node JS, C++.\nStrong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL.\nLogical and analytical thinking towards the Java programming.\nShould have designed at least one project module using object oriented analysis and design techniques.\nSound knowledge of modern software architecture and development techniques.\nShould be a self initiator and interested in learning new technologies.\n","Job Position":"Full Stack Developer (Trainee Software Engineer – Java, Python, Node JS, C++)\n","Interview Process":"Level 1: Technical Aptitude Test.\nLevel 2: Written Programming Test.\nLevel 3: System Execution of Program.\nLevel 4: HR Interview.\n","Note":"Those who have taken up the interview in last 3 months are not eligible to undergo interview again.\n","Summary":"Soft Suave Technologies Walkin in Bangalore As Full Stack Developer On 26th, 27th September 2020. BE, BTech, ME, MTech, MCA Graduates 2018, 2019, 2020 are eligible for this walkin drive. More details regarding Soft Suave Technologies Bangalore Walkin Drive is given below.","postTitle":"Soft Suave Technologies Walkin | Full Stack Developer (0-2 years) | 26th to 27th September 2020 | Bangalore"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-data-associate-0-3-years-hyderabad","Job Summary":"About the team: The Alexa Data Services (ADS) organization provides data creation, curation, and analytics services to help develop, test, and train the Alexa AI. We work closely with Amazon Machine Learning (ML) Science and modeling teams, providing the critical data they need to improve Alexas speech recognition and language understanding capabilities.\n","Job Description":"We are hiring Data Associates (1 year contract) in our Hyderabad team to undertake labeling functions such as transcription, annotation and dialogue evaluation on speech & text data to assess and improve Alexas performance.\nAs a Data Associate, you will work on speech and text data.\nWe value your high attention to details and your ability to adapt to dynamic changes due to emerging business requirements.\nYou are recognized as a role model for your proactivity in identifying issues with efficiency and accuracy.\n","Date":"23-Sep-2020","Job Responsibilities":"Work with text, speech and other types of data and attach tags to the contents, at scale.\nDeliver high quality of labeled data, leveraging guidelines to meet specific key performance indicators, and using in-house tools and software.\nReport issues with tools and software to the development team when necessary.\nProvide feedback for improvements to existing tooling that can increase labeling throughput and quality.\nMaintain strict confidentiality and follow all applicable Amazon policies for securing confidential information.\nProficiency in English, Hindi grammar and spelling (both written and verbal).\nComfortable working with speech from various dialects and accents of Hindi.\nWillingness and flexibility to work in shifts including night shift etc.\n","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"High School, Diploma, Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-hindi-data-associate-hyderabad-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-3-years-230920001257 - ","Job Position":"Hindi Data Associate\n","Note":"Work Location: Hyderabad (Only candidates currently in Hyderabad are eligible).\nJob Type: Contractual role for 1 year.\n","Basic Qualifications":"High School or Equivalent diploma\nWork Experience: Maximum of 24 months of experience in any industry\nProficient computer skills in MS Office with good typing speed (> 40 wpm and >90% accuracy), including basic troubleshooting with the ability to utilize proprietary tools.\n","Summary":"Amazon Recruitment in Hyderabad For Data Associate Position. High School, Diploma, Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Data Associate (0-3 years) | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"amazon-recruitment-cloud-support-associate-0-1-year-bangalore","Job Category":"IT | Software\n","Job Description":"The AISPL Support team (Amazon Internet Services) is seeking engineers that enjoy solving problems, working with customers, and have technical backgrounds from a variety of different fields including Linux\/Windows systems administration, database design and optimization, big data analysis, network administration, and dev ops.\nAs a member of the AISPL Support team you will be at the forefront of this transformational technology assisting a global list of companies that are taking advantage of a growing set of services and features to run their mission-critical applications.\nYou will work with leading companies in this space and directly with the engineering teams within Amazon developing these new capabilities.\nYou will be surrounded by people that who are smart, passionate about cloud computing, and believe that world class support is critical to customer success.\nAISPL Cloud Support team provides technical support to a global list of customers that are building mission-critical applications on top of AWS services.\nWork Location: Bangalore and Hyderabad.\n","Date":"21-Sep-2020","Job Responsibilities":"Every day will bring new and exciting challenges on the job while you:\n","Company Name":"Amazon\n","Experience":"0 to 1 year\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/1239864\/cloud-support-associate - ","Job Role":"Amazon has a history and tradition of leading the world in Web-related technologies and services.\nNow, with AISPL Support you have the chance to join us as a Cloud Support Associate who helps individuals and businesses take their computing infrastructures and applications into the Cloud.\n","Job Position":"Cloud Support Associate\n","Basic Qualifications":"Bachelor’s Degree in Engineering in one of the branches (CSE\/IT\/ECE\/EEE) or MCA with an aggregate of 65% overall\n0-1 years of experience in Linux\/Windows systems administration, database design and optimization, big data analysis, network administration, and devops.\nExcellent oral and written communication skills.\nStrong customer focus & Multi-tasking skills.\nSelf-starter who is excited about technology.\nTroubleshooting \/ Support experience.\n","Summary":"Amazon Recruitment in Bangalore For Cloud Support Associate Position. BE, BTech, MCA Graduates are eligible to apply for this job. More details regarding Amazon Bangalore Job Openings is given below.","postTitle":"Amazon Recruitment | Cloud Support Associate (0-1 year) | Bangalore","Preferred Qualifications":"Basics in OS concepts \/ Linux\/Unix Systems administration (Ubuntu, CentOS, RedHat, Solaris, etc)\nProgramming \/ scripting experience (Java, Perl, Ruby, C#, and\/or PHP)\nBasic knowledge in Networking (TCP\/IP, DNS) \/Database\nExposure to Cloud computing\n"},{"Job Location":"Chennai\n","Navigation":"groupon-recruitment-customer-service-representative-0-3-years-chennai","Eligibility Criteria":"Graduate degree from any stream (No Diploma or equivalent will be considered) Freshers can apply.\n6 months – 3 years of previous professional experience in a customer service capacity, preferably in a high-volume environment.\nExperience using technology for email, chat, and phone in an environment that requires multitasking and multiple tools\/software integration.\nExperience working with a diverse customer base preferred.\nYou love problem-solving to help your customers have an excellent experience.\nYou take an entrepreneurial approach to task management and take control and handle tasks independently.\nYou communicate well on the phone, in text and in person and are able to understand and explain customer situations and solutions.\nYou love building efficient and effective engagements – both for customers and merchants – and can diffuse even high-tension situations with ease.\nYou have experience building rapport with customers and demonstrating strong interpersonal skills.\nAbility to work full-time and a willingness to work irregular hours or on rotating shifts.\nAbility to be comfortable in a desk-based office environment using a computer and phone during working hours.\nAbility to type 50 WPM or more with 90% accuracy or better is preferred.\n","Job Category":"BPO\n","Job Description":"As a CS Representative, you’ll talk to our customers every single day and answer questions related to Groupon deals, customer experiences, merchant feedback, and technical issues.\nOur Representatives are web-savvy, resourceful, embrace change, and are dedicated to providing the best possible customer experience for Groupon users.\nAnd best of all, we believe in helping people grow within the CS organization.\nMany of our former CS Representatives turn their passion and dedication into higher level roles around the company, both inside and outside of CS.\nA role in customer service can be a first step to an amazing career in technology, ecommerce, logistics, editorial, or human resources.\n","Date":"22-Sep-2020","Job Responsibilities":"You’ll spend time on the following:\n","Company Name":"Groupon\n","Perks and Benefits":"Wide range of employees benefits (including personal & group health insurance), Free of cost transportation facility, the ability to work from home during the pandemic time (Temporarily) & Shift allowance.\n","Experience":"Freshers \/ 6 months to 3 years\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-customer-service-representative-groupon-shared-services-pvt-ltd-chennai-0-to-3-years-010720001349?src=jobsearchDesk&sid=15992551676275192_28 - ","Job Position":"Customer Service Representative\n","Summary":"Groupon Recruitment in Chennai For Freshers and Experienced As Customer Service Representative. Any Graduates are eligible to apply for this job. More details regarding Group Chennai Job Openings is given below.","postTitle":"Groupon Recruitment | Customer Service Representative (0-3 years) | Chennai"},{"Job Location":"Bangalore\n","Navigation":"hpe-freshers-recruitment-2021-software-engineer-intern-bangalore","Eligibility Criteria":"Four-year university students who are working in a technical internship role at the company during their study or in summer breaks between university semesters\nMinimum CGPA of 7\/10 or 70% aggregate throughout academics from 10th grade till present. (no active arrears)\nExcellent communication skills.\nGood problem solving and analytical skills.\nHighly-reliable self-starter with a can-do attitude.\nAbility to think differently, and quickly run with an idea, socialize the idea within the product stakeholder community and build a prototype and productize it\n","Job Category":"IT | Software\n","Job Description":"You will work on a specific project critical to HPEs needs with opportunities to gain experience across a broad range of cutting edge technologies and across the full stack of software engineering challenges.\nYou can work within an existing Agile, software engineering project team and collaborate to help to solve problems within that team’s focus.\nYou’ll learn about our software development practices and the latest tools used for software development and front-end technology – including Scrum and Kanban methodologies.\nYou can communicate effectively and be motivated to achieve results as part of your team.\nYou will be mentored by at least one senior member of the Engineering Team and will be working with a mix of IT professionals with a range of experience.\n","Date":"21-Sep-2020","Year of Passing":"2021 Batch\n","Company Name":"HPE (Hewlett Packard Enterprise)\n","Experience":"Freshers\n","Qualification":"BE\/BTech (Circuit Branches – CSE, EC, EE, IT etc)\n","How To Apply":"https:\/\/careers.hpe.com\/job\/Hewlett-Packard-Enterprise-Bangalore-Software-Engineer-R&D-Intern-Karnataka\/118493563 - ","Job Position":"Software Engineer R&D – Intern\n","Summary":"HPE (Hewlett Packard Enterprise) Freshers Recruitment 2021 in Bangalore For Software Engineer Intern Position. BE, BTech Freshers 2021 are eligible to apply for this job. More details regarding HPE Bangalore Freshers Job Openings 2021 is given below.","postTitle":"HPE Freshers Recruitment 2021 | Software Engineer Intern | Bangalore"},{"Job Location":"Hyderabad\n","Navigation":"nxp-semiconductors-freshers-recruitment-2020-software-engineer-hyderabad","Eligibility Criteria":"Thorough in C programming, knowledge of scripting language like Python.\nKnowledge of Networking like OSI model and applications.\nFamiliarity with Linux based embedded platforms and debugging embedded software.\nKnowledge of Linux OS internals, kernel module development.\n","Job Category":"IT | Software\n","Date":"21-Sep-2020","Year of Passing":"2020 Batch\n","Company Name":"NXP Semiconductors\n","Experience":"Freshers\n","Qualification":"BE, BTech, MTech\n","How To Apply":"https:\/\/nxp.wd3.myworkdayjobs.com\/en-US\/careers\/job\/Hyderabad\/Graduate-Hire_R-10018064 - ","Job Position":"Software Engineer (Graduate Hire)\n","About NXP Semiconductors":"NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile and communication infrastructure markets.\nAs the world leader in secure connectivity solutions for embedded applications, we are driving innovation in the secure connected vehicle, end-to-end security & privacy and smart connected solutions markets.\nOur employees are the ones who put our corporate values into daily practice. The dedication, ingenuity and creativity they bring to their work enable us to be insightful, engaging, inventive and committed to excellence.\nOur company has approximately 29,000 employees in more than 30 countries. Company Website: .\n","Summary":"NXP Semiconductors Freshers Recruitment 2020 in Hyderabad As Software Engineer. BE, BTech, MTech Freshers 2020 are eligible to apply for this job. More details regarding NXP Semiconductors Hyderabad Freshers Job Openings 2020 is given below.","postTitle":"NXP Semiconductors Freshers Recruitment 2020 | Software Engineer | Hyderabad"},{"Job Location":"Bangalore\n","Salary":"Rs. 2,35,000\/- per annum\n","Navigation":"hgs-recruitment-technical-support-0-2-years-bangalore","Eligibility Criteria":"Any Graduate Fresher or Experienced (No Post Graduates).\nWilling to work in rotational shifts.\n","Job Category":"BPO\n","Job Description":"2 Way cab facility provided.\n5 Days working, 2 Days Off.\nOffice Location: HGS ,AMR Tech Park, 2nd floor, Bommnahalli, Opposite Oxford Engineering College.\n","Date":"21-Sep-2020","Company Name":"HGS (Hinduja Global Solutions)\n","Experience":"Freshers\/0 to 2 years\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hgs-is-hiring-for-technical-support-voice-profile-hurry-up-hinduja-global-solutions-limited-bengaluru-bangalore-0-to-2-years-030920002638?xp=1 - ","About HGS (Hinduja Global Solutions)":"A global leader in business process management (BPM) and optimizing the customer experience lifecycle. HGS is helping make its clients more competitive every day. HGS combines technology-powered services in automation, analytics, and digital with domain expertise focusing on back-office processing, contact centers, and HRO solutions to deliver transformational impact to clients.\nOur employees, our clients, and their customers are at the heart of everything we do. HGS operates a global network of customer experience centers across the U.S., Canada, UK, India, Jamaica, UAE, and the Philippines. Company Website: www.teamhgs.com.\n","Desired Skills":"Good communication.\nGood Analytical Skills.\nBasic computer knowledge.\n","Job Position":"Technical Support (Voice Process)\n","Note":"Interviews will be conducted Telephonic or Zoom.\n","Summary":"Hinduja Global Solutions (HGS) Freshers and Experienced Recruitment in Bangalore For Technical Support Position. Any Graduate are eligible to apply for this job. More details regarding HGS Bangalore Freshers Job Openings is given below.","postTitle":"HGS Recruitment | Technical Support (0-2 years) | Bangalore"},{"Job Location":"Bangalore\n","Salary":"Rs. 2,25,000 – 2,75,000\/- per annum\n","Navigation":"altisource-freshers-recruitment-analystassociate-bangalore","Job Category":"BPO\n","Job Description":"We are seeking energetic, highly skilled self-starters who thrive in a dynamic and fast-paced environment.\nWe offer challenging work and great colleagues as well as career development opportunities.\nWe are looking for a Mortgage Loan Setup Associate with a passion for the mortgage industry to develop and manage client relations the Altisource umbrella.\nThis is a great time to join the team and be a part of a growing and stable organization.\n","Date":"22-Sep-2020","Job Responsibilities":"Obtain mortgage loan documentation by ordering credit report, land survey, building appraisal, title, and related information, adhering to all internal policies and procedures while protecting the confidentiality of the borrower information.\nEffectively communicate and interact with Loan Officers, Borrowers and other stakeholders to obtain information or to seek clarification about documents in the loan file.\nIdentify mortgage loan application and documentation problems by highlighting deficiencies and notifying mortgage loan underwriter.\nPrepare mortgage loan files by reviewing loan application; clarifying or obtaining additional information and submitting loan application files to underwriting for approval.\nContinually assess pipeline and timely request, following up on borrower documentation necessary to ensure loan meets product and program requirements.\n","Company Name":"Altisource\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-analyst-associate-altisource-business-solutions-pvt-ltd-bengaluru-bangalore-0-to-0-years-250820004722?src=jobsearchDesk&sid=15983906348775279_17 - ","Job Position":"Analyst \/ Associate\n","Summary":"Altisource Freshers Recruitment in Bangalore As Analyst\/Associate. Any Graduate Freshers are eligible to apply for this job. More details regarding Altisource Bangalore Freshers Job Openings is given below.","postTitle":"Altisource Freshers Recruitment | Analyst\/Associate | Bangalore","Perks And Benefits":"Two Way transportation.\nSat and Sun Fixed Off.\nBest Salary In Industry.\nAttractive Incentive Plan.\nComprehensive insurance plan\n"},{"Job Location":"Bangalore\n","Salary":"Rs. 2,25,000\/- per annum\n","Navigation":"amazon-recruitment-catalog-mapping-team-0-2-years-bangalore","Job Category":"BPO\n","Job Description":"Final semester 2020 candidates can apply.\nThis job requires you to come to office post COVID-19 situation eases out.\n","Date":"21-Sep-2020","No.of Openings":"100\n","Job Responsibilities":"In this role, you will be responsible to monitor and ensure the accuracy of the pricing analytics & operations team through audits and process improvement activities.\nThe job involves auditing operations teams & system outputs, suggesting and implementing process\/system improvements, and identifying emerging process performance trends.\nYou will be responsible to audit, track and maintain the quality metrics of assigned processes.\nThe individual will interact with the business, automation & technology teams to help drive operational and system improvements.\nThe successful candidate should have the ability to work at all levels with an eye for detail to achieve process goals, actively seeks to understand Amazon’s core values and translates those into everyday practices.\n","Company Name":"Amazon\n","Experience":"0 to 2 years\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-cmt-catalog-mapping-team-bangalore-amazon-development-centre-india-pvt-ltd-bengaluru-bangalore-0-to-2-years-090720001627?src=jobsearchDesk&sid=15947625713156667_15 - ","Desired Skills":"Has statistical knowledge on averages, trend, outliers, charting, etc.\nWould be an advantage Graduate with 0 to 2 years of work experience.\nProficient in Internet navigation and keyboard typing skills.\nHas problem solving skills and attention to details.\nProficient in MS Excel and other MS office tools.\nPossesses excellent written and oral communication skills.\nHas the ability to deliver results by influencing team members.\nAbility to work independently and think ‘out of the box’.\nShould be able to ‘dive deep’ and identify the root cause of the issues and get them fixed by coordinating with different teams like operations and IT.\n","Job Position":"Catalog Mapping Team (CMT)\n","Summary":"Amazon Recruitment Freshers and Experienced in Bangalore For Catalog Mapping Team (CMT). Any Graduates are eligible to apply for this job. More details regarding Amazon India Job Openings is given below.","postTitle":"Amazon Recruitment | Catalog Mapping Team (0-2 years) | Bangalore"},{"Job Location":"Chennai\n","Navigation":"zoho-corporation-recruitment-technical-support-engineer-0-2-years-chennai","Eligibility Criteria":"Proficiency in English.\nAttention to detail and a strong desire to learn.\nAbility to work independently and deliver value to the customers and the company.\nShould be willing to work in night shifts.\nMust be interested in the accounting and finance side.\n","Job Category":"IT | Software\n","Job Description":"Answering customer queries through phone, e-mail & chat about product features and capabilities.\nHelping customers with basic troubleshooting, configuration difficulties and advanced technical issues in the product by working closely with the development team.\nPrompt communication of customer requirements to the development team.\nFacilitate with product demos, implementations and training.\n","Date":"23-Sep-2020","Year of Passing":"2018, 2019, 2020\n","Company Name":"Zoho Corporation\n","Experience":"0 t o 2 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/careers.zohorecruit.com\/recruit\/WebFormServeServlet?rid=162060bf19ef5bfd9c408621bb66328b6c49a8d3a80058b2d65120b6b5591867gidf62d65585721aed69c3d0236e3a70183 - ","Job Position":"Technical Support Engineer\n","Note":"If you have attended the written test \/ Interview with ZOHO anytime in the past 3 months, you should not attend this test.\nStudents who are graduating in 2021 are not eligible to apply this form.\n","Summary":"Zoho Corporation Recruitment in Chennai For Technical Support Engineer Position. Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Zoho Corporation Chennai Job Openings is given below.","postTitle":"Zoho Corporation Recruitment | Technical Support Engineer (0-2 years) | Chennai"},{"Job Location":"Hyderabad, Bangalore, Pune\n","Salary":"Rs. 3,50,000\/- per annum\n","Navigation":"oberthur-technologies-freshers-recruitment-full-stack-developer-software-qa-engineer-devops-engineer-hyderabad-bangalore-pune","Eligibility Criteria":"The candidate should have good aptitude and analytical skills.\nThe candidate should possess basic programming skills or basic knowledge of software testing or some idea about DevOPs.\nThe candidate should also possess communication skills.\n","Job Category":"IT | Software\n","Job Description":"Selected candidates will be divided into 3 work streams Full Stack Developer, Software QA Engineer and DevOPs Engineer depending upon their interview results.\n","Benefits":"Employee Provident Fund.\nMediclaim Insurance of 4 Lakhs.\nAnnual Bonus Pay upto 10% of gross pay up and above CTC.\nWork from Home till June 2021.\nFlexible Timings.\n","Date":"22-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Company Name":"Oberthur Technologies India Pvt Ltd\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA, MSc (Computer Science)\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-fresher-developer-tester-devops-work-from-home-oberthur-technologies-india-pvt-ltd-pune-bengaluru-bangalore-hyderabad-secunderabad-0-to-0-years-210920003776?src=jobsearchDesk&sid=16007191773787397_2 - ","Job Positions":"Full Stack Developer, Software QA Engineer, DevOps Engineer\n","Summary":"Oberthur Technologies (IDEMIA) Freshers Recruitment in Hyderabad, Bangalore, Pune For Full Stack Developer, Software QA Engineer (Testing Engineer), DevOps Engineer Positions. BE, BTech, MCA, MSc Freshers 2019, 2020 are eligible to apply for this job. More details regarding Oberthur Technologies Freshers Job Openings is given below.","postTitle":"Oberthur Technologies Freshers Recruitment | Full Stack Developer, Software QA Engineer, DevOps Engineer | Hyderabad, Bangalore, Pune"},{"Job Location":"Chennai\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"changepond-technologies-freshers-walkin-software-trainee-24th-to-25th-september-2020-chennai","Eligibility Criteria":"Fresher’s only.\nGraduates with an aggregate of minimum 60% in Academics.\nMandate: Java\/.Net Certification from any Training Institute\nGood communication Skills.\n","Walkin Time":"9.30 AM to 12.30 PM\n","Job Category":"IT | Software\n","Job Description":"Changepond Technologies is Hiring Engineering graduates – Freshers For Trainee Position.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"20\n","Year of Passing":"2017, 2018, 2019\n","Walkin Date":"24tth, 25th September 2020\n","Company Name":"Changepond Technologies\n","Walkin Venue":"Changepond Technologies, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai – 603 103. Land Mark: Opposite to TCS 2nd Gate\nContact Person: Kalaiselvan R (HR)\nCompany Website: www.changepond.com\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-engineering-graduates-fresher-s-for-changepond-technologies-changepond-technologies-private-limited-chennai-0-to-1-years-210920002968?src=jobsearchDesk&sid=16007227599368720_2 - ","Job Position":"Software Trainee (.NET\/Java)\n","Summary":"Changepond Technologies Freshers Walkin Drive in Chennai For Software Trainee Position. BE, BTech, MCA Graduates 2017, 2018, 2019 are eligible for this walkin. More details regarding Changepond Technologies Chennai Freshers Walkin is given below.","postTitle":"Changepond Technologies Freshers Walkin | Software Trainee | 24th to 25th September 2020 | Chennai"},{"Job Location":"Bangalore\n","Navigation":"axa-business-services-freshers-recruitment-customer-service-associate-bangalore","Eligibility Criteria":"Freshers only.\nGraduation is mandatory.\nNon technical graduates from recognized universities.\nExcellent in English conversation and comprehension skill.\nShould have a basic understanding about insurance.\nshould be comfortable to work in US shifts (5:00 PM to 5:00 AM – any 8.5 hours)\n","Job Category":"BPO\n","Job Description":"AXA Business Services is hiring For International Customer Service- Inbound Process.\nWork location: Manyata, Tech Park, Nagavara, Bangalore.\n","Date":"22-Sep-2020","Company Name":"AXA Business Services\n","Experience":"Freshers\n","Qualification":"Any Graduation (BCom, BA, BHM, BBA, BMS…)\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-axa-bs-is-hiring-for-international-customer-service-inbound-process-axa-business-services-pvt-ltd-bengaluru-bangalore-0-to-1-years-020720003253?src=jobsearchDesk&sid=15956257352721057_17 - ","Job Position":"Customer Service Associate\n","Summary":"AXA Business Services Freshers Recruitment in Bangalore For Customer Service Associate Position. Any Graduate Freshers are eligible to apply for this job. More details regarding AXA Business Services Bangalore Freshers Job Openings is given below.","postTitle":"AXA Business Services Freshers Recruitment | Customer Service Associate | Bangalore","About AXA Business Services":"We see ourselves as change agents for radical innovations spanning big data, risk modeling, robotic automation, process and people transformation. Our employees are at the heart of our business and together we move forward in a culture of trust, such that our employees are in charge of the future.\nWe are driven by our values, motivated by the desire to win, and bond as one large global team to quickly adapt to changing market dynamics. We are extremely proud of our roots and at the same time we are completely free to write out our future.\nOur teams at AXA Business Services are self-driven to deliver exceptional value to our partners. Aligning to our values of Customer first, Integrity, Courage and ONE AXA, we proactively focus on driving efficiency for our partners while also helping them in exceeding their customer expectations. Company Website: www.axaindia.com.\n"},{"Job Location":"Across India\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"thyrocare-technologies-freshers-recruitment-business-development-executive-across-india","Eligibility Criteria":"Freshers.\nGraduate\/Pursuing Graduation.\nGood written and verbal communication skill.\nShould know English and additional one Regional language.\nMust have system and internet connectivity at home.\n","Job Description":"Work Locations: Hyderabad, Bengaluru, Chennai, Delhi NCR, Mumbai, Bhubaneshwar, Ahmedabad, Kochi, Kolkata.\n","Benefits":"Work From Home opportunity.\nFull time payroll job.\nMonthly allowance for internet connectivity.\n","Date":"23-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"Procure network members viz; hospital, laboratory, polyclinics that associates with the company to ensure pan-India presence and service.\nEnhance B2B business for company.\nIdentify new sales opportunities within existing association by up-selling and cross-selling.\nImplementing the company strategy across all the territory.\n","Company Name":"Thyrocare Technologies\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-thyrocare-technologies-ltd-chennai-bhubaneshwar-delhi-ncr-mumbai-ahmedabad-bengaluru-bangalore-ernakulam-kochi-cochin-hyderabad-secunderabad-kolkata-0-to-1-years-220920001050?src=jobsearchDesk&sid=1600806475101972_6 - ","Job Position":"Business Development Executive\n","Summary":"Thyrocare Technologies Freshers Recruitment Across India For Business Development Executive Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Thyrocare Technologies Freshers Job Openings is given below.","postTitle":"Thyrocare Technologies Freshers Recruitment | Business Development Executive | Across India"}]}