{"jobs":[{"Job Location":"Hyderabad\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-data-associate-0-3-years-hyderabad","Job Summary":"About the team: The Alexa Data Services (ADS) organization provides data creation, curation, and analytics services to help develop, test, and train the Alexa AI. We work closely with Amazon Machine Learning (ML) Science and modeling teams, providing the critical data they need to improve Alexas speech recognition and language understanding capabilities.\n","Job Description":"We are hiring Data Associates (1 year contract) in our Hyderabad team to undertake labeling functions such as transcription, annotation and dialogue evaluation on speech & text data to assess and improve Alexas performance.\nAs a Data Associate, you will work on speech and text data.\nWe value your high attention to details and your ability to adapt to dynamic changes due to emerging business requirements.\nYou are recognized as a role model for your proactivity in identifying issues with efficiency and accuracy.\n","Date":"23-Sep-2020","Job Responsibilities":"Work with text, speech and other types of data and attach tags to the contents, at scale.\nDeliver high quality of labeled data, leveraging guidelines to meet specific key performance indicators, and using in-house tools and software.\nReport issues with tools and software to the development team when necessary.\nProvide feedback for improvements to existing tooling that can increase labeling throughput and quality.\nMaintain strict confidentiality and follow all applicable Amazon policies for securing confidential information.\nProficiency in English, Hindi grammar and spelling (both written and verbal).\nComfortable working with speech from various dialects and accents of Hindi.\nWillingness and flexibility to work in shifts including night shift etc.\n","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"High School, Diploma, Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-amazon-hiring-hindi-data-associate-hyderabad-amazon-development-centre-india-pvt-ltd-hyderabad-secunderabad-0-to-3-years-230920001257 - ","Job Position":"Hindi Data Associate\n","Note":"Work Location: Hyderabad (Only candidates currently in Hyderabad are eligible).\nJob Type: Contractual role for 1 year.\n","Basic Qualifications":"High School or Equivalent diploma\nWork Experience: Maximum of 24 months of experience in any industry\nProficient computer skills in MS Office with good typing speed (> 40 wpm and >90% accuracy), including basic troubleshooting with the ability to utilize proprietary tools.\n","Summary":"Amazon Recruitment in Hyderabad For Data Associate Position. High School, Diploma, Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Data Associate (0-3 years) | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"accenture-recruitment-customer-service-0-1-year-bangalore","Job Category":"BPO\n","Job Description":"You will be aligned with our Customer Support vertical and help us in managing\/ resolving customers query, handling escalations and complaints of the dissatisfied customers & giving best resolutions.\nYou will also be responsible for closing the fault and complaints within SLA’s.\nYou will be working as a part of Query Management team which is accountable for the Inbound\/Outbound calls and e-mail\/chat support to resolve customer issue.\nYou will be responsible for Customer service (Non-Technical) where in you will be managing incoming calls \/ chats \/emails and customer service inquiries.\nHandling calls\/ chats\/ emails and fulfilling the customer’s requirements.\nBuild sustainable relationships and trust with customer through open and interactive communication.\nProvide accurate, valid and complete information by using the right methods\/tools.\nManage large amounts of incoming calls\/chats\/emails.\nGood to have skills: Customer service (Non-Technical), Good communication skills.\n","Date":"22-Sep-2020","Job Responsibilities":"In this role you are required to solve routine problems, largely through precedent and referral to general guidelines.\nInteraction is within own team and direct supervisor.\nDetailed instructions on all tasks will be provided at this role with close supervision.\nDecisions made impact own work and are closely supervised.\nIndividual contributor as a part of a team with a predetermined, narrow scope of work.\n","Company Name":"Accenture\n","Experience":"o to 1 year\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.accenture.com\/in-en\/careers\/jobdetails?SRC=%3C%20RECNau%20%3E&id=18254_india_2&title=Query+Management-Customer+service+(Non-Technical) - ","Job Position":"Query Management – Customer Service (Non-Technical)\n","Summary":"Accenture Recruitment in Bangalore For Customer Service Associate. Graduates are eligible to apply for this job. More details regarding Accenture Bangalore Job Openings is given below.","postTitle":"Accenture Recruitment | Customer Service (0-1 year) | Bangalore","Job Designation":"Associate\n"},{"Job Location":"Bangalore\n","Job Requirements":"Good understanding of Security, LAN\/WAN topologies and technologies.\nIn-depth knowledge of OSI Model, TCP\/IP, Network Security basics.\nAbility to work on in a high-level stress and interrupt driven environment\nGood understanding of L2-L7 networking protocols, major Operating Systems such as UNIX \/ Linux\nDemonstrated ability to use in-depth troubleshooting to resolve or workaround customer issues using troubleshooting tools i.e. Wire Shark, Netmon etc.\nRouting and Switching knowledge will be added advantage.\nWilling to work in 24×7 environment in night shifts.\n","Navigation":"sonicwall-freshers-recruitment-graduate-trainee-engineer-intern-bangalore","Eligibility Criteria":"Bachelor’s degree in Computer Science\/Information Sciences\/ Electronic & Communications Engineering\n0 – 1 years networking and network security support experience with solid understanding of LAN\/WAN topologies and technologies.\nIn-depth knowledge of the network protocols: TCP\/IP.\nRouting Protocols like OSPF, RIP, BGP, Firewall, IDS\/IPS will be added advantage.\n","Job Category":"IT | Software\n","Job Description":"SonicWall is looking for Graduates who are comfortable to work in fixed night shifts.\n","Date":"23-Sep-2020","Year of Passing":"2019, 2020 Batch\n","Job Responsibilities":"Responsible for providing technical support across SonicWall product lines via Phone\/Web & Emails in 24x7x365 days environment.\nAssist customers with deployment of SonicWall network security products like Firewall\/IPS and VPN solutions.\nProvide technical solutions and workarounds for end users with their issues on respective product line.\nOwns customer issues from beginning to resolution (handles in place)\nAssists customers by diagnosing problems and providing resolutions for technical and service issues.\nUse troubleshooting techniques and tools to identify products that are defective and follows guidelines in issuing service calls\/contacts.\nAdvises\/educates customers within procedural guidelines to ensure a complete solution to their technical or service questions.\nRecreates, identifies and provides input on unique or recurring customer problems.\nFocuses on delivering a positive customer experience according to SonicWall standards.\nMonitors and tracks issues to ensure accurate resolution.\nCandidate should work closely with the Engineering and other cross functional teams to replicate the issues reported by the customers, validate the bug fixes provided through various patch releases and resolve the customer issues in a professional manner.\nProvide consistent feedback to the team on products supported.\nRemains knowledgeable of SonicWall product line and related industry products and technologies.\n","Company Name":"SonicWall\n","Experience":"Freshers\/0 to 1 year\n","Qualification":"BE\/BTech (CS\/ECE\/IT\/IS)\n","How To Apply":"https:\/\/boards.greenhouse.io\/sonicwall\/jobs\/2347856 - ","Job Position":"Graduate Trainee Engineer (Intern)\n","Summary":"SonicWall Freshers Recruitment in Bangalore As Graduate Trainee Engineer Intern. BE, BTech Freshers 2019, 2020 are eligible to apply for this job. More details regarding SonicWall Bangalore Freshers Job Openings 2020 is given below.","postTitle":"SonicWall Freshers Recruitment | Graduate Trainee Engineer Intern | Bangalore"},{"Job Location":"Mumbai RCP\n","Navigation":"reliance-jio-freshers-recruitment-graduate-engineer-trainee-network-be-btech-mumbai","Eligibility Criteria":"Certification in Cisco CCNA preferred.\n","Date":"22-Sep-2020","Job Responsibilities":"Carry out requirement understanding from business, planning and regulatory teams.\nPlan network design and architecture for all businesses.\nConduct operational planning for respective function.\nExecute network capacity planning to meet customer demands and maintain congestion free network.\nAssist in vendor evaluation and validation process.\nDetail out engineering for LTE \/ FTTH and Enterprise network.\nGenerate engineering document per node and monthly operating plan for planned event execution.\nCoordinate with cross-functional team members.\nEnsure adherence to standard operating process to achieve end objectives.\nEnhance technical knowledge by attending technical seminars \/ webinars.\n","Company Name":"Reliance Jio\n","Experience":"Freshers\n","Qualification":"BE, BTech (Any Discipline)\n","How To Apply":"https:\/\/careers.jio.com\/frmjobdescription.aspx?JBTITLE=G8qH2LC5OPB94+k2bbwjEQ==&jbID=LHU7qEAi3znb07Z62DF8hQ==&funcCode=huP1kHl8mfE= - ","Desired Skills":"Knowledge of computer networking fundamentals.\nFamiliarity with best software engineering practices and development models.\nInterpersonal skills.\nProblem solving and analytical skills.\nTeam player.\nTechnical orientation.\n","Job Position":"Graduate Engineer Trainee Network\n","Summary":"Reliance Jio Freshers Recruitment in Mumbai for Graduate Engineer Trainee Network Position. BE, BTech Freshers are eligible for this job. More details regarding Reliance Jio Mumbai Freshers Job Openings is given below.","postTitle":"Reliance Jio Freshers Recruitment | Graduate Engineer Trainee Network | BE, BTech | Mumbai","About Jio":"Jio is a young and dynamic organization with a mission to digitally transform India. We believe in making dreams a reality by bringing out the creativity and innovation in our employees. We have a host of initiatives through which we care for our employees throughout their life at Jio. Given ahead are our philosophies behind building a working environment that supports our employees in achieving the impossible every day.\n"},{"Job Location":"Hyderabad\n","Salary":"Rs. 2,11,473\/- per annum (CTC)\n","Navigation":"virtusa-recruitment-analyst-2018-2019-2020-batch-hyderabad","Eligibility Criteria":"Should sign service agreement of 14 months.\nShould be Open to work in rotational shifts.\nBatch of 2020, if you have cleared final Semester and have mark sheets, then please apply.\n","Job Description":"Review Ads, Search Contents.\nReview Contents given by client – Comments \/ edit.\nReview search contents and classify them as per client guidelines.\n","Date":"22-Sep-2020","No.of Openings":"50\n","Year of Passing":"2018, 2019, 2020 Batch\n","Company Name":"Virtusa\n","Qualification":"BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Analyst-Ads-Curations-jobs-in-Hyderabad-Secunderabad-in-Virtusa-Consulting-Services-Pvt-Ltd-220920600018 - ","Industry Type":"IT-Software – Software Services\n","Desired Skills":"High proficiency in Verbal\/Written English.\nExpert knowledge of MS Excel (analyze and generate reports using Pivot Table, V & H look ups, apply formulaes like sum if, Index, match etc).\nGood working knowledge about Internet.\nAware about how Google search works, good searching skills through use of effective keywords.\nTech Savvy is definitely plus\nFamiliar in searching for goods \/ services \/ ads online.\n","Job Position":"Analyst – Ads Curations\n","Summary":"Virtusa Recruitment in Hyderabad For Analyst Position. BE, BTech, BSc, BCom, BCA, BA, BBA, BBM, BBS, BCM Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Virtusa Hyderabad Job Openings is given below.","postTitle":"Virtusa Recruitment | Analyst | 2018, 2019, 2020 Batch | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"oracle-recruitment-applications-developer-0-2-years-bangalore","Eligibility Criteria":"BS degree or equivalent experience relevant to functional area.\n0-2 years of previous software engineering or related experience.\n","Job Category":"IT | Software\n","Job Description":"Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications.\nAs a member of the software engineering division, you will develop software according to provided design specifications.\nAnalyze system specifications and existing business processes and information systems.\nBuild enhancements and resolve bugs.\nBuild and execute unit tests and unit test plans.\nWork involves some problem solving with assistance and guidance in understanding and applying company policies and processes.\nGaining competence in own area and acquiring a higher level understanding of role, processes and procedures.\n","Date":"23-Sep-2020","Company Name":"Oracle\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, BS\n","How To Apply":"https:\/\/oracle.taleo.net\/careersection\/2\/jobdetail.ftl?job=20000R8F&tz=GMT%2B05%3A30&tzname=Asia%2FKolkata - ","Job Position":"Applications Developer\n","Note":"Applicants are required to read, write, and speak the following languages: English.\n","Summary":"Oracle Recruitment in Bangalore For Applications Developer Position. BE, BTech, BS Graduates are eligible to apply for this job. More details regarding Oracle Bangalore Job Openings is given below.","postTitle":"Oracle Recruitment | Applications Developer (0-2 years) | Bangalore","Preferred Qualifications":"Software Development & DevOps.\n"},{"Job Location":"Chennai\n","Navigation":"zoho-corporation-recruitment-technical-support-engineer-0-2-years-chennai","Eligibility Criteria":"Proficiency in English.\nAttention to detail and a strong desire to learn.\nAbility to work independently and deliver value to the customers and the company.\nShould be willing to work in night shifts.\nMust be interested in the accounting and finance side.\n","Job Category":"IT | Software\n","Job Description":"Answering customer queries through phone, e-mail & chat about product features and capabilities.\nHelping customers with basic troubleshooting, configuration difficulties and advanced technical issues in the product by working closely with the development team.\nPrompt communication of customer requirements to the development team.\nFacilitate with product demos, implementations and training.\n","Date":"23-Sep-2020","Year of Passing":"2018, 2019, 2020\n","Company Name":"Zoho Corporation\n","Experience":"0 t o 2 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/careers.zohorecruit.com\/recruit\/WebFormServeServlet?rid=162060bf19ef5bfd9c408621bb66328b6c49a8d3a80058b2d65120b6b5591867gidf62d65585721aed69c3d0236e3a70183 - ","Job Position":"Technical Support Engineer\n","Note":"If you have attended the written test \/ Interview with ZOHO anytime in the past 3 months, you should not attend this test.\nStudents who are graduating in 2021 are not eligible to apply this form.\n","Summary":"Zoho Corporation Recruitment in Chennai For Technical Support Engineer Position. Graduates 2018, 2019, 2020 are eligible to apply for this job. More details regarding Zoho Corporation Chennai Job Openings is given below.","postTitle":"Zoho Corporation Recruitment | Technical Support Engineer (0-2 years) | Chennai"},{"Job Location":"Hyderabad\n","Navigation":"dxc-technology-recruitment-database-administrator-hyderabad","Job Category":"IT | Software\n","Job Description":"Monitors database activity and file usage, and ensures necessary resources are present so that databases function properly by removing or deleting old or obsolete files.\nDevelops data retrieval queries and optimizes data queries within programs for performance for performance and maintainability.\nDetermines data to collect and analyzes information as appropriate.\nAnalyzes and determines informational needs and elements, data relationships and attributes, proposed manipulation, data flow and storage requirements and data output and reporting capabilities.\nAssists development teams in defining logical attributes and inter-relationships and assists in designing data structures to accommodate database production, storage, maintenance and accessibility to enhance performance.\nTests designed applications utilizing database management software or general programming software to enhance performance.\nInstalls, implements and supports systems within user base; creates and updates database installation instructions and design changes for client use.\nInstalls new systems or new releases of database systems; determines table attributes, primary, and alternate keys for multiple databases.\nInstalls and upgrades hardware and software as necessary to enhance database performance.\nResearches various hardware and software products; recommends solutions and implements approved products.\nUtilizes standard corporate tools to record change and problem activities for tracking purposes.\n","Date":"22-Sep-2020","Company Name":"DXC Technology\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/jobs.dxc.technology\/ShowJob\/Id\/964038\/Associate%20Professional%20Database%20Administrator%20(51000208) - ","Job Position":"Associate Professional Database Administrator\n","Basic Qualifications":"Bachelor’s degree or equivalent combination of education and experience.\nBachelor’s degree in computer science, management information systems, or related field preferred.\nZero or more years of experience in database design, administration, or maintenance.\nExperience working with software installation\/upgrading procedures.\nExperience working with multiple logical entity modeling techniques.\nExperience working with database creation techniques.\nExperience working with relational databases.\n","Summary":"DXC Technology Recruitment in Hyderabad As Database Administrator. BE, BTech Graduates are eligible to apply for this job. More details regarding DXC Technology Hyderabad Job Openings is given below.","postTitle":"DXC Technology Recruitment | Database Administrator | Hyderabad","Other Qualifications":"Good analytical and problem solving skills.\nGood programming skills for database management and general software.\nGood communication skills for providing documentation to support personnel, customers, and managers.\nGood technical infrastructure design skills.\nAbility to work in a team environment.\nWillingness to travel.\n"},{"Job Location":"Bangalore\n","Salary":"Rs. 3,00,000\/- per annum\n","Contact Person":"HR\nCompany Website:\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"soft-suave-technologies-walkin-full-stack-developer-0-2-years-26th-to-27th-september-2020-bangalore","Walkin Time":"9\n","Job Category":"IT | Software\n","Job Description":"Execute full software development life cycle (SDLC)\nCode, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology.\nDevelop flowcharts, layouts and documentation to identify requirements and solutions\nMaintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes.\nWrite quality and clean code using prescribed specifications.\nEvaluate the interrelationships between programs.\nAnalyze performance of programs and take action to correct deficiencies .\nConfer with users to gain understanding of needed changes or modifications of existing programs.\nResolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"10\n","Year of Passing":"2018, 2019, 2020 batch\n","Walkin Date":"26th, 27th September 2020\n","Company Name":"Soft Suave Technologies\n","Walkin Venue":"Soft Suave Technologies Pvt Ltd, Gayatri Tech Park (4th floor), Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru – 560066.\n","Experience":"0 to 2 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-walk-in-bangalore-soft-suave-technologies-private-limited-bengaluru-bangalore-0-to-2-years-190920000575?src=jobsearchDesk&sid=1600548771756218_3 - ","Desired Skills":"Good knowledge in Java, Pyton, Node JS, C++.\nStrong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL.\nLogical and analytical thinking towards the Java programming.\nShould have designed at least one project module using object oriented analysis and design techniques.\nSound knowledge of modern software architecture and development techniques.\nShould be a self initiator and interested in learning new technologies.\n","Job Position":"Full Stack Developer (Trainee Software Engineer – Java, Python, Node JS, C++)\n","Interview Process":"Level 1: Technical Aptitude Test.\nLevel 2: Written Programming Test.\nLevel 3: System Execution of Program.\nLevel 4: HR Interview.\n","Note":"Those who have taken up the interview in last 3 months are not eligible to undergo interview again.\n","Summary":"Soft Suave Technologies Walkin in Bangalore As Full Stack Developer On 26th, 27th September 2020. BE, BTech, ME, MTech, MCA Graduates 2018, 2019, 2020 are eligible for this walkin drive. More details regarding Soft Suave Technologies Bangalore Walkin Drive is given below.","postTitle":"Soft Suave Technologies Walkin | Full Stack Developer (0-2 years) | 26th to 27th September 2020 | Bangalore"},{"Job Location":"Chennai\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\n","Navigation":"changepond-technologies-freshers-walkin-software-trainee-24th-to-25th-september-2020-chennai","Eligibility Criteria":"Fresher’s only.\nGraduates with an aggregate of minimum 60% in Academics.\nMandate: Java\/.Net Certification from any Training Institute\nGood communication Skills.\n","Walkin Time":"9.30 AM to 12.30 PM\n","Job Category":"IT | Software\n","Job Description":"Changepond Technologies is Hiring Engineering graduates – Freshers For Trainee Position.\n","Job Type":"Walkin\n","Date":"23-Sep-2020","No.of Openings":"20\n","Year of Passing":"2017, 2018, 2019\n","Walkin Date":"24tth, 25th September 2020\n","Company Name":"Changepond Technologies\n","Walkin Venue":"Changepond Technologies, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai – 603 103. Land Mark: Opposite to TCS 2nd Gate\nContact Person: Kalaiselvan R (HR)\nCompany Website: www.changepond.com\n","Experience":"Freshers\n","Qualification":"BE, BTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-engineering-graduates-fresher-s-for-changepond-technologies-changepond-technologies-private-limited-chennai-0-to-1-years-210920002968?src=jobsearchDesk&sid=16007227599368720_2 - ","Job Position":"Software Trainee (.NET\/Java)\n","Summary":"Changepond Technologies Freshers Walkin Drive in Chennai For Software Trainee Position. BE, BTech, MCA Graduates 2017, 2018, 2019 are eligible for this walkin. More details regarding Changepond Technologies Chennai Freshers Walkin is given below.","postTitle":"Changepond Technologies Freshers Walkin | Software Trainee | 24th to 25th September 2020 | Chennai"},{"Job Location":"Across India\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"thyrocare-technologies-freshers-recruitment-business-development-executive-across-india","Eligibility Criteria":"Freshers.\nGraduate\/Pursuing Graduation.\nGood written and verbal communication skill.\nShould know English and additional one Regional language.\nMust have system and internet connectivity at home.\n","Job Description":"Work Locations: Hyderabad, Bengaluru, Chennai, Delhi NCR, Mumbai, Bhubaneshwar, Ahmedabad, Kochi, Kolkata.\n","Benefits":"Work From Home opportunity.\nFull time payroll job.\nMonthly allowance for internet connectivity.\n","Date":"23-Sep-2020","No.of Openings":"50\n","Job Responsibilities":"Procure network members viz; hospital, laboratory, polyclinics that associates with the company to ensure pan-India presence and service.\nEnhance B2B business for company.\nIdentify new sales opportunities within existing association by up-selling and cross-selling.\nImplementing the company strategy across all the territory.\n","Company Name":"Thyrocare Technologies\n","Experience":"Freshers\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-business-development-executive-thyrocare-technologies-ltd-chennai-bhubaneshwar-delhi-ncr-mumbai-ahmedabad-bengaluru-bangalore-ernakulam-kochi-cochin-hyderabad-secunderabad-kolkata-0-to-1-years-220920001050?src=jobsearchDesk&sid=1600806475101972_6 - ","Job Position":"Business Development Executive\n","Summary":"Thyrocare Technologies Freshers Recruitment Across India For Business Development Executive Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Thyrocare Technologies Freshers Job Openings is given below.","postTitle":"Thyrocare Technologies Freshers Recruitment | Business Development Executive | Across India"},{"Job Location":"Hyderabad\n","Documents Required":"Updated Resume.\nGovt Photo ID Proof.\nCarry Xerox Copies of all academic and experience (if applicable) certificates.\nWear face mask.\n","Navigation":"247-ai-walkin-chat-process-0-2-years-23rd-to-25th-september-2020-hyderabad","Skills Required":"Excellent Verbal and Written Communication skills.\nGood logical reasoning and analytical skills.\nAble to interact with customers via chat, should be able to answer servicing questions.\nAble to work in night shifts (US).\nShould have typing speed of 26 WPM.\n","Eligibility Criteria":"Freshers and Experienced can apply.\nAge criteria Below 30 years.\nLooking for Immediate Joiners.\n","Walkin Time":"10.00 AM to 2.00 PM (Please follow the timings mentioned)\n","Job Category":"BPO\n","Benefits":"Transport facility both Pick\/Drop.\nLife Insurance.\nMedical Insurance.\n","Job Type":"Walkin\n","Date":"22-Sep-2020","No.of Openings":"250\n","Walkin Date":"23rd, 24th, 25th September 2020\n","Company Name":"[24]7.ai (24\/7 Customer Private Ltd)\n","Walkin Venue":"[24]7.ai (24\/7 Customer Private Ltd), Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad – 500039.\nCompany Website: www.247.ai.\n","Experience":"Freshers\/0 to 2 years\n","Qualification":"Undergraduate (10+2 or 10+3 pass)\/Graduate\/Postgraduate\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-walk-in-for-interview-247-ai-uppal-customer-support-chat-process-24-7-customer-private-ltd-hyderabad-secunderabad-0-to-2-years-210920002876?src=jobsearchDesk&sid=16007191773787397_7 - ","Job Position":"Customer Support – Chat Process\n","Interview Process":"Personal Introduction Round.\nOnline Test.\nOperations Round.\n","Note":"Candidates attended interview within 30 days are not eligible to attend.\n","Summary":"[24]7.ai Freshers and Experienced Walkin Drive in Hyderabad For Chat Process On 23rd, 24th, 25th September 2020. Any Undergraduate, Graduate, Postgraduates are eligible for this walkin drive. More details regarding [24]7.ai Hyderabad Walkin Drive is given below.","postTitle":"[24]7.ai Walkin | Chat Process (0-2 years) | 23rd to 25th September 2020 | Hyderabad"}]}