{"jobs":[{"Job Location":"Hyderabad\n","Navigation":"posidex-technologies-freshers-recruitment-software-developer-hyderabad","Eligibility Criteria":"Graduates with 65% or above throughout his\/her academics.\nFreshers with good skills in Java and Advance Java.\nWilling to travel at short notice to client location for support, deployment or for trouble shooting activities.\n","Job Category":"IT | Software\n","Date":"20-Sep-2020","About Posidex Technologies":"POSIDEX Technologies’ innovative Enterprise Customer Data Platform, with its proven sophisticated entity resolution technology based on Machine Learning and InMemory Analytics, has transformed the way businesses operate and engage with their customers during their entire life cycle with the organisation. The ability to combine many attributes of an entity, and going beyond the current use of fuzzy logic techniques, provides a very granular configuration for real-time resolution over very large volumes. This innovative approach provides our clients a game changing ability to widen the scope of their solutions in Fraud Detection, Risk Management, Compliance and Customer Experience.\nPOSIDEX’s disruptive technologies has motivated its clients to replace their existing customer data platforms; achieve a lower TCO; and very high return on investment by way of increased throughput and automated decisioning. POSIDEX customers also benefit indirectly due to improved risk mitigation, better compliance and more reliable data for Analytics and Business Intelligence. POSIDEX technology has been tested, proven and is trusted by 40+ large enterprise level customers across Banking, Financial Services, Insurance, Securities, Retail, Telecom, Credit Bureau and Government verticals in meeting their critical business needs in real-time. Company Website: www.posidex.com.\n","Company Name":"Posidex Technologies\n","Experience":"Freshers\n","Qualification":"BTech, MTech, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-freshers-posidex-technologies-pvt-ltd-hyderabad-secunderabad-0-to-1-years-180920500152?src=jobsearchDesk&sid=16004627465015081_2 - ","Desired Skills":"Basic database skills in Oracle\/MySQL\/MS SQLServer\nBasic knowledge of Angular and Spring Frameworks\nInitiaive driven with Strong communication, analytical and problem-solving skills.\n","Job Position":"Software Developer (Java)\n","Summary":"Posidex Technologies Freshers Recruitment in Hyderabad For Software Developer Position. BTech, MTech, MCA Freshers are eligible to apply for this job. More details regarding Posidex Technologies Hyderabad Freshers Job Openings is given below.","postTitle":"Posidex Technologies Freshers Recruitment | Software Developer | Hyderabad"},{"Job Location":"Chennai\n","Salary":"Rs. 2,25,000 – 3,00,000\/- per annum\n","Navigation":"amazon-recruitment-content-associate-0-4-years-chennai","Job Description":"Amazon is Hiring For Content Associate with Hindi and HTML Expertise.\n","Date":"24-Sep-2020","Job Responsibilities":"The Primary responsibility of the role is to perform quality checks on web pages and digital content for the e-book reader.\nThe associate needs to perform e-book conversion and would need to have working knowledge of HTML and CSS.\nThe role will require the candidate to quickly understand the eBook content editing tools and operation workflow tools.\nThe associate need to continuously adapt and learn new features on the Editors and improve on acumen to quickly edit and fix up contents.\nShould follow editing SOP to spot\/catch errors in the content.\nThe associate needs to perform content quality check to qualify user experience for content viewing (flow and format quality) and usage on the Kindle device.\nNeed to use software tools for quality audit, content editing and data capture.\nThe associate will need to be aware of the operations metrics like productivity (Number of titles processed per hour), quality (defect %age) and delivery\/latency SLA. The associate will be measured on his compliance to these Metrics, SLA requirements, QA guidelines, team and personal goals.\nThe associate should be a team player and come up with improvement ideas to his direct report and improve the editing\/QA process.\nThe associate will need to often contact stakeholders globally to provide status reports, communicate relevant information and escalate when needed.\nThe role is an individual contributor role.\nThe role requires a graduate degree with exposure to MS office and comfort with numbers.\nIn addition the associate should have attention to detail, good communication skills, and a professional demeanor.\n","Company Name":"Amazon\n","Experience":"0 to 4 years\n","Qualification":"Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-for-content-associate-with-hindi-html-expertise-amazon-development-centre-india-pvt-ltd-chennai-0-to-4-years-160820000675 - ","Job Position":"Content Associate\n","Basic Qualifications":"Must be a graduate in any stream from any reputable university.\nWorking knowledge of InDesign, HTML, CSS, e-pub, XML standards is mandatory.\nExpertise to read and write Hindi.\nMust possess knowledge in e-book\/print book conversion.\nAbility to meet deadlines in a fast-paced work environment driven by complex software systems and processes.\nShould be self-motivated and a good team player.\nMust pay undivided attention to the details while editing content and diving deep to identify root cause of issues.\nGood at problem solving, data analysis and troubleshooting issues related to content editing.\nGood interpersonal skills to manage ongoing relationships with software team and inter-operations teams Knowledge\/experience in publishing industry would be preferred.\n","Summary":"Amazon Recruitment in Chennai For Content Associate Position. Graduates are eligible to apply for this job. More details regarding Amazon Chennai Job Openings is given below.","postTitle":"Amazon Recruitment | Content Associate (0-4 years) | Chennai"},{"Job Location":"Pune\n","Salary":"Rs. 4,00,000\/- per annum\n","Navigation":"incedo-freshers-recruitment-software-engineer-trainee-2019-2020-batch-pune","Eligibility Criteria":"Minimum Marks: 70% (Throughout the academics).\nCandidate should have either UG or PG qualifications.\n","Job Category":"IT | Software\n","Job Description":"Our Hiring Model will include Internship Hiring for 6 months and conversion to FTE basis performance.\nThe offered CTC while conversion to FTE will be 4 LPA.\n","Date":"24-Sep-2020","No.of Openings":"10\n","Company Name":"Incedo\n","Experience":"Freshers\n","Qualification":"BE\/BTech (Computer Science, Electronics and Communication, Information science, Information Technology), MCA.\n2020\/2019 Batch from good Colleges.\n","How To Apply":"https:\/\/www.firstnaukri.com\/job-listings-Software-Engineer-Trainee-Pune-jobs-in-Pune-in-Incedo-Technology-Solutions-Ltd-010920600003 - ","Job Positions":"Candidate has to work on the below languages.\n","Desired Skills":"Good written and oral communication skills.\nAnalytical mind with problem-solving aptitude.\nA good team Player.\nAptitude to learn.\n","Job Position":"Software Engineer Trainee\n","Summary":"Incedo Freshers Recruitment in Pune For Software Engineer Trainee Position. BE, BTech, MCA Freshers 2019, 2020 are eligible to apply for this job. More details regarding Incedo Pune Freshers Job Openings 2020 is given below.","postTitle":"Incedo Freshers Recruitment | Software Engineer Trainee | 2019, 2020 Batch | Pune","Primary Skills":"Primary Skills required for this role are\n"},{"Job Location":"Bangalore\n","Navigation":"zeotap-recruitment-software-engineer-intern-bangalore","Eligibility Criteria":"Degree in Computer Science or IT with strong academic credentials.\nCourses in Big data and No SQL technologies.\nCourses in complex SQL queries.\nVery good in Advanced data structures and algorithms.\nStrong problem-solving ability.\nGood programming skills in any one of – Java, Scala, GoLang, Python.\nGood SQL querying skills. Above Basic level.\nExperience in handling terabyte size datasets.\nStrong understanding of transactional and high scale systems.\n","Job Category":"IT | Software\n","Date":"20-Sep-2020","Job Responsibilities":"You will be a part of product development team, developing modules for data driven applications\nYou will deliver production quality code adhering to best practices\nYou should assist in production troubleshooting\nYou should research and implement cutting-edge technologies relevant to zeotap business problems\nYou adhere to zeotap’s company, privacy and information security policies and procedures\nYou complete all the awareness training assigned on time\n","Company Name":"Zeotap\n","Experience":"0 to 1 year\n","Qualification":"BE, BTech\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-software-engineer-intern-zeotap-bengaluru-bangalore-0-to-1-years-190920500562?src=jobsearchDesk&sid=1600958163930161 - https:\/\/jobs.lever.co\/zeotap\/d07f2c87-afa4-4352-8e3f-49f412f0e1be\/ - ","Job Position":"Software Engineer Intern\n","Summary":"Zeotap Recruitment in Bangalore For Software Engineer Intern Position. BE, BTech Graduates are eligible to apply for this job. More details regarding Zeotap Bangalore Job Openings is given below.","postTitle":"Zeotap Recruitment | Software Engineer Intern | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"sap-recruitment-associate-devops-engineer-0-2-years-bangalore","Eligibility Criteria":"Experience in SAP Basis administration and SAP NetWeaver.\nHands-on experience with SAP HANA or similar Database technologies.\nExperience in UNIX\/Linux (SUSE\/RHEL).\nGood analytical and troubleshooting skills.\nGood interpersonal, presentation and communication skills in English.\nUnderstanding of SaaS and Cloud offerings or products, and related processes is an advantage.\nUnderstanding of Google Cloud or Azure related operations is an advantage.\nUnderstanding of Virtualization and other Infrastructure areas like Storage and Network is an advantage.\nExposure to ITIL\/ITSM processes.\n","Job Category":"IT | Software\n","Job Description":"","Date":"24-Sep-2020","SAP Cloud DevOps Engineer – SAP Basis\/SAP HANA\/SUSE Linux":"The Integrated Business Planning (IBP) Cloud Delivery department – as part of the Intelligent Enterprise Group organization – is responsible for the complete life cycle management (planning, production, and operations) of SAP’s IBP Cloud Software as a Service (SaaS) solutions.\nThe IBP Cloud Delivery and Operations department drives and executes all required activities based on an end-to-end approach and facilitates all functions from development engagement to cloud architecture, design, production, life cycle management and other services of our productive customer landscapes.\nWe are looking to fill the position of SAP Cloud DevOps Engineer in the IBP Cloud Delivery and Operations department in Bangalore.\nIn the role of DevOps Engineer you will be contributing to the success of SAP Cloud solutions which enables hundreds of our customers to run their business seamlessly.\nAs a member of this team you will be responsible for system and landscape operations, handling many challenging issues and projects in the newest SAP Cloud Technologies, like HANA, Fiori and NetWeaver\/ABAP across multiple SAP’s own datacenters and Hyperscalers like Azure, GCP & Ali Cloud.\nYou’ll also be collaborating closely with IBP Product Development, IBP Architecture, Cloud Architecture and Cloud Infrastructure teams, spread across various geographies.\n","Job Responsibilities":"Maintaining IBP Customer instances in SAP SaaS Cloud landscape.\nOwn and handle Operation tasks like Monitoring\/Alert handling, Incident Management, Change Management, System Installation, Provisioning, Life Cycle Management activities like Hotfixes\/Patches and Upgrades.\nAssist in the resolution of application-related problems.\nResearch and resolve database problems, ensuring database integrity, security, stability, and system availability.\nUpdate systems using Software Update Manager (SUM), SPAM\/SAINT tool.\nConfigure STMS, dump analysis, user and profile management.\nPerformance monitoring and tuning.\nSupport Continuity of Business.\nContribute to Root Cause Analysis.\nCoordination with other support functions and team to resolve the issues in a timely manner.\n","Company Name":"SAP\n","Experience":"0 to 2 years\n","Qualification":"BTech, MTech, MCA, MSc\n","How To Apply":"https:\/\/jobs.sap.com\/job\/Bangalore-Associate-DevOps-Engineer-Job-KA\/621449101\/ - ","Job Position":"Associate DevOps Engineer\n","Note":"Please Dont Apply if you have more than 2 years experience.\nWillingness to work in shifts: 24\/7 Coverage.\n","Summary":"SAP Recruitment in Bangalore For Associate DevOps Engineer Position. BTech, MTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding SAP Bangalore Job Openings is given below.","postTitle":"SAP Recruitment | Associate DevOps Engineer (0-2 years) | Bangalore"},{"Job Location":"Bangalore\n","Salary":"Rs. 1,50,000 – 2,50,000\/- per annum\n","Navigation":"kotak-mahindra-bank-recruitment-customer-service-executive-0-5-years-bangalore","Eligibility Criteria":"Freshers can also apply.\nExcellent communication skills Verbal & Written\nFlexible to get scattered 8 Week Offs in a month with 9hours shift (For Females: 7AM till 8PM).\nGood listening skills and strong communication abilities.\nBe Confident and willing to learn with a flair for knowledge.\nPossess an upbeat, positive can-do attitude & works with integrity\nTeam Player, collaborative Self-motivated person including the ability to act as a role model within the organization.\nShould be able to establish rapport quickly with peers, managers & customers\nTeam player: Candidate must be able to work effectively with all levels of the organization.\n","Job Description":"Work Location: Gold Hill Square, opp. to Oxford college, Popular Colony, Bommanahalli, Bengaluru, Karnataka 560068.\n","Bank Name":"Kotak Mahindra Bank\n","Date":"20-Sep-2020","No.of Openings":"10\n","Job Responsibilities":"To Attend the inbound calls of customers in Retail Liabilities and process the queries & requests to customer’s satisfaction.\nTo identify and convert the opportunities for cross selling (banking product) on customer’s call.\nResponsible for quality communication and customer servicing within laid down productivity and service benchmarks.\nEnsure customer delight and consistent service experience, including timely resolution of customer queries\/issues.\nComplete the logs specified by the process (End-of-day target).\nAdherence to Information Security norms & quality process norms.\nTo be aware of and comply with any updates about the process.\nAct on the feedback given by Team Leader\/Team Coach or Quality or on the coaching provided to the team as guidelines for improving performance.\n","Experience":"Freshers \/ 0 to 5 years\n","Qualification":"Any Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-customer-service-executive-kotak-mahindra-bank-kotak-mahindra-bank-limited-bengaluru-bangalore-0-to-5-years-170920000999?src=jobsearchDesk&sid=16003731445686098_22 - ","Job Position":"Customer Service Executive\n","Summary":"Kotak Mahindra Bank Recruitment For Freshers and Experienced As Customer Service Executive. Any Graduates are eligible to apply for this job. More details regarding Kotak Mahindra Bank Bangalore Job Openings is given below.","postTitle":"Kotak Mahindra Bank Recruitment | Customer Service Executive (0-5 years) | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"banyan-data-services-recruitment-junior-cloud-software-engineer-0-2-years-bangalore","Eligibility Criteria":"0-2 years of experience with 1 or more development languages such as Java, Python or Spark.\nFreshers can also apply\nCertification or any training’s completion of any one of the cloud environment like AWS, GCP, Azure and Oracle Cloud.\nCurious minds who are inclined to ask, Why?\nStrong problem-solvers who are comfortable in unfamiliar situations, and can view challenges through multiple perspectives.\nDriven to develop technical skills for oneself and team-mates.\nAbility to connect with clients and colleagues of different backgrounds and communication styles, through empathy and clear verbal, visual, and written communication.\nHands-on experience with cloud computing and\/or traditional enterprise data-Center technologies, i.e., network, compute, storage, and virtualization.\n1 years + of experience with private\/public\/hybrid cloud model design, implementation, orchestration, and support.\nPossess at least one cloud-related certification from AWS, Azure or equivalent.\nApplying advanced technical knowledge and skills in developing cloud software solutions or problem solving where complexity, innovation and technical expertise are required.\nStrong knowledge in the database fundamentals and the Dev-Ops processes (including CI\/CD).\nAbility to write high-quality, well-tested code and comfort with Object-Oriented or functional programming patterns.\nPast experience quickly learning new languages and frameworks.\nAbility to work with a high degree of autonomy and self-direction.\nExperience with software development agile\/iterative methodologies and SOA.\n","Job Category":"IT | Software\n","Date":"24-Sep-2020","Job Responsibilities":"A wide variety of engineering projects including data visualization, web services, data engineering, web-portals, SDKs, and integrations in numerous languages, frameworks, and clouds platforms.\nApply continuous delivery practices to deliver high-quality software and value as early as possible.\nWork in collaborative teams to build new experiences.\nParticipate in the entire cycle of software consulting and delivery from ideation to deployment.\nIntegrating multiple software products across cloud and hybrid environments.\nMigrating existing on-premises software applications to cloud leveraging a structured method and best practices.\nDeveloping processes and procedures for software applications migration to the cloud, as well as managed services in the cloud.\n","Company Name":"Banyan Data Services\n","Experience":"Freshers \/ 0 to 2 years\n","Qualification":"BE, BTech, MTech, MCA, MSc\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-junior-cloud-software-engineer-banyan-data-services-india-pvt-ltd-bengaluru-bangalore-0-to-2-years-120920002839 - ","Job Position":"Junior Cloud Software Engineer\n","Summary":"Banyan Data Services Recruitment For Freshers and Experienced As Junior Cloud Software Engineer. BE, BTech, MTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding Banyan Data Services Bangalore Job Openings is given below.","postTitle":"Banyan Data Services Recruitment | Junior Cloud Software Engineer (0-2 years) | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"banyan-data-services-recruitment-sql-developer-0-1-year-bangalore","Eligibility Criteria":"0-1 year of experience of SQL and PL\/SQL programming.\nFresher can also apply with intensive knowledge of SQL.\nExperience with Requirement gathering, developing database objects like Tables, Functions, Stored Procedures, Packages , Indexes, Triggers, Cursors ,Materialized Views etc.\nStrong understanding of Oracle Database fundamentals and features and good at developing complex SQL queries.\nAble to understand the business requirements and translate requirements into technical specifications including the physical and logical data modelling, designing and data flow diagrams.\nExpertise in Client-Server application development using PL\/SQL, SQL, SQL*Loader and SQL*Plus\nStrong Hands on experience with Oracle 12c\/11g database platform SQL\/PL SQL, database object modelling or above (creating modifying tables, views, sequences, aggregate functions, etc.)\nPerformance SQL Tuning including tuning\/optimizing SQL, PL\/SQL code and writing complex queries for business logics.\nExperience in the full application life-cycle from inception through deployment and maintenance.\nWork experience on customization & development of various Reports using Oracle Reports.\nExposure to Oracle 18c\/19c versions would be a plus.\nBonus point to have an exposure to Oracle APEX version 5.1 or higher, strong skills in design and development of APEX applications.\nExperience in designing and manipulating web content dynamically using JQuery, Ajax, JavaScript, Angular JS, CSS and HTML.\nProficiency in any of scripting languages i.e ruby, python, Perl, bash, shell. Experience working with an Agile Development team Excellent problem-solving skills and phenomenal debugging skills. Follow team software development methodology and maintain documentation as needed.\n","Job Category":"IT | Software\n","Date":"20-Sep-2020","Company Name":"Banyan Data Services\n","Experience":"Freshers \/ 0 to 1 year\n","Qualification":"BE, BTech, MTech, BCA, MCA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-sql-developer-banyan-data-services-india-pvt-ltd-bengaluru-bangalore-0-to-1-years-180920000305?src=jobsearchDesk&sid=1600463121842943 - ","Desired Skills":"Demonstrated ability to deliver results on time with high quality Aptitude to independently learn new technologies.\nExperience in JavaScript, Web Services, AJAX, XML, HTML, and CSS.\nAbility to define and tackle logical problems for highly technical applications.\nAbility to select, adapt, and effectively use a variety of programming methods.\nGood communication skills with both technical and non-technical clients.\nMust be flexible to work on the office timings to accommodate the multi-national client timings.\nWilling to learn new technologies and work on research orientated projects.\nAmbitious individual who can work under their own direction towards agreed targets\/goals.\n","Job Position":"SQL Developer\n","Summary":"Banyan Data Services Recruitment For Freshers and Experienced As SQL Developer. BE, BTech, MTech, BCA, MCA Graduates are eligible to apply for this job. More details regarding Banyan Data Services Bangalore Job Openings is given below.","postTitle":"Banyan Data Services Recruitment | SQL Developer (0-1 year) | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"ibm-recruitment-full-stack-developer-0-2-years-bangalore","Preferred Technical and Professional Expertise":"Understand requirements, design, code, and test high-quality mobile apps, using cross-platform technologies such that the resulting apps operate on Apple iOS and Google Android, from a single code base.\nTake wireframes from conception to implementation and design and improve user interfacing.\nWork in frameworks such as: Flutter, React Native, or Ionic, using cross-platform mobile app development programming languages like Dart or JavaScript.\nHave an interest in, understanding of, or experience with mobile app.\n","Job Category":"IT | Software\n","Job Description":"As a Full Stack Developer\n","Date":"21-Sep-2020","Job Responsibilities":"Develop back-end portions of web services.\nCreate and talk to REST services.\nDevelop front-end applications.\nShift between multiple projects and technologies.\nWrite clean code and test it throughout the development process to ensure the quality is up to standards.\nWork on software that is used by millions of people all around the world is a challenge that you’re willing to tackle.\nPerform peer reviews and mentor the team to evolve into full stack developers.\nEncourage a self-motivated squad model of working from handling design, development, test and operations for the micro services.\n","Company Name":"IBM\n","Experience":"0 to 2 years\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-full-stack-developer-ibm-india-pvt-limited-bengaluru-bangalore-0-to-2-years-180920902061?src=jobsearchDesk&sid=16006242746066045_5 - ","Job Position":"Full Stack Developer\n","Required Technical and Professional Expertise":"0-2 years of IT experience.\nRelevant industry and software development experience.\nProven experience in Java, Ruby, Python, JavaScript, Node.js, Angular.js.\nExperience and deep skills in system level language like Core Java, Backend language like Node.js and Framework based language like JavaScript with Angular or React.\nProven experience in UI Development technologies such as HTML\/CSS, JSON and REST API development experience (APIs like REST \/ RESTful APIs).\nShould have Full stack development experience and Microservices Architecture.\nExperience in any Databases like SQL \/ NoSQL.\n","Summary":"IBM Recruitment in Bangalore As Full Stack Developer. Any Graduate, Post Graduates are eligible to apply for this job. More details regarding IBM Bangalore Job Openings is given below.","postTitle":"IBM Recruitment | Full Stack Developer (0-2 years) | Bangalore"},{"Job Location":"Chennai\n","Salary":"Rs. 1,00,000 – 2,00,000\/- per annum\n","Navigation":"adp-freshers-recruitment-payroll-process-trainee-2019-2020-batch-chennai","Eligibility Criteria":"Preferred Qualification: BCom, BBA, BA (Maths, English), MBA (HR).\nPercentage: 70%.\n","Job Category":"IT | Software\n","Job Description":"In this role (Payroll Process Trainee), it’s all about enabling our customers to be more effective employers.\nOur service teams make it happen by collaborating with our clients and other key internal stakeholders to ensure that we provide “Everyday Excellence” and improve our client’s experience. (P.S. Did you know that the majority of our customers are not only satisfied, but they’d recommend ADP to someone else?).\nAs a Payroll Process Trainee, you will assist in payroll processing by providing inputs and preparation of pay sheets for clients.\n","Date":"24-Sep-2020","No.of Openings":"10\n","Year of Passing":"2019, 2020 Passedouts.\n","Job Responsibilities":"What you’ll do:\n","Company Name":"ADP India Pvt Ltd\n","Experience":"Freshers\n","Qualification":"Any Graduate except Computer Stream Students.\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-hiring-freshers-for-payroll-processing-for-adp-india-adp-india-pvt-ltd-chennai-0-to-1-years-030920001754?src=jobsearchDesk&sid=1599166294436782_2 - ","Desired Skills":"Bonus points if you have these:\n","Job Position":"Payroll Process Trainee\n","Summary":"ADP Freshers Recruitment in Chennai For Payroll Process Trainee Position. Any Graduate Freshers 2019, 2020 are eligible to apply for this job. More details regarding ADP Chennai Freshers Job Openings 2020 is given below.","postTitle":"ADP Freshers Recruitment | Payroll Process Trainee | 2019, 2020 Batch | Chennai"},{"Job Location":"Hyderabad\n","Navigation":"legato-health-technologies-freshers-recruitment-claims-associate-hyderabad","Eligibility Criteria":"BE\/BTech Graduates are NOT Eligible.\n","Job Description":"Each associate will be responsible for processing applications submitted by members\/applicants.\nThe process will include enrollment of applications submitted by applicant into the system accurately within the TAT.\nReporting To: Team Leader.\n","Date":"24-Sep-2020","Job Responsibilities":"Meeting RE & Quality scores.\nComplete all IDP & compliance trainings.\nCompletion of cases in queue within specified time frame.\n","Company Name":"Legato Health Technologies\n","Measurable":"RE & Quality scores.\nComplete al the transaction assigned within time.\nPunctuality & attendance adherence.\nProcess improvement initiatives.\nAccreditation within timelines.\n","Experience":"Freshers\n","Qualification":"Any Graduate\n","How To Apply":"https:\/\/jobs.legatohealth.com\/jobs\/associate-fresher-claims-57036 - ","Desired Skills":"Good written Communication Skills.\nEye for detail & logical thinking.\nAbility to work accurately and efficiently at all times, including peak volume season.\nSensitivity to the confidential nature of the data and proprietary company information.\nFlexibility to work in shifts.\n","Job Position":"Claims Associate\n","Summary":"Legato Health Technologies Freshers Recruitment in Hyderabad For Claims Associate Position. Any Graduate Freshers are eligible to apply for this job. More details regarding Legato Health Technologies Hyderabad Freshers Job Openings is given below.","postTitle":"Legato Health Technologies Freshers Recruitment | Claims Associate | Hyderabad"},{"Job Location":"Bangalore\n","Navigation":"equiniti-india-freshers-recruitment-non-voice-process-bangalore","Job Category":"BPO\n","Job Description":"In the role of Process Executive you would need to carry out a range of assigned clerical \/ support duties in accordance with predetermined procedures and service standards under appropriate guidance and direction.\n","Benefits":"Free Cab Pick & Drop.\nFree Medical Insurance.\nGreat Work life balance.\nNight Shift Allowances (for employees working for US shift only).\n","Date":"21-Sep-2020","No.of Openings":"10\n","Job Responsibilities":"Respond to a range of general standard processing enquiries over email\/chat support.\nEnsure compliance with Equinitis procedures, standards and reporting requirements, together with all relevant regulatory and statutory requirements, where appropriate implementing actions to protect our business at all times.\nAlways to undertake the duties of this role in accordance with the requirements of the companys Regulators, including FCAs Principles for Business.\n","Company Name":"Equiniti India\n","Experience":"Freshers\n","Qualification":"BCom, MCom, BA, MA, BBA, MBA\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-process-executive-non-voice-equiniti-india-bengaluru-bangalore-0-to-1-years-170920004454?src=jobsearchDesk&sid=16003731445686098_22 - ","Desired Skills":"Ensure that all work is undertaken within the quality system. To be the successful candidate one would need to possess the below\n","Job Position":"Non Voice Process (Process Executive)\n","Summary":"Equiniti India Freshers Recruitment in Bangalore For Non Voice Process. BCom, MCom, BA, MA, BBA, MBA Freshers are eligible to apply for this job. More details regarding Equiniti India Freshers Job Openings is given below.","postTitle":"Equiniti India Freshers Recruitment | Non Voice Process | Bangalore"},{"Job Location":"Hyderabad\n","Navigation":"amazon-recruitment-systems-development-engineer-intern-hyderabad","Job Category":"IT | Software\n","Job Description":"Amazon is looking for a passionate, hard-working, and talented Systems Development Engineer who can build innovative & mission critical system software applications & tools.\nYou will have an enormous opportunity to make a large impact on the design, architecture, and development of consumer products.\nYou will be responsible for delivery and support of large-scale, multi-tiered, distributed software applications and tools.\n","Date":"21-Sep-2020","Job Responsibilities":"Ability to design and code right solutions starting with broadly defined problems.\nDrive best practices and engineering excellence.\nWork with other team members to develop the architecture and design of new and current systems.\nWork in an agile environment to deliver high quality software.\n","Company Name":"Amazon\n","Experience":"Freshers\n","Qualification":"BE, BTech, ME, MTech, MCA, MSc (Computers)\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/1279070\/systems-development-eng-intern - ","Job Position":"Systems Development Engineer Intern\n","Basic Qualifications":"Candidates Pursuing Bachelors\/Masters in Computer Science or Engineering or related field.\nExcellent problem solving skills.\nPossess an extremely sound understanding of areas in the basic areas of Computer Science such as Algorithms, Data Structures, Object Oriented Design, Databases.\nBe able to write Amazon quality code in an object oriented language – preferably in C\/C++\/Java in a Linux environment.\nCandidate must have good written and oral communication skills, be a fast learner and have the ability to adapt quickly to a fast-paced development environment.\n","Summary":"Amazon Freshers Recruitment in Hyderabad For Systems Development Engineer Intern Position. BE, BTech, ME, MTech, MCA, MSc Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Freshers Job Openings is given below.","postTitle":"Amazon Recruitment | Systems Development Engineer Intern | Hyderabad","Preferred Qualifications":"System engineering experience in the cloud Strong, object-oriented design and coding skills (C\/C++ and\/or Java preferably on a UNIX or Linux platform).\nKnowledge of Perl or other scripting languages a plus.\nExperience with distributed (multi-tiered) systems, algorithms, and relational databases.\nExperience in optimization mathematics (linear programming, nonlinear optimization).\nAbility to effectively articulate technical challenges and solutions.\nDeal well with ambiguous\/undefined problems; ability to think abstractly.\nPrevious technical internship(s) preferred.\n"},{"Job Location":"Telangana (Warangal)\n","Navigation":"tech-mahindra-recruitment-data-entry-operator-0-1-year-telangana","Eligibility Criteria":"Experience: Fresher and Experienced both are eligible.\n","Job Category":"BPO\n","Job Description":"Tech Mahindra is hiring for International Data Entry Process.\nShift Timings: Rotational.\nWorking Days: 5 Days Working.\nTransportation: 2 way cab facility is provided.\nWork Location: Warangal, Telangana.\n","Date":"20-Sep-2020","No.of Openings":"30\n","Company Name":"Tech Mahindra\n","Experience":"Freshers \/ 0 to 1 year\n","Qualification":"Any UG, Graduate, Post Graduate, Diploma\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-requirement-for-data-entry-operator-at-warangal-tech-mahindra-ltd-warangal-0-to-1-years-250820002535 - ","About Tech Mahindra":"Tech Mahindra represents the connected world, offering innovative and customer-centric information technology experiences, enabling Enterprises, Associates and the Society to Rise. We are a USD 5.2 billion company with 125+K professionals across 90 countries, helping 973 global customers including Fortune 500 companies.\nOur convergent, digital, design experiences, innovation platforms and reusable assets connect across a number of technologies to deliver tangible business value and experiences to our stakeholders. Tech Mahindra is the highest ranked Non-U.S. company in the Forbes Global Digital 100 list (2018) and in the Forbes Fab 50 companies in Asia (2018).\nThe Mahindra Group is a USD 21 billion federation of companies that enables people to rise through innovative mobility solutions, driving rural prosperity, enhancing urban living, nurturing new businesses and fostering communities. It enjoys a leadership position in utility vehicles, information technology, financial services and vacation ownership in India and is the world’s largest tractor company, by volume.\nIt also enjoys a strong presence in agribusiness, aerospace, commercial vehicles, components, defense, logistics, real estate, renewable energy, speedboats and steel, amongst other businesses. Headquartered in India, Mahindra employs over 2,40,000 people across 100 countries. Company Website: www.techmahindra.com.\n","Desired Skills":"Should be good in English communication skills.\nGood Typing Skills.\nAbility to handle multiple tasks simultaneously with appropriate priority while performing customer service.\n","Job Position":"Data Entry Operator\n","Summary":"Tech Mahindra Recruitment in Telangana For Freshers and Experienced As Data Entry Operator. Any Under Graduate, Diploma, Graduate, Post Graduates are eligible to apply for this job. More details regarding Tech Mahindra Telangana Job Openings is given below.","postTitle":"Tech Mahindra Recruitment | Data Entry Operator (0-1 year) | Telangana"},{"Job Location":"Hyderabad\n","Navigation":"nxp-semiconductors-freshers-recruitment-2020-software-engineer-hyderabad","Eligibility Criteria":"Thorough in C programming, knowledge of scripting language like Python.\nKnowledge of Networking like OSI model and applications.\nFamiliarity with Linux based embedded platforms and debugging embedded software.\nKnowledge of Linux OS internals, kernel module development.\n","Job Category":"IT | Software\n","Date":"21-Sep-2020","Year of Passing":"2020 Batch\n","Company Name":"NXP Semiconductors\n","Experience":"Freshers\n","Qualification":"BE, BTech, MTech\n","How To Apply":"https:\/\/nxp.wd3.myworkdayjobs.com\/en-US\/careers\/job\/Hyderabad\/Graduate-Hire_R-10018064 - ","Job Position":"Software Engineer (Graduate Hire)\n","About NXP Semiconductors":"NXP Semiconductors N.V. enables secure connections for a smarter world, advancing solutions that make lives easier, better and safer. As the world leader in secure connectivity solutions for embedded applications, NXP is driving innovation in the automotive, industrial & IoT, mobile and communication infrastructure markets.\nAs the world leader in secure connectivity solutions for embedded applications, we are driving innovation in the secure connected vehicle, end-to-end security & privacy and smart connected solutions markets.\nOur employees are the ones who put our corporate values into daily practice. The dedication, ingenuity and creativity they bring to their work enable us to be insightful, engaging, inventive and committed to excellence.\nOur company has approximately 29,000 employees in more than 30 countries. Company Website: .\n","Summary":"NXP Semiconductors Freshers Recruitment 2020 in Hyderabad As Software Engineer. BE, BTech, MTech Freshers 2020 are eligible to apply for this job. More details regarding NXP Semiconductors Hyderabad Freshers Job Openings 2020 is given below.","postTitle":"NXP Semiconductors Freshers Recruitment 2020 | Software Engineer | Hyderabad"},{"Job Location":"Hyderabad\n","Company Name":"Accenture\n","Experience":"0 t o 2 years\n","Qualification":"Any Graduation\nJob Description:\n","How To Apply":"https:\/\/www.accenture.com\/in-en\/careers\/jobdetails?id=46960_india_2&title=13-Digital+Marketing - ","Navigation":"accenture-recruitment-digital-marketing-0-2-years-hyderabad","Job Position":"Digital Marketing\n","Summary":"Accenture Recruitment in Hyderabad For Digital Marketing. Any Graduates are eligible to apply for this job. More details regarding Accenture Hyderabad Job Openings is given below.","postTitle":"Accenture Recruitment | Digital Marketing (0-2 years) | Hyderabad","Date":"21-Sep-2020","Job Designation":"Associate\n","Job Responsibilities":"In this role you are required to solve routine problems, largely through precedent and referral to general guidelines.\nYour primary interaction is within your own team and your direct supervisor.\nIn this role you will be given detailed instructions on all tasks.\nThe decisions that you make impact your own work and are closely supervised.\nYou will be an individual contributor as a part of a team with a predetermined, narrow scope of work.\nPlease note that this role may require you to work in rotational shifts.\n"},{"Job Location":"Hyderabad\n","Navigation":"hgs-freshers-recruitment-trainee-process-consultant-hyderabad","Eligibility Criteria":"Graduation (Freshers) is mandatory.\nDegree Grads Can Apply.\nBE and BTech graduates are not eligible.\nShifts: Willing to work in Night shifts.\n","Job Category":"BPO\n","Job Description":"HGS is hiring for US Healthcare Voice Process.\nWorking Days: 5 Days.\nWeek Off: 2 days fixed off.\nCab: 2 Way cab facility is provided.\n","Date":"24-Sep-2020","Company Name":"HGS (Hinduja Global Solutions)\n","Experience":"Freshers\n","Qualification":"Any Graduation (BSc, BCA, BCom, BA, BBA, BHM, BMS, BPharma…)\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-trainee-process-consultant-hinduja-global-solutions-limited-hyderabad-secunderabad-0-to-0-years-070920001902?src=jobsearchDesk&sid=15995128761461751_7 - ","Compensation":"1.68 CTC and 9500 take home.\n","Desired Skills":"Good Communication.\nGood Analytical Skills.\nBasic computer knowledge.\n","Job Position":"Trainee Process Consultant\n","Interview Process":"All rounds will be conducted digitally.\n","Summary":"HGS (Hinduja Global Solutions) Freshers Recruitment in Hyderabad As Trainee Process Consultant. Any Graduate Freshers are eligible to apply for this job. More details regarding HGS Hyderabad Freshers Job Openings is given below.","postTitle":"HGS Freshers Recruitment | Trainee Process Consultant | Hyderabad"},{"Job Location":"Hyderabad\n","Navigation":"amazon-recruitment-programmeranalyst-0-3-years-hyderabad","Job Category":"IT | Software\n","Job Description":"The Transportation Team is looking for a passionate software programmer analyst who will be responsible for working with business, operations to gather ship carrier requirements and collaborate with transportation technology teams to integrate new carriers and ship methods into the network.\nAs part of the integration, you have to design, develop and maintain transportation documents like shipping labels, carrier electronic manifest and invoices.\nYou should also be working alongside development on Amazon Corporate and Divisional Software projects, updating\/enhancing our current software, automation of manual configuration processes and documentation of our systems.\nYour solutions will impact our customers directly! This job requires you to constantly hit the ground running and your ability to learn quickly and work on disparate and overlapping tasks will define your success.\nThe ideal candidate must be detail oriented, have superior verbal and written communication skills, strong organizational skills, able to juggle multiple tasks at once, able to work independently and can maintain professionalism under pressure.\nYou must be able to identify problems before they happen and implement solutions that detect and prevent outages.\nYou must be able to accurately prioritize projects, make sound judgments, work to improve the customer experience, and get the right things done.\n","Date":"24-Sep-2020","Company Name":"Amazon\n","Experience":"0 to 3 years\n","Qualification":"BE, BTech, ME, MTech, MCA\n","How To Apply":"https:\/\/www.amazon.jobs\/en-gb\/jobs\/1241393\/programmer-analyst-i - ","Job Position":"Programmer\/Analyst\n","Basic Qualifications":"0-3 years overall development\/technical support experience.\nStrong object oriented development knowledge in C++ and\/or Java.\nKnowledge of the UNIX\/Linux operating system.\nProven ability to troubleshoot and identify the root cause of issues.\nDemonstrates skill and passion for operational excellence.\nDocumentation skills.\n","Summary":"Amazon Recruitment in Hyderabad For Programmer\/Analyst Position. BE, BTech, ME, MTech, MCA Graduates are eligible to apply for this job. More details regarding Amazon Hyderabad Job Openings is given below.","postTitle":"Amazon Recruitment | Programmer\/Analyst (0-3 years) | Hyderabad"},{"Job Location":"Bangalore\n","Salary":"Rs. 2,25,000 – 3,25,000\/- per annum\n","Navigation":"unisys-freshers-recruitment-service-desk-associate-bangalore","Eligibility Criteria":"Minimum Education Required: Bachelor’s Degree.\nNo prior experience required.\n","Job Description":"The primary role of a service desk associate is to answer customer requests for assistance by email, chat, web or over the phone.\nThis role is crucial to ensuring customer requirements are met in terms of communication, prioritising, escalating and resolving incidents and requests.\nWork Location: Bengaluru (Sarjapur).\n","Date":"21-Sep-2020","Job Responsibilities":"First point of contact for all end user reported issues or requests.\nTypically provides technical support for Internal and External customers.\nResponsible for providing the first-line of telephone technical support of hardware, Operating Systems, sub-systems and\/or applications for customers and\/or employees.\nApplies basic diagnostic techniques to identify problems, investigate causes and recommend solutions to correct common failures.\nTakes end to end Ownership of End User Issues till resolution and follow up as mandated by the process requirements.\nEscalates complex problems to the Remote Support Engineering staff or Field Engineering.\nMaintains call quality and response times as per the agreed SLA’s.\nMaintains records of calls and ensure all cases are updated in the system.\n","Company Name":"Unisys\n","Experience":"Freshers\n","Qualification":"Any Graduation, Post Graduation\n","How To Apply":"https:\/\/www.naukri.com\/job-listings-service-desk-associate-fresher-international-voice-process-unisys-india-pvt-ltd-bengaluru-bangalore-0-to-1-years-140720903815?src=jobsearchDesk&sid=16001172892275665_2 - ","Desired Skills":"Excellent verbal and written communication.\nGood Knowledge On Operating Systems, Hardware, Networking and MS Applications.\nGood knowledge of Microsoft Office Suite (Word, Excel, Outlook etc.)\nWell versed with technology (understanding of networks, monitoring, DBMS, Windows).\nMultitasking and coordination skills.\nExcellent judgment skills to be able to properly evaluate situations and immediately provide effective solutions\nWillingness and ability to work in shifts (24×7).\nTeam Player.\n","Job Position":"Service Desk Associate (Technical Support Engineer) – Voice Process\n","Summary":"Unisys Freshers Recruitment in Bangalore For Service Desk Associate Position. Any Graduate, Post Graduate Freshers are eligible to apply for this job. More details regarding Unisys Bangalore Freshers Job Openings is given below.","postTitle":"Unisys Freshers Recruitment | Service Desk Associate | Bangalore"},{"Job Location":"Bangalore\n","Navigation":"accenture-recruitment-service-desk-voice-support-0-2-years-bangalore","Job Category":"BPO\n","Job Description":"You will be aligned with our Customer Support vertical and help us in managing\/ resolving customers query, handling escalations and complaints of the dissatisfied customers & giving best resolutions.\nYou will also be responsible for closing the fault and complaints within SLA’s.\nYou will be working as a part of Query Management team which is accountable for the Inbound\/Outbound calls and e-mail\/chat support to resolve customer issue.\nIn Service Desk Voice Support team you will be responsible to perform day to day operations while maintaining SLA’s & solve queries related to disputes and coordinating with customer.\nYou will be recording, diagnosing, troubleshooting, resolving or assigning incidents and service requests based on defined scope of support.\nYou will have to manage unplanned interruptions to restore normal service operations as quickly as possible for voice interactions.\nGood to have skills: Good communication skills, Effectively collaboration and team work, Adaptable and flexible, Interpersonal skills, Time Management.\n","Date":"20-Sep-2020","Job Responsibilities":"In this role you are required to solve routine problems, largely through precedent and referral to general guidelines.\nInteraction is within own team and direct supervisor.\nDetailed instructions on all tasks will be provided at this role with close supervision.\nDecisions made impact own work and are closely supervised.\nIndividual contributor as a part of a team with a predetermined, narrow scope of work.\nPlease note that this role may require you to work in rotational shifts.\n","Company Name":"Accenture\n","Experience":"0 to 2 years\n","Qualification":"Any Graduation\/Under Graduate\/Diploma in Any Discipline\n","How To Apply":"https:\/\/www.accenture.com\/in-en\/careers\/jobdetails?id=42273_india_2 - ","Job Position":"Query Management – Service Desk Voice Support\n","Summary":"Accenture Recruitment in Bangalore For Service Desk Voice Support. Diploma, Under Graduate, Any Graduates are eligible to apply for this job. More details regarding Accenture Bangalore Job Openings is given below.","postTitle":"Accenture Recruitment | Service Desk Voice Support (0-2 years) | Bangalore","Job Designation":"Associate\n"}]}